[
    {
      "time": "sabah",
      "arabic": "اللّهُ لا إِلٰهَ إِلاّ هُوَ الْحَيُّ الْقَيُّومُ، لا تَأْخُذُهُ سِنَةٌ وَلا نَوْمٌ، لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ، مَنْ ذَا الَّذِي يَشْفَعُ عِندَهُ إِلاَّ بِإِذْنِهِ، يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ، وَلا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء، وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ، وَلا يَؤُودُهُ حِفْظُهُمَا، وَهُوَ الْعَلِيُّ الْعَظِيمُ.",
      "transliteration": "Allahu la ilaha illa huwa al-Hayyul Qayyum. La ta’khudhuhu sinatun wa la nawm. Lahu ma fissamawati wama fil-ard. Man tha allathee yashfa’u ‘indahu illa bi-idhnihi. Ya’lamu ma bayna aydihim wama khalfahum, wa la yuhituna bishay’in min ‘ilmihi illa bima sha’a. Wasi’a kursiyyuhu assamawati wal-ard, wa la ya’uduhu hifdhuhuma, wa huwa al-‘Aliyyul-‘Azim.",
      "translation": "Allah – there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great.",
      "repeat": 1
    },
    {
      "time": "sabah",
      "arabic": "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ.",
      "transliteration": "Qul huwa Allahu ahad, Allahu assamad, Lam yalid wa lam yulad, Wa lam yakun lahu kufuwan ahad.",
      "translation": "Say: He is Allah, the One. Allah, the Eternal Refuge. He neither begets nor is born, nor is there to Him any equivalent.",
      "repeat": 3
    },
    
    {
        "time": "sabah",
        "arabic": "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُ بِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.",
        "transliteration": "Asbahna wa asbaha al-mulku lillahi walhamdu lillah, la ilaha illa Allah wahdahu la sharika lahu, lahu al-mulku walahu al-hamdu, wahuwa 'ala kulli shay'in qadeer. Rabbi as'alu ka khayra ma fi hadha al-yawm wa khayra ma ba'dah, wa a'udhu bika min sharri ma fi hadha al-yawm wa sharri ma ba'dah, rabbi a'udhu bika min al-kasali wa su'i al-kibar, rabbi a'udhu bika min 'adhabin fi al-nar wa 'adhabin fi al-qabr.",
        "translation": "We have entered the morning, and all sovereignty belongs to Allah, and all praise belongs to Allah. There is no god but Allah alone, with no partner to Him. To Him belongs the dominion and to Him belongs the praise, and He is over all things capable. My Lord, I ask You for the good of this day and the good after it, and I seek refuge in You from the evil of this day and the evil after it. My Lord, I seek refuge in You from laziness and the evil of old age. My Lord, I seek refuge in You from the punishment of the Hellfire and the punishment of the grave.",
        "repeat": 1
      },      


    {
      "time": "masaa",
      "arabic": "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ...",
      "transliteration": "Amsayna wa amsa al-mulku lillah, walhamdu lillah, la ilaha illa Allah wahdahu la sharika lah, lahu al-mulku walahu al-hamdu wa huwa 'ala kulli shay'in qadeer...",
      "translation": "We have entered a new evening, and so has the entire dominion, all belonging to Allah. All praise is due to Allah. There is no god but Allah, alone without partner. His is the dominion, and to Him belongs all praise, and He is able to do all things.",
      "repeat": 1
    },
    {
        "time": "sabah",
      "arabic": "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه....",
    "transliteration": "Subhanallahi wa bihamdihi 'adada khalqih, wa rida nafsih, wa zinata 'arshih, wa midada kalimatih.",
    "translation": "Glory be to Allah and praise be to Him, by the multitude of His creation, by His pleasure, by the weight of His Throne, and by the extent of His words.",
    "repeat": 3
  },
    {
        "time": "sabah",
        "arabic": "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.",
        "transliteration": "Allahumma 'aafini fi badani, Allahumma 'aafini fi sam'i, Allahumma 'aafini fi basari, la ilaha illa ant.",
        "translation": "O Allah, grant me health in my body. O Allah, grant me health in my hearing. O Allah, grant me health in my sight. There is no god but You.",
        "repeat": 3
      },
      {
        "time": "sabah",
        "arabic": "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.",
        "transliteration": "Allahumma inni a'udhu bika minal-kufri wal-faqr, wa a'udhu bika min 'adhab il-qabr, la ilaha illa ant.",
        "translation": "O Allah, I seek refuge in You from disbelief and poverty, and I seek refuge in You from the torment of the grave. There is no god but You.",
        "repeat": 3
      },
      {
        "time": "sabah",
        "arabic": "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.",
        "transliteration": "Allahumma inni as'alukal-'afwa wal-'aafiyah fid-dunya wal-akhirah, Allahumma inni as'alukal-'afwa wal-'aafiyah fi deeni wa dunyaya wa ahli wa mali, Allahummas-tur 'awrati wa aamin raw'ati, Allahummah-fadhni min bayni yadayya wa min khalfi wa 'an yameeni wa 'an shimali, wa min fawqi, wa a'udhu bi'adhamatika an ughtala min tahti.",
        "translation": "O Allah, I ask You for forgiveness and well-being in this world and in the Hereafter. O Allah, I ask You for forgiveness and well-being in my religion, my worldly affairs, my family and my wealth. O Allah, conceal my faults and grant me safety from my fears. O Allah, protect me from before me and from behind me, from my right and from my left, and from above me, and I seek refuge in Your greatness from being assassinated from beneath me.",
        "repeat": 1
      },
      {
        "time": "sabah",
        "arabic": "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.",
        "transliteration": "Ya Hayyu Ya Qayyum bi rahmatika astagheeth, aslih li sha'ni kullahu wa la takilni ila nafsi tarfata 'ayn.",
        "translation": "O Ever-Living, O Sustainer! By Your mercy I seek help! Rectify for me all of my affairs and do not leave me to myself, even for the blink of an eye.",
        "repeat": 3
      },
      {
        "time": "sabah",
        "arabic": "أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.",
        "transliteration": "Asbahna wa asbahal-mulku lillahi rabbil-'alameen, Allahumma inni as'aluka khayra hadhal-yawm, fathahu, wa nasrahu, wa nurahu, wa barakatahu, wa hudah, wa a'udhu bika min sharri ma feehi wa sharri ma ba'dah.",
        "translation": "We have entered a new morning, and so has the entire dominion, all belonging to Allah, the Lord of the worlds. O Allah, I ask You for the good of this day, its victory, its help, its light, its blessings, and its guidance, and I seek refuge in You from the evil that is in it and the evil that follows it.",
        "repeat": 1
      },
      {
        "time": "sabah",
        "arabic": "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.",
        "transliteration": "Allahumma 'aalimal-ghaybi wash-shahadah, fatiras-samawati wal-ard, rabba kulli shay'in wa maleekah, ash-hadu an la ilaha illa ant, a'udhu bika min sharri nafsi wa min sharrish-shaytani wa shirkihi, wa an aqtarifa 'ala nafsi soo'an aw ajurrahu ila muslim.",
        "translation": "O Allah, Knower of the unseen and the seen, Creator of the heavens and the earth, Lord of everything and its Sovereign, I bear witness that there is no god but You. I seek refuge in You from the evil of my own soul and from the evil of Satan and his shirk, and from committing evil against myself or bringing it upon a Muslim.",
        "repeat": 1
      },
      {
        "time": "sabah",
        "arabic": "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.",
        "transliteration": "A'udhu bikalimatillahit-tammati min sharri ma khalaq.",
        "translation": "I seek refuge in the perfect words of Allah from the evil of what He has created.",
        "repeat": 3
      },
      {
        "time": "sabah",
        "arabic": "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.",
        "transliteration": "Allahumma salli wa sallim wa barik 'ala nabiyyina Muhammad.",
        "translation": "O Allah, send Your peace and blessings upon our Prophet Muhammad.",
        "repeat": 10
      },
      {
        "time": "sabah",
        "arabic": "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.",
        "transliteration": "Allahumma inna na'udhu bika min an nushrika bika shay'an na'lamuh, wa nastaghfiruka lima la na'lamuh.",
        "translation": "O Allah, we seek refuge in You from knowingly associating anything with You, and we ask Your forgiveness for what we do not know.",
        "repeat": 3
      },
      {
        "time": "sabah",
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.",
        "transliteration": "Allahumma inni a'udhu bika minal-hammi wal-hazani, wa a'udhu bika minal-'ajzi wal-kasali, wa a'udhu bika minal-jubni wal-bukhli, wa a'udhu bika min ghalabatid-dayni wa qahrir-rijal.",
        "translation": "O Allah, I seek refuge in You from worry and grief, and I seek refuge in You from helplessness and laziness, and I seek refuge in You from cowardice and stinginess, and I seek refuge in You from being overcome by debt and overpowered by men.",
        "repeat": 3
      },
      {
        "time": "sabah",
        "arabic": "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.",
        "transliteration": "Astaghfirullahal-'adheem alladhi la ilaha illa huwal-hayyul-qayyoomu wa atoobu ilayh.",
        "translation": "I ask Allah for forgiveness, the Mighty, whom there is no god but He, the Living, the Sustaining, and I repent to Him.",
        "repeat": 3
      },
      {
        "time": "sabah",
        "arabic": "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.",
        "transliteration": "Ya Rabbi, lakal-hamdu kama yanbaghi lijalali wajhika wa li'adheemi sultanik.",
        "translation": "O my Lord, to You belongs praise as befits the glory of Your Face and the greatness of Your might.",
        "repeat": 3
      },
      {
        "time": "sabah",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا.",
        "transliteration": "Allahumma inni as'aluka 'ilman naafi'a, wa rizqan tayyiba, wa 'amalan mutaqabbala.",
        "translation": "O Allah, I ask You for beneficial knowledge, good provision, and accepted deeds.",
        "repeat": 1
      },
      {
        "time": "sabah",
        "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.",
        "transliteration": "Allahumma anta rabbi la ilaha illa ant, 'alayka tawakkaltu, wa anta rabbul-'arshil-'adheem. Ma sha'a Allahu kana, wa ma lam yasha' lam yakun, wa la hawla wa la quwwata illa billahil-'aliyyil-'adheem. A'lamu annallaha 'ala kulli shay'in qadeer, wa annallaha qad ahata bikulli shay'in 'ilma. Allahumma inni a'udhu bika min sharri nafsi, wa min sharri kulli dabbatin anta akhidhun binasiyatiha, inna rabbi 'ala siratin mustaqeem.",
        "translation": "O Allah, You are my Lord, there is no god but You. Upon You I rely, and You are the Lord of the Great Throne. Whatever Allah wills comes to pass, and whatever He does not will does not happen. There is no power and no strength except with Allah, the Most High, the Most Great. I know that Allah has power over all things, and that Allah encompasses all things in knowledge. O Allah, I seek refuge in You from the evil of my own soul and from the evil of every creature that You hold by its forelock. Indeed, my Lord is on a straight path.",
        "repeat": 1
      },
      {
        "time": "sabah",
        "arabic": "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.",
        "transliteration": "La ilaha illallahu wahdahu la shareeka lah, lahul-mulku walahul-hamdu wahuwa 'ala kulli shay'in qadeer.",
        "translation": "There is no god but Allah, alone without partner. To Him belongs the dominion, and to Him belongs all praise, and He is able to do all things.",
        "repeat": 10
      },
      {
        "time": "sabah",
        "arabic": "سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
        "transliteration": "SubhanAllahi wa bihamdihi.",
        "translation": "Glory be to Allah and praise be to Him.",
        "repeat": 100
      },
      {
        "time": "sabah",
        "arabic": "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ.",
        "transliteration": "Astaghfirullaha wa atoobu ilayh.",
        "translation": "I seek the forgiveness of Allah and repent to Him.",
        "repeat": 100
      },
      {
        "time": "masaa",
        "arabic": "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\n\nاللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255]",
        "transliteration": "A'udhu billahi min ash-shaytan ir-rajim\n\nAllahu la ilaha illa huwa al-Hayy al-Qayyum, la ta'khudhuhu sinatun wa la nawm, lahu ma fi as-samawati wa ma fi al-ard, man dha alladhi yashfa'u 'indahu illa bi idhnih, ya'lamu ma bayna aydeehim wa ma khalfahum, wa la yuhituna bi shay'in min 'ilmihi illa bima sha'a, wasi'a kursiyyuhu as-samawati wa al-ard, wa la ya'uduhu hifdhuhuma, wa huwa al-'Aliyy al-'Adheem. [Ayat al-Kursi - Al-Baqarah 255]",
        "translation": "I seek refuge in Allah from the accursed Satan.\n\nAllah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great. [The Throne Verse - Al-Baqarah 255]",
        "repeat": 1
      },
      {
        "time": "masaa",
        "arabic": "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\n\nآمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. [البقرة 285 - 286]",
        "transliteration": "A'udhu billahi min ash-shaytan ir-rajim\n\nAmana ar-rasulu bima unzila ilayhi min rabbihi wal mu'minun, kullun amana billahi wa mala'ikatihi wa kutubihi wa rusulih, la nufarriqu bayna ahadin min rusulih, wa qalu sami'na wa ata'na, ghufranaka rabbana wa ilayka al-masir. La yukallifu Allahu nafsan illa wus'aha, laha ma kasabat wa 'alayha ma aktasabat, rabbana la tu'akhidhna in naseena aw akhta'na, rabbana wa la tahmil 'alayna isran kama hamaltahu 'ala alladhina min qablina, rabbana wa la tuhammilna ma la taqata lana bih, wa'fu 'anna waghfir lana warhamna, anta mawlana fansurna 'ala al-qawm al-kafirin. [Al-Baqarah 285-286]",
        "translation": "I seek refuge in Allah from the accursed Satan.\n\nThe Messenger has believed in what was revealed to him from his Lord, and [so have] the believers. All of them have believed in Allah and His angels and His books and His messengers, [saying], 'We make no distinction between any of His messengers.' And they say, 'We hear and we obey. [We seek] Your forgiveness, our Lord, and to You is the [final] destination.' Allah does not charge a soul except [with that within] its capacity. It will have [the consequence of] what [good] it has gained, and it will bear [the consequence of] what [evil] it has earned. 'Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people.' [Al-Baqarah 285-286]",
        "repeat": 1
      },
      {
        "time": "masaa",
        "arabic": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.",
        "transliteration": "Bismillah ir-Rahman ir-Raheem\nQul huwa Allahu ahad, Allahu as-samad, lam yalid wa lam yulad, wa lam yakun lahu kufuwan ahad.",
        "translation": "In the name of Allah, the Most Gracious, the Most Merciful\nSay, 'He is Allah, [who is] One, Allah, the Eternal Refuge. He neither begets nor is born, Nor is there to Him any equivalent.'",
        "repeat": 3
      },
      {
        "time": "masaa",
        "arabic": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.",
        "transliteration": "Bismillah ir-Rahman ir-Raheem\nQul a'udhu bi rabbi al-falaq, min sharri ma khalaq, wa min sharri ghasiqin idha waqab, wa min sharri an-naffathati fi al-'uqad, wa min sharri hasidin idha hasad.",
        "translation": "In the name of Allah, the Most Gracious, the Most Merciful\nSay, 'I seek refuge in the Lord of daybreak, From the evil of that which He created, And from the evil of darkness when it settles, And from the evil of the blowers in knots, And from the evil of an envier when he envies.'",
        "repeat": 3
      },
      {
        "time": "masaa",
        "arabic": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n\nقُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.",
        "transliteration": "Bismillah ir-Rahman ir-Raheem\n\nQul a'udhu bi rabbi an-nas, maliki an-nas, ilahi an-nas, min sharri al-waswasi al-khannas, alladhi yuwaswisu fi suduri an-nas, min al-jinnati wa an-nas.",
        "translation": "In the name of Allah, the Most Gracious, the Most Merciful\n\nSay, 'I seek refuge in the Lord of mankind, The Sovereign of mankind, The God of mankind, From the evil of the retreating whisperer - Who whispers [evil] into the breasts of mankind - From among the jinn and mankind.'",
        "repeat": 3
      },
      {
        "time": "masaa",
        "arabic": "أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.",
        "transliteration": "Amsayna wa amsa al-mulku lillah walhamdu lillah, la ilaha illa Allahu wahdahu la sharika lah, lahu al-mulku wa lahu al-hamdu wa huwa 'ala kulli shay'in qadeer, rabbi as'aluka khayra ma fi hadhihi al-laylati wa khayra ma ba'daha, wa a'udhu bika min sharri ma fi hadhihi al-laylati wa sharri ma ba'daha, rabbi a'udhu bika min al-kasali wa su'i al-kibar, rabbi a'udhu bika min 'adhabin fi an-nari wa 'adhabin fi al-qabr.",
        "translation": "We have entered evening and the dominion belongs to Allah, and all praise is for Allah. There is none worthy of worship except Allah alone, without partner. To Him belongs the dominion and to Him belongs all praise, and He is over all things omnipotent. My Lord, I ask You for the good of this night and the good of what follows it, and I seek refuge in You from the evil of this night and the evil of what follows it. My Lord, I seek refuge in You from laziness and the evil of old age. My Lord, I seek refuge in You from the punishment of the Fire and the punishment of the grave.",
        "repeat": 1
      },
      {
        "time": "masaa",
        "arabic": "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .",
        "transliteration": "Allahumma anta rabbi la ilaha illa ant, khalaqtani wa ana 'abduk, wa ana 'ala 'ahdika wa wa'dika ma astata't, a'udhu bika min sharri ma sana't, abu'u laka bi ni'matika 'alayya wa abu'u bi dhanbi, faghfir li fa innahu la yaghfiru adh-dhunuba illa ant.",
        "translation": "O Allah, You are my Lord, there is none worthy of worship except You. You created me and I am Your servant, and I am upon Your covenant and promise as much as I am able. I seek refuge in You from the evil of what I have done. I acknowledge Your favor upon me and I acknowledge my sin, so forgive me, for none forgives sins except You.",
        "repeat": 1
      },
      {
        "time": "masaa",
        "arabic": "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.",
        "transliteration": "Radheetu billahi rabban wa bil-islami deenan wa bi-Muhammadin sallallahu 'alayhi wa sallama nabiyya.",
        "translation": "I am pleased with Allah as my Lord, with Islam as my religion, and with Muhammad (peace be upon him) as my Prophet.",
        "repeat": 3
      },
      {
        "time": "masaa",
        "arabic": "اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
        "transliteration": "Allahumma inni amsytu ush-hiduk, wa ush-hidu hamalata 'arshik, wa mala'ikatak, wa jami'a khalqik, annaka ant Allahu la ilaha illa ant wahdaka la sharika lak, wa anna Muhammadan 'abduka wa rasuluk.",
        "translation": "O Allah, I have entered a new evening and I call upon You and upon the bearers of Your Throne, upon Your angels and all creation to bear witness that surely You are Allah, there is none worthy of worship except You, alone, without partner, and that Muhammad is Your servant and Your Messenger.",
        "repeat": 4
      },
      {
        "time": "masaa",
        "arabic": "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
        "transliteration": "Allahumma ma amsa bi min ni'matin aw bi ahadin min khalqik, fa minka wahdaka la sharika lak, fa lak al-hamdu wa lak ash-shukr.",
        "translation": "O Allah, whatever blessing has been received by me or by any of Your creation in this evening, is from You alone, You have no partner. So for You is all praise and unto You all thanks.",
        "repeat": 1
      },
      {
        "time": "masaa",
        "arabic": "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.",
        "transliteration": "Hasbiya Allahu la ilaha illa huwa, 'alayhi tawakkaltu wa huwa rabbu al-'arsh al-'adheem.",
        "translation": "Sufficient for me is Allah, there is none worthy of worship except Him. Upon Him I have relied and He is the Lord of the Great Throne.",
        "repeat": 7
      },
      {
        "time": "masaa",
        "arabic": "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
        "transliteration": "Bismillah alladhi la yadurru ma' ismihi shay'un fi al-ardi wa la fi as-sama'i wa huwa as-sami'u al-'aleem.\n\nLam yadhurru min Allah shay'.",
        "translation": "In the name of Allah, with whose name nothing can cause harm on earth nor in the heavens, and He is the All-Hearing, the All-Knowing.\n\nNothing will harm him from Allah.",
        "repeat": 3
      },
      {
        "time": "masaa",
        "arabic": "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ.",
        "transliteration": "Allahumma bika amsayna wa bika asbahna, wa bika nahya wa bika namutu wa ilayka al-masir.",
        "translation": "O Allah, by Your leave we have entered evening and by Your leave we have entered morning, by Your leave we live and die, and unto You is our return.",
        "repeat": 1
      },
      {
        "time": "masaa",
        "arabic": "أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
        "transliteration": "Amsayna 'ala fitrati al-islam, wa 'ala kalimati al-ikhlas, wa 'ala deeni nabiyyina Muhammadin sallallahu 'alayhi wa sallam, wa 'ala millati abina Ibrahim hanifan musliman wa ma kana min al-mushrikin.",
        "translation": "We have entered evening upon the natural religion of Islam, and upon the word of sincerity, and upon the religion of our Prophet Muhammad (peace be upon him), and upon the way of our father Abraham, inclining toward truth as a Muslim and not being of those who associate others with Allah.",
        "repeat": 1
      },
      {
        "time": "masaa",
        "arabic": "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.",
        "transliteration": "Subhan Allahi wa bihamdihi, 'adada khalqihi, wa ridha nafsihi, wa zinata 'arshihi, wa midada kalimatihi.",
        "translation": "Glory is to Allah and praise is to Him, by the multitude of His creation, by His pleasure, by the weight of His Throne, and by the extent of His words.",
        "repeat": 3
      },
      {
        "time": "masaa",
        "arabic": "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.",
        "transliteration": "Allahumma 'afini fi badani, Allahumma 'afini fi sam'i, Allahumma 'afini fi basari, la ilaha illa ant.",
        "translation": "O Allah, grant health to my body. O Allah, grant health to my hearing. O Allah, grant health to my eyesight. There is none worthy of worship except You.",
        "repeat": 3
      },
      {
        "time": "masaa",
        "arabic": "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.",
        "transliteration": "Allahumma inni a'udhu bika min al-kufr, wa al-faqr, wa a'udhu bika min 'adhabi al-qabr, la ilaha illa ant.",
        "translation": "O Allah, I seek refuge in You from disbelief and poverty, and I seek refuge in You from the punishment of the grave. There is none worthy of worship except You.",
        "repeat": 3
      },
      {
        "time": "masaa",
        "arabic": "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.",
        "transliteration": "Allahumma inni as'aluka al-'afwa wal-'afiyata fi ad-dunya wal-akhirah, Allahumma inni as'aluka al-'afwa wal-'afiyata fi deeni wa dunyaya wa ahli wa mali, Allahumma astur 'awrati wa amin raw'ati, Allahumma ihfazni min bayni yadayya wa min khalfi wa 'an yameeni wa 'an shimali, wa min fawqi, wa a'udhu bi 'azamatika an ughtala min tahti.",
        "translation": "O Allah, I ask You for pardon and well-being in this life and the next. O Allah, I ask You for pardon and well-being in my religious and worldly affairs, and my family and my wealth. O Allah, conceal my faults and calm my fears. O Allah, protect me from before me and behind me, from my right and my left, and from above me, and I seek refuge in Your greatness from being taken unaware from beneath me.",
        "repeat": 1
      },
      {
        "time": "masaa",
        "arabic": "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.",
        "transliteration": "Ya Hayyu ya Qayyum bi rahmatika astaghith, aslih li sha'ni kullahu wa la takilni ila nafsi tarfata 'ayn.",
        "translation": "O Ever-Living, O Sustainer, in Your mercy I seek relief, rectify for me all of my affairs and do not leave me to myself even for the blink of an eye.",
        "repeat": 3
      },
      {
        "time": "masaa",
        "arabic": "أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا.",
        "transliteration": "Amsayna wa amsa al-mulku lillahi rabbi al-'alamin, Allahumma inni as'aluka khayra hadhihi al-laylati fathaha wa nasraha, wa nuraha wa barakataha, wa hudaha, wa a'udhu bika min sharri ma fiha wa sharri ma ba'daha.",
        "translation": "We have entered evening and the dominion belongs to Allah, Lord of the worlds. O Allah, I ask You for the good of this night, its opening, its help, its light, its blessings, and its guidance. And I seek refuge in You from the evil within it and from the evil after it.",
        "repeat": 1
      },
      {
        "time": "masaa",
        "arabic": "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.",
        "transliteration": "Allahumma 'alima al-ghaybi wash-shahadati fatira as-samawati wal-ard, rabba kulli shay'in wa malikah, ashhadu an la ilaha illa ant, a'udhu bika min sharri nafsi wa min sharri ash-shaytani wa shirkih, wa an aqtarifa 'ala nafsi su'an aw ajurrahu ila muslim.",
        "translation": "O Allah, Knower of the unseen and the evident, Maker of the heavens and the earth, Lord of everything and its Possessor, I bear witness that there is none worthy of worship except You. I seek refuge in You from the evil of my soul and from the evil of Satan and his helpers, and from committing wrong against my soul or bringing it upon any Muslim.",
        "repeat": 1
      },
      {
        "time": "masaa",
        "arabic": "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.",
        "transliteration": "A'udhu bi kalimati Allahi at-tammati min sharri ma khalaq.",
        "translation": "I seek refuge in the perfect words of Allah from the evil of what He has created.",
        "repeat": 1
      },
      {
        "time": "masaa",
        "arabic": "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.",
        "transliteration": "Allahumma salli wa sallim wa barik 'ala nabiyyina Muhammad.",
        "translation": "O Allah, send prayers, peace and blessings upon our Prophet Muhammad.",
        "repeat": 10
      },
      {
        "time": "masaa",
        "arabic": "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.",
        "transliteration": "Allahumma inna na'udhu bika min an nushrika bika shay'an na'lamuh, wa nastaghfiruka lima la na'lamuh.",
        "translation": "O Allah, we seek refuge in You from knowingly associating partners with You, and we seek Your forgiveness for what we do unknowingly.",
        "repeat": 3
      },
      {
        "time": "masaa",
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.",
        "transliteration": "Allahumma inni a'udhu bika min al-hammi wal-hazan, wa a'udhu bika min al-'ajzi wal-kasal, wa a'udhu bika min al-jubni wal-bukhl, wa a'udhu bika min ghalabati ad-dayn wa qahri ar-rijal.",
        "translation": "O Allah, I seek refuge in You from worry and grief, from incapacity and laziness, from cowardice and miserliness, from being heavily in debt and from being overpowered by men.",
        "repeat": 3
      },
      {
        "time": "masaa",
        "arabic": "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.",
        "transliteration": "Astaghfiru Allah al-'adheem alladhi la ilaha illa huwa, al-Hayyu al-Qayyum, wa atubu ilayh.",
        "translation": "I seek the forgiveness of Allah the Mighty, Whom there is none worthy of worship except Him, the Ever-Living, the Sustainer of existence, and I repent to Him.",
        "repeat": 3
      },
      {
        "time": "masaa",
        "arabic": "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.",
        "transliteration": "Ya rabbi, lak al-hamdu kama yanbaghi li jalali wajhika, wa li 'adheemi sultanik.",
        "translation": "O my Lord, all praise is for You as it should be due to Your Majesty and Your great sovereignty.",
        "repeat": 3
      },
      {
        "time": "masaa",
        "arabic": "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.",
        "transliteration": "La ilaha ill Allahu wahdahu la sharika lah, lahu al-mulku wa lahu al-hamdu wa huwa 'ala kulli shay'in qadeer.",
        "translation": "There is none worthy of worship except Allah alone, without partner. His is the dominion and His is the praise, and He is over all things omnipotent.",
        "repeat": 10
      },
      {
        "time": "masaa",
        "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.",
        "transliteration": "Allahumma anta Rabbi la ilaha illa Anta, 'alayka tawakkaltu, wa Anta Rabbul-'Arshil-'Adheem. Ma sha'a Allahu kana, wa ma lam yasha' lam yakun, wa la hawla wa la quwwata illa billahil-'Aliyyil-'Adheem. A'lamu annallaha 'ala kulli shay'in qadeer, wa annallaha qad ahata bikulli shay'in 'ilma. Allahumma inni a'oodhu bika min sharri nafsi, wa min sharri kulli dabbatin anta akhidhun binasiyatiha, inna Rabbi 'ala siratin mustaqeem.",
        "translation": "O Allah, You are my Lord, there is no god but You. Upon You I rely, and You are the Lord of the Mighty Throne. What Allah wills happens, and what He does not will does not happen. There is no might and no power except by Allah, the Exalted, the Mighty. I know that Allah has power over all things, and that Allah encompasses all things in knowledge. O Allah, I seek refuge in You from the evil of my own soul and from the evil of every creature that is under Your control. Verily, my Lord is on a straight path.",
        "repeat": 1
      }
  ]
  