{
  "guides": [
    {
      "id": "ghusl",
      "title": {
        "ar": "كيفية أداء الغسل (الطهارة الكبرى)",
        "en": "How to Perform Ghusl (Full Ritual Purification)"
      },
      "category": {
        "ar": "الطهارة",
        "en": "Purification"
      },
      "description": {
        "ar": "دليل شامل ومفصل لأداء الغسل الشرعي بالطريقة الصحيحة وفق السنة النبوية، مع توضيح الأحكام والنصائح العملية",
        "en": "A comprehensive and detailed guide for performing Islamic ritual purification (ghusl) correctly according to the Prophetic tradition, including rulings and practical tips"
      },
      "icon": "fas fa-droplet",
      "steps": [
        {
          "title": {
            "ar": "النية",
            "en": "Intention (Niyyah)"
          },
          "description": {
            "ar": "اعقد النية في قلبك لأداء الغسل لرفع الجنابة أو الحدث الأكبر، مثل الجنابة بعد الجماع أو الحيض أو النفاس. لا داعي لنطق النية باللسان، فالنية عمل قلبي. تأكد من أن النية خالصة لله تعالى.",
            "en": "Make a sincere intention in your heart to perform ghusl to remove major ritual impurity, such as after sexual intercourse, menstruation, or postpartum bleeding. The intention does not need to be verbalized, as it is an act of the heart. Ensure the intention is solely for Allah’s sake."
          },
          "tips": {
            "ar": "تجنب التفكير في أمور دنيوية أثناء النية للحفاظ على الإخلاص.",
            "en": "Avoid worldly thoughts during the intention to maintain sincerity."
          }
        },
        {
          "title": {
            "ar": "التسمية",
            "en": "Saying Bismillah"
          },
          "description": {
            "ar": "قل 'بسم الله الرحمن الرحيم' قبل البدء بالغسل، ويفضل أن تقولها بصوت منخفض إذا كنت في مكان عام مثل الحمام. إذا نسيت التسمية في البداية، يمكنك قولها عند التذكر.",
            "en": "Say 'Bismillah Ar-Rahman Ar-Raheem' before starting ghusl, preferably in a low voice if in a public place like a bathroom. If you forget to say it at the start, you can say it when you remember."
          },
          "tips": {
            "ar": "إذا كنت في مكان لا يجوز فيه ذكر الله، مثل دورة المياه، يمكن قول التسمية في القلب.",
            "en": "If you’re in a place where mentioning Allah’s name is inappropriate, like a bathroom, say Bismillah in your heart."
          }
        },
        {
          "title": {
            "ar": "غسل اليدين",
            "en": "Washing Hands"
          },
          "description": {
            "ar": "اغسل يديك اليمنى ثم اليسرى ثلاث مرات حتى المعصمين، مع التأكد من وصول الماء إلى بين الأصابع. ابدأ باليد اليمنى دائماً كما ورد في السنة.",
            "en": "Wash your right hand then your left hand three times up to the wrists, ensuring water reaches between the fingers. Always start with the right hand, as per the Sunnah."
          },
          "tips": {
            "ar": "استخدم الصابون إذا كانت اليدين متسختين قبل الغسل لضمان النظافة.",
            "en": "Use soap if your hands are dirty before washing to ensure cleanliness."
          }
        },
        {
          "title": {
            "ar": "إزالة النجاسة",
            "en": "Removing Impurities"
          },
          "description": {
            "ar": "اغسل الأعضاء التناسلية جيداً باستخدام يدك اليسرى، وتأكد من إزالة أي نجاسة مثل البول أو المني أو دم الحيض. إذا كنتِ امرأة في فترة الحيض أو النفاس، تأكدي من تنظيف المنطقة جيداً.",
            "en": "Wash the private parts thoroughly using your left hand, ensuring the removal of any impurities such as urine, semen, or menstrual blood. If you are a woman during menstruation or postpartum, ensure the area is cleaned thoroughly."
          },
          "tips": {
            "ar": "استخدم الماء الجاري لضمان إزالة النجاسة بالكامل.",
            "en": "Use running water to ensure complete removal of impurities."
          }
        },
        {
          "title": {
            "ar": "الوضوء الكامل",
            "en": "Performing Complete Wudu"
          },
          "description": {
            "ar": "توضأ وضوءاً كاملاً كما تتوضأ للصلاة، بما في ذلك غسل الوجه، اليدين إلى المرفقين، مسح الرأس، وغسل القدمين. يمكن تأخير غسل القدمين إلى نهاية الغسل إذا كنت في مكان يصعب فيه غسل القدمين مباشرة.",
            "en": "Perform a complete wudu as you would for prayer, including washing the face, arms up to the elbows, wiping the head, and washing the feet. You may delay washing the feet until the end of ghusl if it’s difficult to do so immediately."
          },
          "tips": {
            "ar": "إذا كنت قد أجريت وضوءاً صحيحاً قبل الغسل، لا حاجة لتكراره إلا إذا أبطله شيء.",
            "en": "If you performed a valid wudu before ghusl, you don’t need to repeat it unless something invalidates it."
          }
        },
        {
          "title": {
            "ar": "صب الماء على الرأس",
            "en": "Pouring Water on the Head"
          },
          "description": {
            "ar": "صب الماء على رأسك ثلاث مرات، مع التأكد من وصول الماء إلى جذور الشعر وفروة الرأس. إذا كان شعرك طويلاً أو كثيفاً، حركه للتأكد من وصول الماء إلى جميع أجزاء الرأس.",
            "en": "Pour water over your head three times, ensuring it reaches the hair roots and scalp. If your hair is long or thick, move it to ensure water reaches all parts of the scalp."
          },
          "tips": {
            "ar": "للنساء ذوات الشعر المضفور، لا حاجة لفك الضفائر إذا وصل الماء إلى فروة الرأس.",
            "en": "For women with braided hair, there’s no need to undo braids if water reaches the scalp."
          }
        },
        {
          "title": {
            "ar": "غسل الجانب الأيمن",
            "en": "Washing the Right Side"
          },
          "description": {
            "ar": "صب الماء على الجانب الأيمن من الجسم من الكتف إلى القدم، مع فرك الجسم برفق لضمان وصول الماء إلى جميع الأجزاء، بما في ذلك تحت الإبط ومنطقة الفخذ.",
            "en": "Pour water over the right side of the body from shoulder to foot, gently rubbing to ensure water reaches all areas, including under the armpit and thigh area."
          },
          "tips": {
            "ar": "ابدأ دائماً بالجانب الأيمن كما ورد في السنة.",
            "en": "Always start with the right side, as per the Sunnah."
          }
        },
        {
          "title": {
            "ar": "غسل الجانب الأيسر",
            "en": "Washing the Left Side"
          },
          "description": {
            "ar": "صب الماء على الجانب الأيسر من الجسم من الكتف إلى القدم، مع التأكد من تغطية جميع المناطق. تأكد من عدم إهمال أي جزء من الجسم.",
            "en": "Pour water over the left side of the body from shoulder to foot, ensuring all areas are covered. Make sure no part of the body is neglected."
          },
          "tips": {
            "ar": "افرك الجسم برفق لضمان وصول الماء إلى جميع المناطق المغطاة بالشعر أو الجلد الجاف.",
            "en": "Gently rub the body to ensure water reaches areas covered by hair or dry skin."
          }
        },
        {
          "title": {
            "ar": "غسل القدمين",
            "en": "Washing the Feet"
          },
          "description": {
            "ar": "إذا لم تغسل قدميك خلال الوضوء، اغسلهما الآن ثلاث مرات حتى الكعبين، مع التأكد من وصول الماء بين الأصابع. ابدأ بالقدم اليمنى ثم اليسرى.",
            "en": "If you didn’t wash your feet during wudu, wash them now three times up to the ankles, ensuring water reaches between the toes. Start with the right foot, then the left."
          },
          "tips": {
            "ar": "تأكد من إزالة أي طلاء أظافر إذا كان يمنع وصول الماء إلى الأظافر.",
            "en": "Ensure nail polish is removed if it prevents water from reaching the nails."
          }
        }
      ],
      "additional_info": {
        "ar": "الغسل نوعان: واجب (مثل رفع الحدث الأكبر) ومستحب (مثل الغسل للجمعة أو العيد). تأكد من استخدام ماء طهور (نظيف وغير مستعمل). تجنب الإسراف في الماء، واستعمل ما يكفي لإتمام الغسل.",
        "en": "Ghusl is of two types: obligatory (e.g., to remove major impurity) and recommended (e.g., for Friday prayer or Eid). Use pure, clean water. Avoid wasting water and use only what is necessary to complete ghusl."
      },
      "common_mistakes": {
        "ar": "عدم وصول الماء إلى فروة الرأس أو إهمال بعض أجزاء الجسم. نسيان النية أو عدم الترتيب في الخطوات.",
        "en": "Not ensuring water reaches the scalp or neglecting parts of the body. Forgetting the intention or not following the proper sequence."
      }
    },
    {
      "id": "wudu",
      "title": {
        "ar": "كيفية أداء الوضوء",
        "en": "How to Perform Wudu (Ablution)"
      },
      "category": {
        "ar": "الطهارة",
        "en": "Purification"
      },
      "description": {
        "ar": "دليل مفصل لأداء الوضوء الصحيح وفق السنة النبوية، مع النصائح لتجنب الأخطاء الشائعة",
        "en": "Detailed guide for performing correct ablution according to the Prophetic tradition, with tips to avoid common mistakes"
      },
      "icon": "fas fa-hand-sparkles",
      "steps": [
        {
          "title": {
            "ar": "النية",
            "en": "Intention"
          },
          "description": {
            "ar": "اعقد النية في قلبك لأداء الوضوء للطهارة من الحدث الأصغر أو للصلاة. النية عمل قلبي ولا داعي لنطقها.",
            "en": "Make the intention in your heart to perform wudu for purification from minor impurity or for prayer. The intention is an act of the heart and does not need to be spoken."
          },
          "tips": {
            "ar": "ركز على الإخلاص في النية وتجنب التشتت أثناء الوضوء.",
            "en": "Focus on sincerity in the intention and avoid distractions during wudu."
          }
        },
        {
          "title": {
            "ar": "التسمية",
            "en": "Saying Bismillah"
          },
          "description": {
            "ar": "قل 'بسم الله' قبل البدء بالوضوء. إذا نسيت، يمكنك قولها عند التذكر أثناء الوضوء.",
            "en": "Say 'Bismillah' before starting wudu. If you forget, you can say it when you remember during wudu."
          },
          "tips": {
            "ar": "قل التسمية بصوت منخفض إذا كنت في مكان عام.",
            "en": "Say Bismillah in a low voice if in a public place."
          }
        },
        {
          "title": {
            "ar": "غسل اليدين",
            "en": "Washing Hands"
          },
          "description": {
            "ar": "اغسل يديك اليمنى ثم اليسرى ثلاث مرات حتى المعصمين، مع التأكد من وصول الماء إلى بين الأصابع والأظافر.",
            "en": "Wash your right hand then your left hand three times up to the wrists, ensuring water reaches between the fingers and nails."
          },
          "tips": {
            "ar": "إذا كنت ترتدي خاتماً، حركه لضمان وصول الماء تحته.",
            "en": "If wearing a ring, move it to ensure water reaches underneath."
          }
        },
        {
          "title": {
            "ar": "المضمضة",
            "en": "Rinsing the Mouth"
          },
          "description": {
            "ar": "خذ الماء في فمك ومضمض ثلاث مرات، مع تحريك الماء داخل الفم لتنظيف الأسنان واللثة.",
            "en": "Take water into your mouth and rinse three times, moving the water around to clean the teeth and gums."
          },
          "tips": {
            "ar": "استخدم يدك اليمنى لأخذ الماء إلى الفم.",
            "en": "Use your right hand to bring water to your mouth."
          }
        },
        {
          "title": {
            "ar": "الاستنشاق والاستنثار",
            "en": "Sniffing and Blowing Out Water"
          },
          "description": {
            "ar": "استنشق الماء في أنفك بيدك اليمنى ثلاث مرات، ثم أخرجه بيدك اليسرى (الاستنثار). تأكد من أن الاستنشاق خفيف حتى لا يؤذي الأنف.",
            "en": "Sniff water into your nose with your right hand three times, then blow it out with your left hand. Ensure sniffing is gentle to avoid harming the nose."
          },
          "tips": {
            "ar": "تجنب الاستنشاق بقوة إذا كنت تعاني من حساسية الأنف.",
            "en": "Avoid sniffing forcefully if you have nasal sensitivities."
          }
        },
        {
          "title": {
            "ar": "غسل الوجه",
            "en": "Washing the Face"
          },
          "description": {
            "ar": "اغسل وجهك ثلاث مرات من منابت الشعر إلى الذقن ومن الأذن إلى الأذن، مع التأكد من وصول الماء إلى جميع أجزاء الوجه بما في ذلك زوايا العينين.",
            "en": "Wash your face three times from the hairline to the chin and from ear to ear, ensuring water reaches all parts, including the corners of the eyes."
          },
          "tips": {
            "ar": "مرر الماء على اللحية إذا كانت كثيفة لضمان وصوله إلى الجلد تحته.",
            "en": "Run water through a thick beard to ensure it reaches the skin underneath."
          }
        },
        {
          "title": {
            "ar": "غسل اليدين إلى المرفقين",
            "en": "Washing Arms to Elbows"
          },
          "description": {
            "ar": "اغسل ذراعيك إلى المرفقين ثلاث مرات، ابدأ باليمنى ثم اليسرى. تأكد من وصول الماء إلى المرفقين بالكامل.",
            "en": "Wash your arms up to the elbows three times, starting with the right then the left. Ensure water reaches the elbows completely."
          },
          "tips": {
            "ar": "ارفع الأكمام إذا كنت ترتدي ملابس طويلة لتجنب إهمال المرفقين.",
            "en": "Roll up sleeves if wearing long clothing to avoid neglecting the elbows."
          }
        },
        {
          "title": {
            "ar": "مسح الرأس",
            "en": "Wiping the Head"
          },
          "description": {
            "ar": "بلل يديك وامسح رأسك مرة واحدة من المقدمة إلى المؤخرة ثم ارجع إلى المقدمة. يشمل ذلك مسح الشعر وفروة الرأس.",
            "en": "Wet your hands and wipe your head once from front to back and back to front, including the hair and scalp."
          },
          "tips": {
            "ar": "إذا كنت ترتدي غطاء رأس، ارفعه قليلاً لضمان وصول الماء إلى الشعر.",
            "en": "If wearing a head covering, lift it slightly to ensure water reaches the hair."
          }
        },
        {
          "title": {
            "ar": "مسح الأذنين",
            "en": "Wiping the Ears"
          },
          "description": {
            "ar": "امسح داخل الأذنين بأصابعك السبابة وخارجها بالإبهامين مرة واحدة، باستخدام ماء جديد.",
            "en": "Wipe inside the ears with your index fingers and outside with your thumbs once, using fresh water."
          },
          "tips": {
            "ar": "تأكد من تجفيف يديك قبل مسح الأذنين إذا كنت تستخدم ماء جديد.",
            "en": "Dry your hands before wiping the ears if using fresh water."
          }
        },
        {
          "title": {
            "ar": "غسل القدمين",
            "en": "Washing the Feet"
          },
          "description": {
            "ar": "اغسل قدميك إلى الكعبين ثلاث مرات، ابدأ باليمنى ثم اليسرى، مع التأكد من وصول الماء بين الأصابع وعلى الكعبين.",
            "en": "Wash your feet up to the ankles three times, starting with the right then the left, ensuring water reaches between the toes and the ankles."
          },
          "tips": {
            "ar": "إذا كنت ترتدي جوارب، تأكد من إزالتها أو استخدام المسح على الخفين إذا كنت في حالة مسموح بها شرعاً.",
            "en": "If wearing socks, remove them or wipe over leather socks if permissible according to Islamic rulings."
          }
        }
      ],
      "additional_info": {
        "ar": "الوضوء شرط أساسي لصحة الصلاة. يبطل الوضوء بأمور مثل التبول، التبرز، خروج الريح، النوم العميق، أو لمس الفرج بدون حائل. يستحب تجديد الوضوء لكل صلاة لزيادة الأجر.",
        "en": "Wudu is a prerequisite for valid prayer. It is invalidated by actions such as urination, defecation, passing gas, deep sleep, or touching private parts without a barrier. Renewing wudu for each prayer is recommended for extra reward."
      },
      "common_mistakes": {
        "ar": "إهمال غسل جزء من الأعضاء، مثل الكعبين أو المرفقين، أو عدم الالتزام بالترتيب. عدم إزالة ما يمنع وصول الماء مثل طلاء الأظافر أو الشمع.",
        "en": "Neglecting to wash parts of the limbs, like the ankles or elbows, or not following the sequence. Failing to remove barriers like nail polish or wax that prevent water from reaching the skin."
      }
    },
    {
      "id": "salah-steps",
      "title": {
        "ar": "كيفية أداء الصلاة",
        "en": "How to Perform Salah (Prayer)"
      },
      "category": {
        "ar": "الصلاة",
        "en": "Prayer"
      },
      "description": {
        "ar": "دليل شامل ومفصل لأداء الصلاة الواجبة وفق السنة النبوية، مع توضيح الأحكام والنصائح العملية",
        "en": "Comprehensive and detailed guide for performing obligatory prayers according to the Prophetic tradition, including rulings and practical tips"
      },
      "icon": "fas fa-pray",
      "steps": [
        {
          "title": {
            "ar": "الطهارة والاتجاه",
            "en": "Purification and Facing Qibla"
          },
          "description": {
            "ar": "تأكد من أنك في حالة طهارة بالوضوء أو الغسل إذا لزم الأمر. اتجه نحو القبلة (الكعبة في مكة) بدقة باستخدام بوصلة إذا لزم الأمر. تأكد من نظافة الملابس والمكان.",
            "en": "Ensure you are in a state of purification with wudu or ghusl if required. Face the Qibla (Kaaba in Mecca) accurately, using a compass if needed. Ensure your clothes and place of prayer are clean."
          },
          "tips": {
            "ar": "استخدم تطبيقات الهاتف لتحديد اتجاه القبلة إذا كنت في مكان غير مألوف.",
            "en": "Use mobile apps to determine the Qibla direction if in an unfamiliar place."
          }
        },
        {
          "title": {
            "ar": "النية",
            "en": "Intention"
          },
          "description": {
            "ar": "اعقد النية في قلبك لأداء الصلاة المحددة (مثل صلاة الظهر أو العصر) وحدد ما إذا كانت فرضاً أو سنة. النية تكون في القلب ولا حاجة لنطقها.",
            "en": "Make the intention in your heart to perform the specific prayer (e.g., Dhuhr or Asr) and specify whether it’s obligatory or Sunnah. The intention is in the heart and does not need to be verbalized."
          },
          "tips": {
            "ar": "حدد نوع الصلاة (فرض أو نافلة) لتجنب الارتباك.",
            "en": "Specify the type of prayer (obligatory or voluntary) to avoid confusion."
          }
        },
        {
          "title": {
            "ar": "تكبيرة الإحرام",
            "en": "Opening Takbir"
          },
          "description": {
            "ar": "ارفع يديك إلى مستوى الأذنين (للرجال) أو الكتفين (للنساء) وقل 'الله أكبر' بصوت واضح لبدء الصلاة. تأكد من استقامة ظهرك ونظرك إلى مكان السجود.",
            "en": "Raise your hands to ear level (for men) or shoulder level (for women) and say 'Allahu Akbar' clearly to begin the prayer. Ensure your back is straight and your gaze is directed to the place of prostration."
          },
          "tips": {
            "ar": "حافظ على الهدوء والتركيز أثناء التكبيرة لدخول الصلاة بخشوع.",
            "en": "Maintain calmness and focus during the opening Takbir to enter prayer with reverence."
          }
        },
        {
          "title": {
            "ar": "دعاء الاستفتاح",
            "en": "Opening Supplication"
          },
          "description": {
            "ar": "اقرأ دعاء الاستفتاح سراً: 'سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك'. يمكنك اختيار أي دعاء استفتاح آخر من السنة.",
            "en": "Recite the opening supplication silently: 'Subhanakallahumma wa bihamdika wa tabarakasmuk wa ta’ala jadduk wa la ilaha ghayruk.' You may choose another opening supplication from the Sunnah."
          },
          "tips": {
            "ar": "تعلم أكثر من دعاء استفتاح لتتنوع في عبادتك.",
            "en": "Learn multiple opening supplications to diversify your worship."
          }
        },
        {
          "title": {
            "ar": "الفاتحة",
            "en": "Reciting Al-Fatiha"
          },
          "description": {
            "ar": "اقرأ سورة الفاتحة بترتيل وتدبر، وهي ركن أساسي في كل ركعة. تأكد من نطق الحروف بشكل صحيح وقل 'آمين' بعد الانتهاء.",
            "en": "Recite Surah Al-Fatiha with proper recitation and reflection, as it is an essential pillar of each rak’ah. Ensure correct pronunciation of letters and say 'Ameen' after finishing."
          },
          "tips": {
            "ar": "إذا كنت تصلي خلف إمام، استمع لقراءته ولا تقرأ معه إلا إذا كانت الصلاة سرية.",
            "en": "If praying behind an imam, listen to his recitation and don’t recite along unless it’s a silent prayer."
          }
        },
        {
          "title": {
            "ar": "سورة أخرى",
            "en": "Reciting Another Surah"
          },
          "description": {
            "ar": "اقرأ سورة قصيرة أو آيات من القرآن بعد الفاتحة في الركعتين الأوليين من الصلاة. اختر سورة تناسب وقت الصلاة (مثل سور قصيرة في الفجر).",
            "en": "Recite a short surah or verses from the Quran after Al-Fatiha in the first two rak’ahs. Choose a surah suitable for the prayer time (e.g., short surahs for Fajr)."
          },
          "tips": {
            "ar": "حاول حفظ سور جديدة لتتنوع في قراءتك أثناء الصلاة.",
            "en": "Try memorizing new surahs to diversify your recitation during prayer."
          }
        },
        {
          "title": {
            "ar": "الركوع",
            "en": "Bowing (Ruku)"
          },
          "description": {
            "ar": "قل 'الله أكبر' واركع حتى يكون ظهرك مستوياً ويديك على ركبتيك. قل 'سبحان ربي العظيم' ثلاث مرات أو أكثر بطمأنينة.",
            "en": "Say 'Allahu Akbar' and bow until your back is level, with hands on knees. Say 'Subhana Rabbiyal Azeem' three times or more with tranquility."
          },
          "tips": {
            "ar": "تجنب رفع الرأس أو ثني الظهر كثيراً أثناء الركوع للحفاظ على الوضعية الصحيحة.",
            "en": "Avoid raising your head or bending your back too much during ruku to maintain proper posture."
          }
        },
        {
          "title": {
            "ar": "الاعتدال من الركوع",
            "en": "Standing from Bowing"
          },
          "description": {
            "ar": "ارفع ظهرك من الركوع وقل 'سمع الله لمن حمده' ثم 'ربنا ولك الحمد' وأنت واقف باستقامة. توقف لحظة بطمأنينة قبل السجود.",
            "en": "Raise your back from bowing and say 'Sami Allahu liman hamidah,' then 'Rabbana wa lakal hamd' while standing upright. Pause briefly with tranquility before prostrating."
          },
          "tips": {
            "ar": "تأكد من الوقوف باستقامة تامة لتحقيق الطمأنينة.",
            "en": "Ensure you stand fully upright to achieve tranquility."
          }
        },
        {
          "title": {
            "ar": "السجود",
            "en": "Prostration (Sujud)"
          },
          "description": {
            "ar": "قل 'الله أكبر' واسجد على سبعة أعضاء: الجبهة والأنف، الكفين، الركبتين، وأطراف القدمين. قل 'سبحان ربي الأعلى' ثلاث مرات بطمأنينة.",
            "en": "Say 'Allahu Akbar' and prostrate on seven points: forehead and nose, both palms, both knees, and toes. Say 'Subhana Rabbiyal A’la' three times with tranquility."
          },
          "tips": {
            "ar": "حافظ على تباعد الذراعين عن الجسم وعدم وضع المرفقين على الأرض.",
            "en": "Keep your arms away from your body and avoid resting elbows on the ground."
          }
        },
        {
          "title": {
            "ar": "الجلوس بين السجدتين",
            "en": "Sitting Between Prostrations"
          },
          "description": {
            "ar": "اجلس على قدمك اليسرى مع نصب القدم اليمنى وقل 'رب اغفر لي' ثلاث مرات أو أكثر. حافظ على استقامة الظهر.",
            "en": "Sit on your left foot with the right foot upright and say 'Rabbighfir li' three times or more. Keep your back straight."
          },
          "tips": {
            "ar": "اجلس بطمأنينة ولا تعجل بالسجدة الثانية.",
            "en": "Sit with tranquility and don’t rush to the second prostration."
          }
        },
        {
          "title": {
            "ar": "السجدة الثانية",
            "en": "Second Prostration"
          },
          "description": {
            "ar": "قل 'الله أكبر' واسجد مرة أخرى، وقل 'سبحان ربي الأعلى' ثلاث مرات. تأكد من استقرار الأعضاء السبعة على الأرض.",
            "en": "Say 'Allahu Akbar' and prostrate again, saying 'Subhana Rabbiyal A’la' three times. Ensure the seven points are stable on the ground."
          },
          "tips": {
            "ar": "تجنب رفع الجبهة أو الأنف عن الأرض أثناء السجود.",
            "en": "Avoid lifting your forehead or nose off the ground during prostration."
          }
        },
        {
          "title": {
            "ar": "التشهد والسلام",
            "en": "Tashahhud and Salam"
          },
          "description": {
            "ar": "في الركعة الأخيرة، اجلس للتشهد واقرأ التشهد الكامل: 'التحيات لله...' ثم الصلاة الإبراهيمية: 'اللهم صل على محمد...'. ثم سلم يميناً ويساراً قائلاً: 'السلام عليكم ورحمة الله'.",
            "en": "In the final rak’ah, sit for tashahhud and recite the full tashahhud: 'At-tahiyyatu lillahi...' then the Ibrahimi prayer: 'Allahumma salli ‘ala Muhammad...' Then give salam to the right and left, saying: 'Assalamu alaikum wa rahmatullah.'"
          },
          "tips": {
            "ar": "أشر بالسبابة أثناء التشهد عند قول 'إلا الله' لتتبع السنة.",
            "en": "Point with your index finger during tashahhud when saying 'illa Allah' to follow the Sunnah."
          }
        }
      ],
      "additional_info": {
        "ar": "الصلاة خمس صلوات يومية واجبة: الفجر، الظهر، العصر، المغرب، والعشاء. يستحب أداء السنن الرواتب قبل وبعد الصلوات الواجبة. حافظ على الخشوع والهدوء أثناء الصلاة.",
        "en": "Prayer consists of five daily obligatory prayers: Fajr, Dhuhr, Asr, Maghrib, and Isha. It is recommended to perform the Sunnah prayers before and after obligatory prayers. Maintain reverence and calmness during prayer."
      },
      "common_mistakes": {
        "ar": "عدم الخشوع، التسرع في الحركات، أو إهمال أركان الصلاة مثل الطمأنينة أو قراءة الفاتحة.",
        "en": "Lack of reverence, rushing movements, or neglecting prayer pillars like tranquility or reciting Al-Fatiha."
      }
    },
    {
      "id": "hajj-umrah",
      "title": {
        "ar": "مناسك الحج والعمرة",
        "en": "Hajj and Umrah Rituals"
      },
      "category": {
        "ar": "الحج والعمرة",
        "en": "Hajj & Umrah"
      },
      "description": {
        "ar": "دليل شامل ومفصل لأداء مناسك الحج والعمرة وفق السنة النبوية، مع النصائح العملية لتجنب الأخطاء",
        "en": "Comprehensive and detailed guide for performing Hajj and Umrah rituals according to the Prophetic tradition, with practical tips to avoid mistakes"
      },
      "icon": "fas fa-kaaba",
      "steps": [
        {
          "title": {
            "ar": "الإحرام",
            "en": "Entering Ihram"
          },
          "description": {
            "ar": "اغتسل، وارتدِ ثياب الإحرام (للرجال: إزار ورداء، وللنساء: ملابس ساترة). اعقد النية للحج أو العمرة في الميقات، وقل التلبية: 'لبيك اللهم لبيك، لبيك لا شريك لك لبيك...'.",
            "en": "Perform ghusl and wear ihram clothes (for men: izaar and ridaa; for women: modest clothing). Make the intention for Hajj or Umrah at the miqat and recite the Talbiyah: 'Labbayk Allahumma labbayk, labbayk la shareeka laka labbayk...'"
          },
          "tips": {
            "ar": "تأكد من ارتداء ثياب نظيفة ومريحة، وتجنب العطور بعد الإحرام.",
            "en": "Ensure you wear clean, comfortable clothes and avoid perfumes after entering ihram."
          }
        },
        {
          "title": {
            "ar": "دخول مكة والطواف",
            "en": "Entering Mecca and Tawaf"
          },
          "description": {
            "ar": "ادخل المسجد الحرام بالقدم اليمنى وقل دعاء الدخول. ابدأ الطواف من الحجر الأسود، وطف حول الكعبة سبعة أشواط في اتجاه عكس عقارب الساعة، مع الدعاء والذكر.",
            "en": "Enter Masjid al-Haram with the right foot and say the supplication for entering. Begin tawaf at the Black Stone, circling the Kaaba seven times counterclockwise, while supplicating and remembering Allah."
          },
          "tips": {
            "ar": "حاول تقبيل الحجر الأسود أو الإشارة إليه إذا كان هناك زحام.",
            "en": "Try to kiss or point to the Black Stone if it’s crowded."
          }
        },
        {
          "title": {
            "ar": "السعي",
            "en": "Performing Sa’i"
          },
          "description": {
            "ar": "توجه إلى الصفا وابدأ السعي بين الصفا والمروة سبع مرات. ابدأ من الصفا وانتهِ عند المروة، مع الدعاء أثناء السعي.",
            "en": "Proceed to Safa and perform Sa’i between Safa and Marwah seven times, starting at Safa and ending at Marwah, while supplicating."
          },
          "tips": {
            "ar": "سارع قليلاً بين العلمين الأخضرين للرجال كما ورد في السنة.",
            "en": "Hasten slightly between the green markers for men, as per the Sunnah."
          }
        },
        {
          "title": {
            "ar": "الحلق أو التقصير (للعمرة)",
            "en": "Shaving or Trimming Hair (for Umrah)"
          },
          "description": {
            "ar": "بعد السعي، احلق رأسك (للرجال) أو قصر شعرك (للرجال والنساء) لإتمام العمرة. قص مقدار أنملة من الشعر للتقصير.",
            "en": "After Sa’i, shave your head (for men) or trim your hair (for men and women) to complete Umrah. Trim about a fingertip’s length for shortening."
          },
          "tips": {
            "ar": "استخدم أدوات نظيفة لحلق أو تقصير الشعر.",
            "en": "Use clean tools for shaving or trimming hair."
          }
        },
        {
          "title": {
            "ar": "التوجه إلى منى (للحج)",
            "en": "Going to Mina (for Hajj)"
          },
          "description": {
            "ar": "في اليوم الثامن من ذي الحجة (يوم التروية)، توجه إلى منى وصلِ الظهر والعصر والمغرب والعشاء والفجر هناك، مع تقصير الصلوات ذات الأربع ركعات.",
            "en": "On the 8th of Dhul Hijjah (Day of Tarwiyah), go to Mina and pray Dhuhr, Asr, Maghrib, Isha, and Fajr there, shortening the four-rak’ah prayers."
          },
          "tips": {
            "ar": "احمل معك أغراضاً خفيفة وتأكد من معرفة موقع خيمتك في منى.",
            "en": "Carry light essentials and ensure you know your tent’s location in Mina."
          }
        },
        {
          "title": {
            "ar": "الوقوف بعرفة",
            "en": "Standing at Arafat"
          },
          "description": {
            "ar": "في اليوم التاسع (يوم عرفة)، قف في عرفة من الظهر حتى المغرب، وأكثر من الدعاء والذكر والاستغفار، فهو أعظم أركان الحج.",
            "en": "On the 9th (Day of Arafat), stand at Arafat from noon until sunset, engaging in abundant supplication, remembrance, and seeking forgiveness, as it is the greatest pillar of Hajj."
          },
          "tips": {
            "ar": "جهز نفسك بالماء والطعام الخفيف لتحمل الوقوف الطويل.",
            "en": "Prepare with water and light food to endure the long standing."
          }
        },
        {
          "title": {
            "ar": "المبيت بمزدلفة",
            "en": "Staying at Muzdalifah"
          },
          "description": {
            "ar": "بعد المغرب، توجه إلى مزدلفة وبت هناك. اجمع 70 حصاة لرمي الجمرات، وصلِ المغرب والعشاء جمع تأخير.",
            "en": "After sunset, proceed to Muzdalifah and spend the night there. Collect 70 pebbles for stoning and pray Maghrib and Isha combined with delay."
          },
          "tips": {
            "ar": "اجمع الحصى بحجم حبة البازلاء وتجنب الحصى الكبير جداً.",
            "en": "Collect pebbles the size of chickpeas and avoid overly large ones."
          }
        },
        {
          "title": {
            "ar": "رمي الجمرات",
            "en": "Stoning the Pillars"
          },
          "description": {
            "ar": "في يوم العيد، ارم جمرة العقبة الكبرى بسبع حصيات، ثم ارم الجمرات الثلاث في أيام التشريق (11-13 ذو الحجة) بسبع حصيات لكل جمرة يومياً.",
            "en": "On Eid day, stone Jamrat al-Aqabah with seven pebbles. Then, during the days of Tashriq (11th-13th Dhul Hijjah), stone all three pillars with seven pebbles each daily."
          },
          "tips": {
            "ar": "اتبع تعليمات السلامة وتجنب الزحام أثناء الرمي.",
            "en": "Follow safety guidelines and avoid crowds during stoning."
          }
        },
        {
          "title": {
            "ar": "الحلق والنحر",
            "en": "Shaving and Sacrifice"
          },
          "description": {
            "ar": "احلق رأسك أو قصر شعرك، ثم اذبح الهدي إذا كنت في حج تمتع أو قران. يمكن تفويض الذبح لجهة موثوقة.",
            "en": "Shave or trim your hair, then offer the sacrifice if performing Hajj Tamattu or Qiran. You can delegate the sacrifice to a trusted authority."
          },
          "tips": {
            "ar": "تأكد من اختيار ذبيحة صحية وسليمة تتوافق مع الشروط الشرعية.",
            "en": "Ensure the sacrificial animal is healthy and meets Islamic requirements."
          }
        },
        {
          "title": {
            "ar": "طواف الإفاضة",
            "en": "Tawaf al-Ifadah"
          },
          "description": {
            "ar": "طف حول الكعبة سبعة أشواط كما في طواف القدوم، ثم صل ركعتين خلف مقام إبراهيم. هذا الطواف ركن أساسي في الحج.",
            "en": "Perform seven circuits around the Kaaba as in the arrival tawaf, then pray two rak’ahs behind Maqam Ibrahim. This tawaf is an essential pillar of Hajj."
          },
          "tips": {
            "ar": "حاول أداء الطواف في وقت أقل زحاماً لتجنب الإجهاد.",
            "en": "Try performing tawaf during less crowded times to avoid exhaustion."
          }
        }
      ],
      "additional_info": {
        "ar": "الحج فرض مرة واحدة في العمر لمن استطاع إليه سبيلاً. العمرة مستحبة ويمكن أداؤها في أي وقت. تعلم الأدعية المأثورة للحج والعمرة لزيادة الأجر.",
        "en": "Hajj is obligatory once in a lifetime for those who are able. Umrah is recommended and can be performed anytime. Learn the Prophetic supplications for Hajj and Umrah for greater reward."
      },
      "common_mistakes": {
        "ar": "عدم الالتزام بالميقات، إهمال التلبية، أو ارتكاب محظورات الإحرام مثل استخدام العطور.",
        "en": "Not adhering to the miqat, neglecting Talbiyah, or committing ihram prohibitions like using perfumes."
      }
    },
    {
      "id": "funeral-prayer",
      "title": {
        "ar": "صلاة الجنازة",
        "en": "Funeral Prayer (Salat al-Janazah)"
      },
      "category": {
        "ar": "الصلاة",
        "en": "Prayer"
      },
      "description": {
        "ar": "دليل مفصل لأداء صلاة الجنازة للدعاء للميت، مع توضيح الأحكام والآداب",
        "en": "Detailed guide for performing the funeral prayer to supplicate for the deceased, including rulings and etiquette"
      },
      "icon": "fas fa-hands-praying",
      "steps": [
        {
          "title": {
            "ar": "الوقوف والنية",
            "en": "Standing and Intention"
          },
          "description": {
            "ar": "قف خلف الإمام في صفوف مستقيمة، واعقد النية في قلبك لأداء صلاة الجنازة على الميت (حدد اسمه إن أمكن).",
            "en": "Stand behind the imam in straight rows and make the intention in your heart to perform the funeral prayer for the deceased (specify their name if possible)."
          },
          "tips": {
            "ar": "حاول الوقوف في الصف الأول لزيادة الأجر.",
            "en": "Try to stand in the first row for greater reward."
          }
        },
        {
          "title": {
            "ar": "التكبيرة الأولى",
            "en": "First Takbir"
          },
          "description": {
            "ar": "ارفع يديك مع الإمام عند التكبيرة الأولى وقل 'الله أكبر'، ثم اقرأ سورة الفاتحة سراً بترتيل.",
            "en": "Raise your hands with the imam at the first Takbir and say 'Allahu Akbar,' then recite Surah Al-Fatiha silently with reflection."
          },
          "tips": {
            "ar": "ركز في القراءة وتجنب التشتت أثناء الصلاة.",
            "en": "Focus on the recitation and avoid distractions during the prayer."
          }
        },
        {
          "title": {
            "ar": "التكبيرة الثانية",
            "en": "Second Takbir"
          },
          "description": {
            "ar": "قل 'الله أكبر' مع الإمام، ثم اقرأ الصلاة على النبي صلى الله عليه وسلم: 'اللهم صل على محمد وعلى آل محمد...' سراً.",
            "en": "Say 'Allahu Akbar' with the imam, then recite the prayers upon the Prophet (PBUH): 'Allahumma salli ‘ala Muhammad wa ‘ala ali Muhammad...' silently."
          },
          "tips": {
            "ar": "استخدم صيغة الصلاة الإبراهيمية كما في التشهد.",
            "en": "Use the Ibrahimi prayer formula as in tashahhud."
          }
        },
        {
          "title": {
            "ar": "التكبيرة الثالثة",
            "en": "Third Takbir"
          },
          "description": {
            "ar": "قل 'الله أكبر'، ثم ادع للميت بالمغفرة والرحمة، مثل: 'اللهم اغفر له وارحمه وعافه واعف عنه...'",
            "en": "Say 'Allahu Akbar,' then supplicate for the deceased for forgiveness and mercy, e.g., 'Allahumma ighfir lahu warhamhu wa ‘afihi wa’fu ‘anhu...'"
          },
          "tips": {
            "ar": "أضف أدعية أخرى من السنة لزيادة الأجر.",
            "en": "Add other Prophetic supplications for extra reward."
          }
        },
        {
          "title": {
            "ar": "التكبيرة الرابعة والسلام",
            "en": "Fourth Takbir and Salam"
          },
          "description": {
            "ar": "قل 'الله أكبر' للتكبيرة الرابعة، ثم سلم يميناً ويساراً قائلاً: 'السلام عليكم ورحمة الله' مع الإمام.",
            "en": "Say 'Allahu Akbar' for the fourth Takbir, then give salam to the right and left, saying 'Assalamu alaikum wa rahmatullah' with the imam."
          },
          "tips": {
            "ar": "حافظ على الصمت والوقار بعد الصلاة احتراماً للميت.",
            "en": "Maintain silence and dignity after the prayer out of respect for the deceased."
          }
        }
      ],
      "additional_info": {
        "ar": "صلاة الجنازة فرض كفاية، ويستحب أن يصلي عليها أكبر عدد ممكن. يمكن أداؤها في المسجد أو في مكان الدفن.",
        "en": "The funeral prayer is a communal obligation, and it’s recommended for as many people as possible to perform it. It can be performed in a mosque or at the burial site."
      },
      "common_mistakes": {
        "ar": "التسرع في التكبيرات أو إهمال قراءة الفاتحة أو الدعاء للميت.",
        "en": "Rushing through Takbirs or neglecting to recite Al-Fatiha or supplicate for the deceased."
      }
    },
    {
      "id": "zakat",
      "title": {
        "ar": "كيفية أداء الزكاة",
        "en": "How to Perform Zakat"
      },
      "category": {
        "ar": "العبادات المالية",
        "en": "Financial Worship"
      },
      "description": {
        "ar": "دليل شامل لحساب وإخراج الزكاة بالطريقة الصحيحة وفق الأحكام الشرعية، مع نصائح عملية",
        "en": "Comprehensive guide for calculating and paying Zakat correctly according to Islamic rulings, with practical tips"
      },
      "icon": "fas fa-hand-holding-usd",
      "steps": [
        {
          "title": {
            "ar": "معرفة الأموال الزكوية",
            "en": "Identifying Zakatable Wealth"
          },
          "description": {
            "ar": "حدد الأموال التي تجب فيها الزكاة: الذهب والفضة (بما في ذلك المجوهرات المستخدمة)، النقود السائلة، الأسهم، الودائع البنكية، البضائع التجارية، الزروع والثمار، والأنعام (الإبل، البقر، الغنم).",
            "en": "Identify wealth subject to Zakat: gold and silver (including used jewelry), cash, stocks, bank deposits, trade goods, crops, fruits, and livestock (camels, cows, sheep)."
          },
          "tips": {
            "ar": "استشر عالم دين إذا كنت غير متأكد من الأصول التي تجب فيها الزكاة.",
            "en": "Consult a scholar if unsure about assets subject to Zakat."
          }
        },
        {
          "title": {
            "ar": "حساب النصاب",
            "en": "Calculating Nisab"
          },
          "description": {
            "ar": "تأكد من أن ثروتك تبلغ النصاب (الحد الأدنى)، وهو ما يعادل 85 جراماً من الذهب عيار 24 أو 595 جراماً من الفضة. احسب قيمة أصولك بناءً على سعر السوق الحالي.",
            "en": "Ensure your wealth reaches the nisab (minimum threshold), equivalent to 85 grams of 24-karat gold or 595 grams of silver. Calculate your assets based on current market prices."
          },
          "tips": {
            "ar": "استخدم تطبيقات أو مواقع موثوقة لمعرفة أسعار الذهب والفضة يومياً.",
            "en": "Use reliable apps or websites to check daily gold and silver prices."
          }
        },
        {
          "title": {
            "ar": "مرور الحول",
            "en": "Completion of Lunar Year"
          },
          "description": {
            "ar": "تأكد من مرور سنة هجرية كاملة (355 يوماً) على امتلاك المال دون نقصان عن النصاب. إذا انخفض المال عن النصاب خلال العام، يبدأ الحول من جديد.",
            "en": "Ensure a full lunar year (355 days) has passed since owning the wealth without it falling below the nisab. If it drops below, the lunar year restarts."
          },
          "tips": {
            "ar": "سجل تاريخ بداية الحول لتسهيل الحساب كل عام.",
            "en": "Record the start date of the lunar year to simplify annual calculations."
          }
        },
        {
          "title": {
            "ar": "حساب المقدار",
            "en": "Calculating the Amount"
          },
          "description": {
            "ar": "احسب 2.5% (ربع العشر) من إجمالي المال الزكوي. على سبيل المثال، إذا كان لديك 100,000 ريال، فالزكاة 2,500 ريال. احسب زكاة كل نوع من الأصول بشكل منفصل إذا لزم الأمر.",
            "en": "Calculate 2.5% (a quarter of a tenth) of the total zakatable wealth. For example, if you have 100,000 Riyal, the Zakat is 2,500 Riyal. Calculate Zakat for each asset type separately if needed."
          },
          "tips": {
            "ar": "استخدم آلة حاسبة أو برنامجاً لتسهيل الحسابات الكبيرة.",
            "en": "Use a calculator or software to simplify large calculations."
          }
        },
        {
          "title": {
            "ar": "إخراج الزكاة",
            "en": "Paying Zakat"
          },
          "description": {
            "ar": "أخرج الزكاة للمستحقين الثمانية المذكورين في القرآن: الفقراء، المساكين، العاملين عليها، المؤلفة قلوبهم، في الرقاب، الغارمين، في سبيل الله، وابن السبيل. يمكن دفعها مباشرة أو عبر مؤسسات موثوقة.",
            "en": "Pay Zakat to the eight categories mentioned in the Quran: the poor, the needy, those employed to collect it, those whose hearts are to be reconciled, for freeing slaves, those in debt, in the way of Allah, and wayfarers. Pay directly or through trusted organizations."
          },
          "tips": {
            "ar": "تحقق من أهلية المستحقين قبل دفع الزكاة لضمان وصولها لمن يستحقها.",
            "en": "Verify the eligibility of recipients to ensure Zakat reaches those who deserve it."
          }
        }
      ],
      "additional_info": {
        "ar": "الزكاة فرض عين على كل مسلم يملك النصاب. يستحب إخراج الزكاة في رمضان لزيادة الأجر. لا تجب الزكاة على الأموال الشخصية مثل المنزل أو السيارة إذا لم تكن للتجارة.",
        "en": "Zakat is obligatory for every Muslim who owns the nisab. It’s recommended to pay Zakat in Ramadan for greater reward. Zakat is not due on personal assets like a home or car unless intended for trade."
      },
      "common_mistakes": {
        "ar": "عدم حساب النصاب بدقة، إهمال بعض الأصول الزكوية، أو دفع الزكاة لغير المستحقين.",
        "en": "Inaccurate nisab calculation, neglecting some zakatable assets, or paying Zakat to ineligible recipients."
      }
    },
    {
      "id": "sawm",
      "title": {
        "ar": "كيفية أداء الصوم",
        "en": "How to Perform Sawm (Fasting)"
      },
      "category": {
        "ar": "العبادات",
        "en": "Worship"
      },
      "description": {
        "ar": "دليل شامل لأداء الصيام الواجب والمستحب وفق السنة النبوية، مع نصائح لتسهيل الصيام",
        "en": "Comprehensive guide for performing obligatory and voluntary fasting according to the Prophetic tradition, with tips to ease fasting"
      },
      "icon": "fas fa-moon",
      "steps": [
        {
          "title": {
            "ar": "النية قبل الفجر",
            "en": "Intention Before Dawn"
          },
          "description": {
            "ar": "اعقد النية في قلبك لصيام اليوم التالي قبل طلوع الفجر. يمكن أن تكون النية عامة لصيام رمضان أو محددة لكل يوم. لا حاجة لنطق النية.",
            "en": "Make the intention in your heart to fast the next day before dawn. The intention can be general for Ramadan or specific for each day. No need to verbalize it."
          },
          "tips": {
            "ar": "جدد النية يومياً في رمضان لضمان الإخلاص.",
            "en": "Renew the intention daily in Ramadan to ensure sincerity."
          }
        },
        {
          "title": {
            "ar": "السحور",
            "en": "Pre-Dawn Meal (Suhur)"
          },
          "description": {
            "ar": "تناول وجبة السحور قبل الفجر، ويفضل تأخيرها إلى ما قبل الفجر مباشرة. تناول أطعمة مغذية مثل التمر والماء والحبوب الكاملة.",
            "en": "Eat the suhur meal before dawn, preferably delaying it until just before Fajr. Consume nutritious foods like dates, water, and whole grains."
          },
          "tips": {
            "ar": "تجنب الأطعمة المالحة أو المسببة للعطش أثناء السحور.",
            "en": "Avoid salty or thirst-inducing foods during suhur."
          }
        },
        {
          "title": {
            "ar": "الإمساك عند الفجر",
            "en": "Abstaining from Dawn"
          },
          "description": {
            "ar": "امتنع عن الأكل والشرب والجماع من طلوع الفجر (بداية وقت صلاة الفجر) حتى غروب الشمس. تأكد من معرفة مواقيت الصلاة بدقة.",
            "en": "Abstain from eating, drinking, and marital relations from dawn (start of Fajr prayer time) until sunset. Ensure you know the exact prayer times."
          },
          "tips": {
            "ar": "استخدم تطبيق مواقيت الصلاة لمعرفة وقت الفجر بدقة.",
            "en": "Use a prayer time app to know the exact Fajr time."
          }
        },
        {
          "title": {
            "ar": "الإفطار عند المغرب",
            "en": "Breaking Fast at Sunset"
          },
          "description": {
            "ar": "أفطر فور غروب الشمس بتمر أو ماء، ثم اقرأ الدعاء: 'ذهب الظمأ وابتلت العروق وثبت الأجر إن شاء الله'. صلِ المغرب قبل تناول الوجبة الكاملة.",
            "en": "Break your fast at sunset with dates or water, then recite the dua: 'Dhahaba adh-dhama’ wabtallat al-‘urooq wa thabata al-ajr insha’Allah.' Pray Maghrib before eating a full meal."
          },
          "tips": {
            "ar": "تجنب الإفراط في الأكل عند الإفطار لتجنب الإجهاد الهضمي.",
            "en": "Avoid overeating at iftar to prevent digestive strain."
          }
        },
        {
          "title": {
            "ar": "تجنب المفطرات",
            "en": "Avoiding Invalidators"
          },
          "description": {
            "ar": "تجنب ما يبطل الصيام: الأكل والشرب المتعمد، الجماع، القيء المتعمد، الحيض، والنفاس. كما يجب تجنب الغيبة والنميمة للحفاظ على روح الصيام.",
            "en": "Avoid what breaks the fast: intentional eating or drinking, marital relations, intentional vomiting, menstruation, and postpartum bleeding. Also avoid backbiting and gossip to preserve the spirit of fasting."
          },
          "tips": {
            "ar": "إذا أكلت أو شربت ناسياً، فاستمر في صيامك فإنه لا يبطل.",
            "en": "If you eat or drink forgetfully, continue fasting as it does not break."
          }
        }
      ],
      "additional_info": {
        "ar": "الصيام في رمضان فرض، ويستحب صيام الإثنين والخميس، ستة أيام من شوال، وعاشوراء. حافظ على قراءة القرآن والذكر أثناء الصيام.",
        "en": "Fasting in Ramadan is obligatory, while fasting on Mondays, Thursdays, six days of Shawwal, and Ashura is recommended. Maintain Quran recitation and remembrance during fasting."
      },
      "common_mistakes": {
        "ar": "نسيان النية، الإفطار قبل التأكد من الغروب، أو ارتكاب الذنوب التي تنقص أجر الصيام.",
        "en": "Forgetting the intention, breaking the fast before confirming sunset, or committing sins that diminish the reward of fasting."
      }
    },
    {
      "id": "istikhara",
      "title": {
        "ar": "كيفية أداء صلاة الاستخارة",
        "en": "How to Perform Istikhara Prayer"
      },
      "category": {
        "ar": "الصلاة",
        "en": "Prayer"
      },
      "description": {
        "ar": "دليل مفصل لأداء صلاة الاستخارة لطلب الخيرة من الله في الأمور المهمة",
        "en": "Detailed guide for performing Istikhara prayer to seek Allah’s guidance in important matters"
      },
      "icon": "fas fa-compass",
      "steps": [
        {
          "title": {
            "ar": "الوضوء والنية",
            "en": "Ablution and Intention"
          },
          "description": {
            "ar": "توضأ وضوءاً صحيحاً، ثم اعقد النية في قلبك لأداء صلاة الاستخارة بشأن الأمر الذي تريد الخيرة فيه (مثل زواج أو عمل).",
            "en": "Perform valid wudu, then make the intention in your heart for Istikhara prayer regarding the matter you seek guidance for (e.g., marriage or a job)."
          },
          "tips": {
            "ar": "تأكد من الطهارة الكاملة قبل الصلاة لضمان قبولها.",
            "en": "Ensure complete purification before prayer to ensure acceptance."
          }
        },
        {
          "title": {
            "ar": "صلاة ركعتين",
            "en": "Praying Two Rak’ahs"
          },
          "description": {
            "ar": "صل ركعتين غير فريضة، واقرأ سورة الفاتحة ثم سورة الكافرون في الركعة الأولى، وسورة الإخلاص في الركعة الثانية بعد الفاتحة. أدِ الصلاة بخشوع.",
            "en": "Pray two non-obligatory rak’ahs, reciting Surah Al-Fatiha followed by Surah Al-Kafirun in the first rak’ah and Surah Al-Ikhlas in the second after Al-Fatiha. Perform the prayer with reverence."
          },
          "tips": {
            "ar": "يمكن قراءة أي سور أخرى إذا لم تكن قادراً على حفظ الكافرون أو الإخلاص.",
            "en": "You can recite other surahs if unable to memorize Al-Kafirun or Al-Ikhlas."
          }
        },
        {
          "title": {
            "ar": "دعاء الاستخارة",
            "en": "Istikhara Supplication"
          },
          "description": {
            "ar": "بعد السلام، اقرأ دعاء الاستخارة: 'اللهم إني أستخيرك بعلمك وأستقدرك بقدرتك وأسألك من فضلك العظيم...'، وحدد الأمر الذي تستخير فيه.",
            "en": "After salam, recite the Istikhara supplication: 'Allahumma inni astakhiruka bi ‘ilmika wa astaqdiruka bi qudratika wa as’aluka min fadlika al-‘azeem...' and specify the matter you’re seeking guidance for."
          },
          "tips": {
            "ar": "احفظ الدعاء أو اقرأه من ورقة لضمان النطق الصحيح.",
            "en": "Memorize the dua or read it from a paper to ensure correct pronunciation."
          }
        },
        {
          "title": {
            "ar": "انتظار الإشارة",
            "en": "Waiting for Guidance"
          },
          "description": {
            "ar": "انتظر إشارة الله، التي قد تأتي عبر انشراح الصدر لأمر معين، أو رؤيا في المنام، أو تسهيل الظروف. كرر الاستخارة إذا لم تتضح الإشارة.",
            "en": "Wait for Allah’s guidance, which may come through a feeling of ease toward a decision, a dream, or facilitated circumstances. Repeat Istikhara if the guidance is unclear."
          },
          "tips": {
            "ar": "لا تعتمد فقط على الأحلام، بل انتبه للظروف والشعور الداخلي.",
            "en": "Don’t rely solely on dreams; pay attention to circumstances and inner feelings."
          }
        }
      ],
      "additional_info": {
        "ar": "صلاة الاستخارة تُصلى في أي وقت، ويستحب أداؤها عند الحيرة في أمر دنيوي أو ديني. لا تستخدم لأمور محرمة أو واجبة.",
        "en": "Istikhara prayer can be performed at any time and is recommended when confused about a worldly or religious matter. Don’t use it for prohibited or obligatory matters."
      },
      "common_mistakes": {
        "ar": "توقع إجابة فورية، أو إهمال الدعاء، أو عدم التوكل على الله بعد الصلاة.",
        "en": "Expecting an immediate answer, neglecting the dua, or failing to rely on Allah after the prayer."
      }
    },
    {
     "id": "tashahhud",
      "title": {
        "ar": "كيفية أداء التشهد",
        "en": "How to Perform Tashahhud"
      },
      "category": {
        "ar": "الصلاة",
        "en": "Prayer"
      },
      "description": {
        "ar": "دليل مفصل لأداء التشهد في الصلاة بالطريقة الصحيحة وفق السنة النبوية، مع توضيح الآداب والأخطاء الشائعة",
        "en": "Detailed guide for performing Tashahhud in prayer correctly according to the Prophetic tradition, including etiquette and common mistakes"
      },
      "icon": "fas fa-hand-point-up",
      "steps": [
        {
          "title": {
            "ar": "الجلوس للتشهد",
            "en": "Sitting for Tashahhud"
          },
          "description": {
            "ar": "اجلس على قدمك اليسرى مع نصب القدم اليمنى وتوجيه أصابعها نحو القبلة. ضع يدك اليمنى على فخذك الأيمن واليسرى على الفخذ الأيسر، مع إرخاء الأصابع.",
            "en": "Sit on your left foot with the right foot upright and toes pointing toward the Qibla. Place your right hand on your right thigh and left hand on your left thigh, with fingers relaxed."
          },
          "tips": {
            "ar": "حافظ على استقامة الظهر وانظر إلى موضع سجودك لزيادة الخشوع.",
            "en": "Keep your back straight and look at the place of prostration to enhance reverence."
          }
        },
        {
          "title": {
            "ar": "التشهد الأول",
            "en": "First Tashahhud"
          },
          "description": {
            "ar": "اقرأ التشهد الأول سراً: 'التحيات لله والصلوات والطيبات، السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين، أشهد أن لا إله إلا الله وأشهد أن محمداً عبده ورسوله'.",
            "en": "Recite the first Tashahhud silently: 'At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu ‘alayka ayyuhan-nabiyyu wa rahmatullahi wa barakatuh, as-salamu ‘alayna wa ‘ala ‘ibadillahi as-saliheen, ash-hadu an la ilaha illa Allah wa ash-hadu anna Muhammadan ‘abduhu wa rasooluh.'"
          },
          "tips": {
            "ar": "تأكد من النطق الصحيح للتشهد، ويمكنك حفظه تدريجياً إذا كنت مبتدئاً.",
            "en": "Ensure correct pronunciation of the Tashahhud, and memorize it gradually if you’re a beginner."
          }
        },
        {
          "title": {
            "ar": "الإشارة بالسبابة",
            "en": "Pointing with the Index Finger"
          },
          "description": {
            "ar": "ارفع السبابة اليمنى عند قول 'إلا الله' في التشهد، وحركها برفق أثناء الدعاء. أبقِ بقية الأصابع مطوية نحو راحة اليد.",
            "en": "Raise the right index finger when saying 'illa Allah' in the Tashahhud, moving it gently during supplication. Keep the other fingers folded toward the palm."
          },
          "tips": {
            "ar": "تجنب تحريك السبابة بعنف أو إبقائها مرفوعة طوال التشهد.",
            "en": "Avoid moving the index finger vigorously or keeping it raised throughout the Tashahhud."
          }
        },
        {
          "title": {
            "ar": "الصلاة الإبراهيمية",
            "en": "Ibrahimi Prayer"
          },
          "description": {
            "ar": "في التشهد الأخير، اقرأ الصلاة الإبراهيمية بعد التشهد: 'اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم، وبارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم في العالمين إنك حميد مجيد'.",
            "en": "In the final Tashahhud, recite the Ibrahimi prayer after the Tashahhud: 'Allahumma salli ‘ala Muhammad wa ‘ala ali Muhammad kama sallayta ‘ala Ibrahim wa ‘ala ali Ibrahim, wa barik ‘ala Muhammad wa ‘ala ali Muhammad kama barakta ‘ala Ibrahim wa ‘ala ali Ibrahim fil-‘alameen innaka hameedun majeed.'"
          },
          "tips": {
            "ar": "أضف أدعية أخرى قبل السلام إذا أردت، مثل الدعاء بالمغفرة.",
            "en": "Add other supplications before the salam if desired, such as asking for forgiveness."
          }
        }
      ],
      "additional_info": {
        "ar": "التشهد ركن أساسي في الصلاة، ويؤدى في الركعة الثانية للصلوات ذات الركعتين، وفي الركعة الثانية والأخيرة للصلوات ذات الثلاث أو الأربع ركعات. حافظ على الترتيب والخشوع.",
        "en": "Tashahhud is an essential pillar of prayer, performed in the second rak’ah for two-rak’ah prayers, and in the second and final rak’ahs for three- or four-rak’ah prayers. Maintain sequence and reverence."
      },
      "common_mistakes": {
        "ar": "التسرع في قراءة التشهد، أو إهمال الإشارة بالسبابة، أو نطق الكلمات بشكل غير صحيح.",
        "en": "Rushing through the Tashahhud, neglecting to point with the index finger, or mispronouncing the words."
      }
    },
    {
     "id": "duha",
      "title": {
        "ar": "كيفية أداء صلاة الضحى",
        "en": "How to Perform Duha Prayer"
      },
      "category": {
        "ar": "الصلاة",
        "en": "Prayer"
      },
      "description": {
        "ar": "دليل مفصل لأداء صلاة الضحى المستحبة، مع توضيح وقتها وفضلها وفق السنة النبوية، بالإضافة إلى نصائح لتحقيق الخشوع وزيادة الأجر",
        "en": "Detailed guide for performing the recommended Duha prayer, including its timing and virtues according to the Prophetic tradition, with tips to enhance reverence and increase reward"
      },
      "icon": "fas fa-sun",
      "steps": [
        {
          "title": {
            "ar": "الوقت المناسب",
            "en": "Appropriate Time"
          },
          "description": {
            "ar": "صل صلاة الضحى بعد ارتفاع الشمس بحوالي 15-20 دقيقة (بعد شروق الشمس) وحتى قبل أذان الظهر بقليل. أفضل وقت هو عندما ترتفع الشمس وتصبح الحرارة شديدة، كما ورد في الحديث أنها صلاة الأوابين.",
            "en": "Pray Duha after the sun rises about 15-20 minutes and before the Dhuhr adhan. The best time is when the sun is higher and it becomes warmer, as it is known as the prayer of the oft-repentant, per the Hadith."
          },
          "tips": {
            "ar": "استخدم تطبيق مواقيت الصلاة لتحديد وقت الضحى بدقة، وحاول تخصيص وقت يومي ثابت لتجعلها عادة.",
            "en": "Use a prayer time app to accurately determine Duha time, and try to set a fixed daily time to make it a habit."
          }
        },
        {
          "title": {
            "ar": "عدد الركعات",
            "en": "Number of Rak’ahs"
          },
          "description": {
            "ar": "صل ركعتين كحد أدنى، ويمكنك زيادة العدد إلى 4، 6، أو 8 ركعات حسب وقتك وقدرتك. يستحب أداء الركعات مثنى مثنى (ركعتين ثم السلام).",
            "en": "Pray a minimum of two rak’ahs, and you can increase to 4, 6, or 8 rak’ahs depending on your time and ability. It is recommended to perform them in sets of two rak’ahs followed by salam."
          },
          "tips": {
            "ar": "ابدأ بركعتين إذا كنت مبتدئاً، ثم زِد العدد تدريجياً مع الاعتياد.",
            "en": "Start with two rak’ahs if you’re a beginner, then gradually increase as you become accustomed."
          }
        },
        {
          "title": {
            "ar": "النية والإحرام",
            "en": "Intention and Ihram"
          },
          "description": {
            "ar": "اعقد النية في قلبك لأداء صلاة الضحى، ثم كبر تكبيرة الإحرام قائلاً 'الله أكبر'، وابدأ الصلاة كما تؤدي أي صلاة نافلة. تأكد من الخشوع والتركيز.",
            "en": "Make the intention in your heart to perform Duha prayer, then say 'Allahu Akbar' for the opening Takbir to begin the prayer like any voluntary prayer. Ensure reverence and focus."
          },
          "tips": {
            "ar": "حافظ على النية الخالصة لله تعالى، وتجنب التشتت أثناء الصلاة.",
            "en": "Keep the intention sincere for Allah’s sake, and avoid distractions during prayer."
          }
        },
        {
          "title": {
            "ar": "الدعاء بعد الصلاة",
            "en": "Supplication After Prayer"
          },
          "description": {
            "ar": "بعد السلام، ادع الله بما تشاء، فالدعاء بعد صلاة الضحى مستجاب بإذن الله. يمكنك الدعاء بالرزق، المغفرة، أو تحقيق أمنياتك الدنيوية والأخروية.",
            "en": "After salam, supplicate to Allah as you wish, as dua after Duha prayer is answered by Allah’s permission. You can pray for sustenance, forgiveness, or worldly and hereafter aspirations."
          },
          "tips": {
            "ar": "جهز قائمة بالأدعية التي تريد التركيز عليها بعد الصلاة.",
            "en": "Prepare a list of supplications to focus on after the prayer."
          }
        }
      ],
      "additional_info": {
        "ar": "صلاة الضحى سنة مؤكدة، وفيها أجر عظيم كما ورد في الحديث أنها تعادل صدقة عن كل مفصل في الجسم. يمكن أداؤها يومياً أو عند القدرة.",
        "en": "Duha prayer is a highly recommended Sunnah, with great reward, as it is equivalent to giving charity for every joint in the body, per the Hadith. It can be performed daily or as able."
      },
      "common_mistakes": {
        "ar": "إهمال الصلاة بسبب الانشغال، أو التسرع في أدائها، أو عدم مراعاة الوقت المناسب.",
        "en": "Neglecting the prayer due to busyness, rushing through it, or not observing the appropriate time."
      }
    },
    {
      "id": "qiyam",
      "title": {
        "ar": "كيفية أداء قيام الليل",
        "en": "How to Perform Qiyam al-Layl"
      },
      "category": {
        "ar": "الصلاة",
        "en": "Prayer"
      },
      "description": {
        "ar": "دليل مفصل لأداء قيام الليل والتهجد، مع توضيح فضله وكيفية تحقيق الخشوع فيه",
        "en": "Detailed guide for performing night prayer and Tahajjud, including its virtues and ways to achieve reverence"
      },
      "icon": "fas fa-star-and-crescent",
      "steps": [
        {
          "title": {
            "ar": "الوقت المناسب",
            "en": "Appropriate Time"
          },
          "description": {
            "ar": "قم في الثلث الأخير من الليل (بعد منتصف الليل وحتى الفجر)، حيث يكون الدعاء مستجاباً بإذن الله. يمكن أداء القيام في أي وقت بعد صلاة العشاء.",
            "en": "Wake up in the last third of the night (after midnight until dawn), when supplications are most likely to be answered by Allah’s permission. Qiyam can be performed anytime after Isha prayer."
          },
          "tips": {
            "ar": "اضبط منبهاً للاستيقاظ في الثلث الأخير، ونم مبكراً لتسهيل القيام.",
            "en": "Set an alarm for the last third of the night, and sleep early to facilitate waking up."
          }
        },
        {
          "title": {
            "ar": "البدء بركعتين خفيفتين",
            "en": "Starting with Two Light Rak’ahs"
          },
          "description": {
            "ar": "ابدأ بركعتين خفيفتين لتنشيط النفس، مع قراءة سور قصيرة مثل الفاتحة والإخلاص أو الكافرون بعد الفاتحة في كل ركعة.",
            "en": "Begin with two light rak’ahs to energize yourself, reciting short surahs like Al-Fatiha and Al-Ikhlas or Al-Kafirun after Al-Fatiha in each rak’ah."
          },
          "tips": {
            "ar": "ركز على الخشوع حتى في الركعات الخفيفة لتهيئة قلبك للصلاة.",
            "en": "Focus on reverence even in the light rak’ahs to prepare your heart for prayer."
          }
        },
        {
          "title": {
            "ar": "إطالة القراءة",
            "en": "Lengthening Recitation"
          },
          "description": {
            "ar": "أطل في قراءة القرآن، القيام، الركوع، والسجود بما يناسب حالتك البدنية والروحية. اقرأ سوراً أو آيات تحبها، وتدبر معانيها.",
            "en": "Lengthen the recitation of the Quran, standing, bowing, and prostration according to your physical and spiritual capacity. Recite surahs or verses you love, reflecting on their meanings."
          },
          "tips": {
            "ar": "اختر آيات تثير فيك الخشوع، مثل آيات الرحمة أو الجنة.",
            "en": "Choose verses that inspire reverence, such as those about mercy or paradise."
          }
        },
        {
          "title": {
            "ar": "الختام بالوتر",
            "en": "Ending with Witr"
          },
          "description": {
            "ar": "اختتم قيام الليل بصلاة الوتر، وهي ركعة واحدة أو ثلاث أو خمس ركعات. اقرأ في الركعة الأخيرة الفاتحة ثم سورة الإخلاص والفلق والناس، ثم ادع بدعاء القنوت.",
            "en": "End the night prayer with Witr prayer, which can be one, three, or five rak’ahs. In the final rak’ah, recite Al-Fatiha followed by Surah Al-Ikhlas, Al-Falaq, and An-Nas, then make the Qunoot supplication."
          },
          "tips": {
            "ar": "إذا لم تحفظ دعاء القنوت، يمكنك الدعاء بأي دعاء آخر من القلب.",
            "en": "If you haven’t memorized the Qunoot supplication, you can supplicate with any heartfelt dua."
          }
        }
      ],
      "additional_info": {
        "ar": "قيام الليل من أفضل العبادات، وهو سنة مؤكدة كان النبي صلى الله عليه وسلم يحافظ عليه. يستحب الإكثار من الدعاء والاستغفار خلالها.",
        "en": "Qiyam al-Layl is one of the best acts of worship and a confirmed Sunnah that the Prophet (PBUH) consistently performed. It’s recommended to increase supplications and seeking forgiveness during it."
      },
      "common_mistakes": {
        "ar": "عدم الاستمرار بسبب النوم أو الإرهاق، التسرع في الصلاة، أو إهمال الوتر في النهاية.",
        "en": "Not continuing due to sleep or fatigue, rushing through the prayer, or neglecting Witr at the end."
      }
    },
    {
      "id": "takbir-tashriq",
      "title": {
        "ar": "كيفية أداء تكبير التشريق",
        "en": "How to Perform Takbir al-Tashriq"
      },
      "category": {
        "ar": "الأذكار",
        "en": "Remembrance"
      },
      "description": {
        "ar": "دليل مفصل لأداء تكبير التشريق خلال أيام عيد الأضحى وأيام التشريق، مع توضيح الأحكام والفضل",
        "en": "Detailed guide for performing Takbir al-Tashriq during Eid al-Adha and the days of Tashriq, including rulings and virtues"
      },
      "icon": "fas fa-volume-up",
      "steps": [
        {
          "title": {
            "ar": "الوقت المحدد",
            "en": "Specific Time"
          },
          "description": {
            "ar": "يبدأ تكبير التشريق من فجر يوم عرفة (9 ذو الحجة) ويستمر حتى عصر آخر أيام التشريق (13 ذو الحجة). وهو واجب على كل مسلم بعد الصلوات الفريضة.",
            "en": "Takbir al-Tashriq begins from Fajr on the Day of Arafat (9th Dhul Hijjah) and continues until Asr on the last day of Tashriq (13th Dhul Hijjah). It is obligatory for every Muslim after obligatory prayers."
          },
          "tips": {
            "ar": "تذكر مواعيد التكبير باستخدام تقويم هجري أو تطبيق ديني.",
            "en": "Keep track of Takbir times using a Hijri calendar or religious app."
          }
        },
        {
          "title": {
            "ar": "التكبير بعد الصلاة",
            "en": "Takbir After Prayer"
          },
          "description": {
            "ar": "كبر بعد كل صلاة فريضة مباشرة، سواء كنت تصلي منفرداً أو في جماعة، سواء كنت مقيماً أو مسافراً.",
            "en": "Make Takbir immediately after each obligatory prayer, whether praying alone or in congregation, whether resident or traveling."
          },
          "tips": {
            "ar": "قل التكبير قبل الخروج من المسجد إذا كنت تصلي في جماعة.",
            "en": "Say the Takbir before leaving the mosque if praying in congregation."
          }
        },
        {
          "title": {
            "ar": "صيغة التكبير",
            "en": "Takbir Formula"
          },
          "description": {
            "ar": "قل: 'الله أكبر الله أكبر لا إله إلا الله، والله أكبر الله أكبر ولله الحمد' مرة واحدة على الأقل بعد كل صلاة. يمكن تكرارها ثلاث مرات لزيادة الأجر.",
            "en": "Say: 'Allahu akbar Allahu akbar la ilaha illa Allah, wa Allahu akbar Allahu akbar wa lillahi’l-hamd' at least once after each prayer. You can repeat it three times for extra reward."
          },
          "tips": {
            "ar": "احفظ الصيغة جيداً لتجنب الأخطاء في النطق.",
            "en": "Memorize the formula well to avoid pronunciation mistakes."
          }
        },
        {
          "title": {
            "ar": "الجهر بالتكبير",
            "en": "Audible Takbir"
          },
          "description": {
            "ar": "اجهر بالتكبير بصوت مسموع، خاصة للرجال في المساجد والأماكن العامة. للنساء، يستحب التكبير بصوت منخفض إذا كن في مكان عام.",
            "en": "Make the Takbir audibly, especially for men in mosques and public places. For women, it’s recommended to say it softly in public settings."
          },
          "tips": {
            "ar": "إذا كنت في مكان هادئ، تأكد من أن التكبير لا يزعج الآخرين.",
            "en": "In quiet places, ensure the Takbir doesn’t disturb others."
          }
        }
      ],
      "additional_info": {
        "ar": "تكبير التشريق سنة مؤكدة، وهو وسيلة لإحياء شعيرة الحج وذكر الله. يستحب التكبير في الأسواق والطرقات خلال هذه الأيام.",
        "en": "Takbir al-Tashriq is a confirmed Sunnah and a way to revive the rite of Hajj and remembrance of Allah. It’s recommended to say it in markets and streets during these days."
      },
      "common_mistakes": {
        "ar": "إهمال التكبير بعد بعض الصلوات، أو قوله قبل الصلاة بدلاً من بعدها، أو نسيان الصيغة الصحيحة.",
        "en": "Neglecting Takbir after some prayers, saying it before instead of after prayer, or forgetting the correct formula."
      }
    },
    {
      "id": "tawbah",
      "title": {
        "ar": "كيفية التوبة النصوح",
        "en": "How to Make Tawbah (Repentance)"
      },
      "category": {
        "ar": "الأخلاق والسلوك",
        "en": "Ethics & Conduct"
      },
      "description": {
        "ar": "دليل مفصل للتوبة النصوح من الذنوب والمعاصي وفق السنة النبوية، مع نصائح للحفاظ على التوبة",
        "en": "Detailed guide for sincere repentance from sins and transgressions according to the Prophetic tradition, with tips to maintain repentance"
      },
      "icon": "fas fa-heart",
      "steps": [
        {
          "title": {
            "ar": "الندم على الذنب",
            "en": "Regret the Sin"
          },
          "description": {
            "ar": "اشعر بالندم الصادق على الذنب الذي ارتكبته، واستشعر عظمة الله وحرمة المعصية. الندم هو أساس التوبة النصوح.",
            "en": "Feel sincere regret for the sin committed, and reflect on Allah’s greatness and the sanctity of the sin. Regret is the foundation of sincere repentance."
          },
          "tips": {
            "ar": "تأمل في عواقب الذنب في الدنيا والآخرة لتعزيز الندم.",
            "en": "Reflect on the consequences of the sin in this world and the hereafter to strengthen regret."
          }
        },
        {
          "title": {
            "ar": "الإقلاع عن الذنب",
            "en": "Ceasing the Sin"
          },
          "description": {
            "ar": "اترك الذنب فوراً، سواء كان فعلاً (مثل السرقة) أو قولاً (مثل الغيبة) أو اعتقاداً. التوقف الفوري عن المعصية شرط أساسي للتوبة.",
            "en": "Stop the sin immediately, whether it’s an action (e.g., theft), speech (e.g., backbiting), or belief. Immediate cessation is a key condition of repentance."
          },
          "tips": {
            "ar": "إذا كنت تعاني من صعوبة في الإقلاع، اطلب العون من الله وابحث عن بيئة تدعم التوبة.",
            "en": "If stopping is difficult, seek Allah’s help and find a supportive environment."
          }
        },
        {
          "title": {
            "ar": "الاستغفار",
            "en": "Seeking Forgiveness"
          },
          "description": {
            "ar": "استغفر الله كثيراً قائلاً: 'أستغفر الله العظيم الذي لا إله إلا هو الحي القيوم وأتوب إليه'. أكثر من الدعاء بالمغفرة والرحمة.",
            "en": "Seek Allah’s forgiveness frequently, saying: 'Astaghfirullah al-‘azheem alladhi la ilaha illa huwa al-hayy al-qayyum wa atoobu ilayh.' Increase supplications for forgiveness and mercy."
          },
          "tips": {
            "ar": "خصص وقتاً يومياً للاستغفار، مثل بعد الصلوات أو في السحر.",
            "en": "Dedicate daily time for seeking forgiveness, such as after prayers or during the pre-dawn hours."
          }
        },
        {
          "title": {
            "ar": "العزم على عدم العودة",
            "en": "Resolving Not to Return"
          },
          "description": {
            "ar": "اعزم عزماً صادقاً في قلبك على عدم العودة إلى الذنب مرة أخرى، مهما كانت الإغراءات. هذا العزم يقوي إرادتك في الحفاظ على التوبة.",
            "en": "Make a sincere resolve in your heart not to return to the sin, no matter the temptations. This resolve strengthens your determination to maintain repentance."
          },
          "tips": {
            "ar": "ذكّر نفسك بفضل التوبة وثوابها لتعزيز عزمك.",
            "en": "Remind yourself of the virtue and reward of repentance to reinforce your resolve."
          }
        },
        {
          "title": {
            "ar": "رد المظالم",
            "en": "Returning Rights"
          },
          "description": {
            "ar": "إذا كان الذنب متعلقاً بحقوق الآخرين، مثل المال أو الإساءة، رد الحق إلى أهله أو اطلب السماح منهم إذا أمكن. إذا كان ذلك مستحيلاً، ادع لهم وتصدق نيابة عنهم.",
            "en": "If the sin involves others’ rights, such as money or harm, return the right to its owner or seek their forgiveness if possible. If not feasible, supplicate for them and give charity on their behalf."
          },
          "tips": {
            "ar": "كن شجاعاً في الاعتذار، فهو يطهر القلب ويقربك إلى الله.",
            "en": "Be courageous in apologizing, as it purifies the heart and brings you closer to Allah."
          }
        }
      ],
      "additional_info": {
        "ar": "التوبة باب مفتوح دائماً، وهي من أعظم العبادات. يستحب الإكثار من الأعمال الصالحة بعد التوبة مثل الصلاة والصدقة لتثبيتها.",
        "en": "Repentance is an ever-open door and one of the greatest acts of worship. It’s recommended to increase good deeds like prayer and charity after repentance to solidify it."
      },
      "common_mistakes": {
        "ar": "التهاون في التوبة، عدم رد المظالم، أو اليأس من قبول التوبة.",
        "en": "Being lax about repentance, failing to return rights, or despairing of Allah’s acceptance of repentance."
      }
    },
    {
      "id": "tahajjud",
      "title": {
        "ar": "كيفية أداء صلاة التهجد",
        "en": "How to Perform Salat al-Tahajjud"
      },
      "category": {
        "ar": "الصلاة",
        "en": "Prayer"
      },
      "description": {
        "ar": "دليل مفصل لأداء صلاة التهجد في جوف الليل، مع توضيح فضلها وكيفية الاستعداد لها",
        "en": "Detailed guide for performing Tahajjud prayer in the depths of night, including its virtues and preparation tips"
      },
      "icon": "fas fa-moon",
      "steps": [
        {
          "title": {
            "ar": "النوم ثم الاستيقاظ",
            "en": "Sleeping then Waking Up"
          },
          "description": {
            "ar": "نم بعد صلاة العشاء ولو قليلاً، ثم استيقظ في جوف الليل (يفضل الثلث الأخير) لأداء صلاة التهجد، فهي صلاة تُؤدى بعد النوم.",
            "en": "Sleep after Isha prayer, even briefly, then wake up in the depths of the night (preferably the last third) to perform Tahajjud, as it is a prayer performed after sleeping."
          },
          "tips": {
            "ar": "حاول النوم مبكراً لتسهيل الاستيقاظ، واضبط منبهاً لوقت محدد.",
            "en": "Try sleeping early to facilitate waking up, and set an alarm for a specific time."
          }
        },
        {
          "title": {
            "ar": "الوضوء والتسوك",
            "en": "Ablution and Miswak"
          },
          "description": {
            "ar": "توضأ وضوءاً كاملاً، واستخدم السواك لتنظيف الأسنان قبل الصلاة، فهو سنة مؤكدة تزيد من أجر الصلاة.",
            "en": "Perform complete wudu and use a miswak to clean your teeth before prayer, as it is a confirmed Sunnah that increases the prayer’s reward."
          },
          "tips": {
            "ar": "إذا شعرت بالنعاس، رش الماء البارد على وجهك لتنشيط نفسك.",
            "en": "If feeling sleepy, splash cold water on your face to energize yourself."
          }
        },
        {
          "title": {
            "ar": "البدء بركعتين خفيفتين",
            "en": "Starting with Two Light Rak’ahs"
          },
          "description": {
            "ar": "ابدأ بركعتين خفيفتين لتهيئة النفس، مع قراءة سور قصيرة مثل الفاتحة والكوثر أو الإخلاص. ركز على الخشوع منذ البداية.",
            "en": "Begin with two light rak’ahs to prepare yourself, reciting short surahs like Al-Fatiha and Al-Kawthar or Al-Ikhlas. Focus on reverence from the start."
          },
          "tips": {
            "ar": "صل في مكان هادئ ومظلم لتجنب التشتت.",
            "en": "Pray in a quiet, dark place to avoid distractions."
          }
        },
        {
          "title": {
            "ar": "إطالة الصلاة",
            "en": "Lengthening the Prayer"
          },
          "description": {
            "ar": "أطل في القراءة، القيام، الركوع، والسجود حسب طاقتك. اقرأ آيات أو سوراً تحبها، وأكثر من الدعاء في السجود، فهو وقت استجابة.",
            "en": "Lengthen recitation, standing, bowing, and prostration according to your capacity. Recite verses or surahs you love, and increase supplications in prostration, as it’s a time of response."
          },
          "tips": {
            "ar": "إذا كنت مبتدئاً، ابدأ بقراءة قصيرة ثم زِد تدريجياً.",
            "en": "If a beginner, start with short recitations and gradually increase."
          }
        }
      ],
      "additional_info": {
        "ar": "التهجد جزء من قيام الليل، وهو سنة مؤكدة كان النبي صلى الله عليه وسلم يحافظ عليه. يستحب الدعاء بطلب المغفرة والجنة.",
        "en": "Tahajjud is part of Qiyam al-Layl and a confirmed Sunnah that the Prophet (PBUH) maintained. It’s recommended to supplicate for forgiveness and paradise."
      },
      "common_mistakes": {
        "ar": "إهمال التهجد بسبب النوم، التسرع في الصلاة، أو عدم الاستعداد الروحي.",
        "en": "Neglecting Tahajjud due to sleep, rushing through the prayer, or lack of spiritual preparation."
      }
    },
    {
      "id": "eclipse",
      "title": {
        "ar": "كيفية أداء صلاة الكسوف والخسوف",
        "en": "How to Perform Salat al-Kusuf and Salat al-Khusuf"
      },
      "category": {
        "ar": "الصلاة",
        "en": "Prayer"
      },
      "description": {
        "ar": "دليل مفصل لأداء صلاة الكسوف (للشمس) والخسوف (للقمر) عند حدوثهما، مع توضيح الأحكام والآداب",
        "en": "Detailed guide for performing the solar (Kusuf) and lunar (Khusuf) eclipse prayers when they occur, including rulings and etiquette"
      },
      "icon": "fas fa-circle",
      "steps": [
        {
          "title": {
            "ar": "الصلاة عند الكسوف",
            "en": "Prayer During Eclipse"
          },
          "description": {
            "ar": "صل صلاة الكسوف أو الخسوف عند حدوث كسوف الشمس أو خسوف القمر، ويفضل أداؤها في جماعة في المسجد، لكن يمكن أداؤها منفرداً إذا لزم الأمر.",
            "en": "Perform the eclipse prayer during a solar or lunar eclipse, preferably in congregation at the mosque, but it can be performed individually if necessary."
          },
          "tips": {
            "ar": "تابع الأخبار الفلكية لمعرفة موعد الكسوف أو الخسوف بدقة.",
            "en": "Follow astronomical news to know the exact timing of the eclipse."
          }
        },
        {
          "title": {
            "ar": "ركعتان بأربع ركوعات",
            "en": "Two Rak’ahs with Four Bowings"
          },
          "description": {
            "ar": "صل ركعتين، حيث تحتوي كل ركعة على ركوعين وسجدتين. في الركعة الأولى، اقرأ الفاتحة وسورة طويلة، ثم اركع، ثم اقرأ مرة أخرى ثم اركع، ثم اسجد مرتين. كرر ذلك في الركعة الثانية.",
            "en": "Pray two rak’ahs, with each rak’ah containing two bowings and two prostrations. In the first rak’ah, recite Al-Fatiha and a long surah, bow, recite again, bow again, then prostrate twice. Repeat in the second rak’ah."
          },
          "tips": {
            "ar": "اختر سوراً طويلة مثل البقرة أو آل عمران لإطالة الصلاة.",
            "en": "Choose long surahs like Al-Baqarah or Aal-E-Imran to lengthen the prayer."
          }
        },
        {
          "title": {
            "ar": "إطالة القراءة",
            "en": "Lengthening Recitation"
          },
          "description": {
            "ar": "أطل في قراءة القرآن، الركوع، والسجود أكثر من الصلاة العادية، لأن صلاة الكسوف تُؤدى بطمأنينة وتدبر.",
            "en": "Lengthen the recitation, bowing, and prostration more than in regular prayer, as the eclipse prayer is performed with tranquility and reflection."
          },
          "tips": {
            "ar": "ركز على تدبر الآيات التي تتحدث عن قدرة الله وعظمته.",
            "en": "Focus on reflecting on verses about Allah’s power and greatness."
          }
        },
        {
          "title": {
            "ar": "الدعاء والاستغفار",
            "en": "Supplication and Seeking Forgiveness"
          },
          "description": {
            "ar": "أكثر من الدعاء، الاستغفار، والذكر خلال الصلاة وبعدها حتى ينجلي الكسوف. ادع بالمغفرة، الرحمة، والهداية للأمة.",
            "en": "Increase supplication, seeking forgiveness, and remembrance during and after the prayer until the eclipse ends. Pray for forgiveness, mercy, and guidance for the Ummah."
          },
          "tips": {
            "ar": "استغل هذا الوقت للدعاء بقلب خاشع، فهو وقت استجابة.",
            "en": "Use this time to supplicate with a humble heart, as it’s a time of response."
          }
        }
      ],
      "additional_info": {
        "ar": "صلاة الكسوف والخسوف سنة مؤكدة، وهي فرصة للتذكير بعظمة الله وقدرته. يستحب الإكثار من الصدقة والذكر أثناء الكسوف.",
        "en": "The eclipse prayer is a confirmed Sunnah and an opportunity to reflect on Allah’s greatness and power. It’s recommended to give charity and increase remembrance during an eclipse."
      },
      "common_mistakes": {
        "ar": "إهمال الصلاة بسبب عدم معرفة وقت الكسوف، أو التسرع فيها، أو عدم إطالة القراءة.",
        "en": "Neglecting the prayer due to not knowing the eclipse time, rushing through it, or not lengthening recitation."
      }
    },
    {
      "id": "tahiyyat-masjid",
      "title": {
        "ar": "كيفية أداء صلاة تحية المسجد",
        "en": "How to Perform Salat al-Tahiyyat al-Masjid"
      },
      "category": {
        "ar": "الصلاة",
        "en": "Prayer"
      },
      "description": {
        "ar": "دليل مفصل لأداء صلاة تحية المسجد عند دخوله، مع توضيح الآداب والأحكام",
        "en": "Detailed guide for performing the mosque greeting prayer upon entering, including etiquette and rulings"
      },
      "icon": "fas fa-mosque",
      "steps": [
        {
          "title": {
            "ar": "دخول المسجد",
            "en": "Entering the Mosque"
          },
          "description": {
            "ar": "ادخل المسجد بالقدم اليمنى وقل دعاء دخول المسجد: 'اللهم افتح لي أبواب رحمتك'. تأكد من أنك في حالة طهارة (وضوء).",
            "en": "Enter the mosque with the right foot and say the supplication: 'Allahumma iftah li abwaba rahmatik.' Ensure you are in a state of purification (wudu)."
          },
          "tips": {
            "ar": "ارتدِ ملابس نظيفة وساترة احتراماً للمسجد.",
            "en": "Wear clean, modest clothing to respect the mosque."
          }
        },
        {
          "title": {
            "ar": "عدم الجلوس قبل الصلاة",
            "en": "Not Sitting Before Prayer"
          },
          "description": {
            "ar": "لا تجلس في المسجد حتى تصلي ركعتين تحية المسجد، إلا إذا كنت ستصلي صلاة فريضة مباشرة أو إذا كان الإمام يخطب.",
            "en": "Do not sit in the mosque until you pray two rak’ahs as a greeting, unless you’re about to pray an obligatory prayer or the imam is delivering a sermon."
          },
          "tips": {
            "ar": "إذا كنت متعجلاً، صل ركعتين خفيفتين بسرعة.",
            "en": "If in a hurry, pray two quick, light rak’ahs."
          }
        },
        {
          "title": {
            "ar": "صلاة ركعتين",
            "en": "Praying Two Rak’ahs"
          },
          "description": {
            "ar": "صل ركعتين خفيفتين في أي مكان في المسجد، مع قراءة الفاتحة وسورة قصيرة مثل الإخلاص أو الكوثر في كل ركعة.",
            "en": "Pray two light rak’ahs anywhere in the mosque, reciting Al-Fatiha and a short surah like Al-Ikhlas or Al-Kawthar in each rak’ah."
          },
          "tips": {
            "ar": "اختر مكاناً هادئاً بعيداً عن الممرات لتجنب إزعاج المصلين.",
            "en": "Choose a quiet spot away from walkways to avoid disturbing others."
          }
        },
        {
          "title": {
            "ar": "الجلوس بعد الصلاة",
            "en": "Sitting After Prayer"
          },
          "description": {
            "ar": "بعد السلام، اجلس واشتغل بالذكر أو الدعاء، أو انتظر الصلاة الفريضة إذا كنت في وقتها. يمكنك قراءة القرآن أو الاستغفار.",
            "en": "After salam, sit and engage in remembrance or supplication, or wait for the obligatory prayer if it’s time. You can read the Quran or seek forgiveness."
          },
          "tips": {
            "ar": "استغل الجلوس في المسجد للتقرب إلى الله بالذكر والتفكر.",
            "en": "Use the time sitting in the mosque to draw closer to Allah through remembrance and reflection."
          }
        }
      ],
      "additional_info": {
        "ar": "صلاة تحية المسجد سنة مؤكدة، وهي تعبير عن احترام المسجد كبيت من بيوت الله. إذا دخلت المسجد وقت الخطبة، اجلس ولا تصل حتى تنتهي.",
        "en": "The mosque greeting prayer is a confirmed Sunnah, expressing respect for the mosque as a house of Allah. If you enter during a sermon, sit and don’t pray until it ends."
      },
      "common_mistakes": {
        "ar": "الجلوس قبل أداء الصلاة، أو إهمالها بسبب الانشغال، أو أداؤها في وقت محرم مثل أثناء الخطبة.",
        "en": "Sitting before praying, neglecting it due to busyness, or performing it at prohibited times like during a sermon."
      }
    },
    {
      "id": "adhkar-morning-evening",
      "title": {
        "ar": "كيفية أداء أذكار الصباح والمساء",
        "en": "How to Perform Morning and Evening Adhkar"
      },
      "category": {
        "ar": "الأذكار",
        "en": "Remembrance"
      },
      "description": {
        "ar": "دليل مفصل لأداء أذكار الصباح والمساء وفق السنة النبوية، مع توضيح فضلها وأهميتها",
        "en": "Detailed guide for performing morning and evening remembrances according to the Prophetic tradition, including their virtues and importance"
      },
      "icon": "fas fa-prayer",
      "steps": [
        {
          "title": {
            "ar": "تحديد الوقت المناسب",
            "en": "Determining the Appropriate Time"
          },
          "description": {
            "ar": "قل أذكار الصباح بعد صلاة الفجر وحتى طلوع الشمس أو قبل الظهر، وأذكار المساء بعد صلاة العصر وحتى غروب الشمس أو قبل منتصف الليل.",
            "en": "Say the morning adhkar after Fajr prayer until sunrise or before noon, and the evening adhkar after Asr prayer until sunset or before midnight."
          },
          "tips": {
            "ar": "خصص وقتاً يومياً ثابتاً للأذكار لتجعلها عادة يومية.",
            "en": "Set a fixed daily time for adhkar to make it a daily habit."
          }
        },
        {
          "title": {
            "ar": "قراءة الأذكار المأثورة",
            "en": "Reciting Prophetic Adhkar"
          },
          "description": {
            "ar": "اقرأ الأذكار المأثورة من السنة، مثل: 'أعوذ بكلمات الله التامات من شر ما خلق' (ثلاث مرات)، 'بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم' (ثلاث مرات)، وسورة الإخلاص والفلق والناس (ثلاث مرات).",
            "en": "Recite the Prophetic adhkar, such as: 'A’udhu bi kalimatillah at-tammat min sharri ma khalaq' (three times), 'Bismillah alladhi la yadurru ma’a ismihi shay’un fil-ard wala fis-sama’ wahuwa as-sami’ al-‘aleem' (three times), and Surahs Al-Ikhlas, Al-Falaq, and An-Nas (three times)."
          },
          "tips": {
            "ar": "استخدم كتيب الأذكار أو تطبيقاً إلكترونياً لتسهيل الحفظ والقراءة.",
            "en": "Use a booklet or app to facilitate memorization and recitation."
          }
        },
        {
          "title": {
            "ar": "التدبر والإخلاص",
            "en": "Reflection and Sincerity"
          },
          "description": {
            "ar": "اقرأ الأذكار بقلب خاشع، متدبراً معانيها، ومستشعراً حماية الله ورحمته. تجنب القراءة الآلية بدون تدبر.",
            "en": "Recite adhkar with a humble heart, reflecting on their meanings and feeling Allah’s protection and mercy. Avoid mechanical recitation without reflection."
          },
          "tips": {
            "ar": "تعلم معاني الأذكار لزيادة الخشوع أثناء القراءة.",
            "en": "Learn the meanings of the adhkar to increase reverence during recitation."
          }
        },
        {
          "title": {
            "ar": "الاستمرارية",
            "en": "Consistency"
          },
          "description": {
            "ar": "حافظ على أداء الأذكار يومياً، فهي حصن للمسلم من الشرور والمصائب. إذا نسيت، أدركها عند التذكر في نفس اليوم.",
            "en": "Maintain daily recitation of adhkar, as they are a fortress for the Muslim against evils and calamities. If you forget, catch up when you remember on the same day."
          },
          "tips": {
            "ar": "ربط الأذكار بروتين يومي، مثل بعد الصلاة أو أثناء الذهاب للعمل.",
            "en": "Link adhkar to a daily routine, such as after prayer or while commuting."
          }
        }
      ],
      "additional_info": {
        "ar": "أذكار الصباح والمساء سنة مؤكدة تحمي المسلم وتجلب البركة. ورد في الحديث أن من قالها حفظ حتى الوقت التالي.",
        "en": "Morning and evening adhkar are a confirmed Sunnah that protect the Muslim and bring blessings. It’s mentioned in Hadith that whoever recites them is protected until the next time."
      },
      "common_mistakes": {
        "ar": "إهمال الأذكار بسبب الانشغال، القراءة بدون تدبر، أو عدم الالتزام بالوقت المحدد.",
        "en": "Neglecting adhkar due to busyness, reciting without reflection, or not adhering to the specified times."
      }
    },
    {
      "id": "eid-prayer",
      "title": {
        "ar": "كيفية أداء صلاة العيد",
        "en": "How to Perform Eid Prayer"
      },
      "category": {
        "ar": "الصلاة",
        "en": "Prayer"
      },
      "description": {
        "ar": "دليل مفصل لأداء صلاة العيدين (الفطر والأضحى) وفق السنة النبوية، مع توضيح الآداب والنصائح",
        "en": "Detailed guide for performing the Eid prayers (Fitr and Adha) according to the Prophetic tradition, including etiquette and tips"
      },
      "icon": "fas fa-star-and-crescent",
      "steps": [
        {
          "title": {
            "ar": "الاستعداد للصلاة",
            "en": "Preparing for the Prayer"
          },
          "description": {
            "ar": "اغتسل، وارتدِ أفضل الثياب، واستخدم العطر (للرجال). تناول شيئاً خفيفاً قبل صلاة عيد الفطر (مثل التمر)، وامتنع عن الأكل قبل صلاة عيد الأضحى حتى الذبح.",
            "en": "Perform ghusl, wear your best clothes, and use perfume (for men). Eat something light before Eid al-Fitr prayer (e.g., dates), and refrain from eating before Eid al-Adha prayer until the sacrifice."
          },
          "tips": {
            "ar": "اختر ملابس نظيفة وساترة، وتأكد من الطهارة الكاملة.",
            "en": "Choose clean, modest clothing and ensure complete purification."
          }
        },
        {
          "title": {
            "ar": "الذهاب إلى المصلى",
            "en": "Going to the Prayer Place"
          },
          "description": {
            "ar": "توجه إلى مكان صلاة العيد (مصلى العيد أو المسجد) مشياً إن أمكن، وكبر في الطريق قائلاً: 'الله أكبر الله أكبر لا إله إلا الله...'.",
            "en": "Go to the Eid prayer place (open prayer ground or mosque) on foot if possible, reciting Takbir: 'Allahu akbar Allahu akbar la ilaha illa Allah...'"
          },
          "tips": {
            "ar": "اذهب مبكراً للحصول على مكان قريب من الإمام.",
            "en": "Go early to secure a spot close to the imam."
          }
        },
        {
          "title": {
            "ar": "أداء الصلاة",
            "en": "Performing the Prayer"
          },
          "description": {
            "ar": "صل ركعتين: في الركعة الأولى، كبر سبع تكبيرات بعد تكبيرة الإحرام، ثم اقرأ الفاتحة وسورة (مثل الأعلى). في الركعة الثانية، كبر خمس تكبيرات بعد القيام، ثم اقرأ الفاتحة وسورة (مثل الغاشية).",
            "en": "Pray two rak’ahs: In the first rak’ah, say seven Takbirs after the opening Takbir, then recite Al-Fatiha and a surah (e.g., Al-A’la). In the second rak’ah, say five Takbirs after standing, then recite Al-Fatiha and a surah (e.g., Al-Ghashiyah)."
          },
          "tips": {
            "ar": "اتبع الإمام في التكبيرات وتجنب التسرع في القراءة.",
            "en": "Follow the imam in the Takbirs and avoid rushing the recitation."
          }
        },
        {
          "title": {
            "ar": "الاستماع للخطبة",
            "en": "Listening to the Sermon"
          },
          "description": {
            "ar": "بعد الصلاة، استمع إلى خطبة العيد بتركيز وهدوء. الخطبة سنة، لكن يستحب البقاء لها للاستفادة من التذكير والنصيحة.",
            "en": "After the prayer, listen to the Eid sermon attentively and quietly. The sermon is a Sunnah, but it’s recommended to stay for it to benefit from the reminder and advice."
          },
          "tips": {
            "ar": "تجنب الحديث أو الانشغال أثناء الخطبة لتحقيق الأدب.",
            "en": "Avoid talking or distractions during the sermon to maintain etiquette."
          }
        }
      ],
      "additional_info": {
        "ar": "صلاة العيد سنة مؤكدة، وهي فرصة للفرح والتواصل الاجتماعي. يستحب تبادل التهاني بعد الصلاة والعودة بطريق مختلف عن طريق الذهاب.",
        "en": "Eid prayer is a confirmed Sunnah and an opportunity for joy and social connection. It’s recommended to exchange greetings after the prayer and return by a different route."
      },
      "common_mistakes": {
        "ar": "إهمال التكبيرات الإضافية، أو عدم تناول الطعام قبل عيد الفطر، أو مغادرة المصلى قبل الخطبة.",
        "en": "Neglecting the extra Takbirs, not eating before Eid al-Fitr prayer, or leaving before the sermon."
      }
    },
    {
      "id": "janazah-preparation",
      "title": {
        "ar": "كيفية تجهيز الجنازة",
        "en": "How to Prepare a Janazah (Funeral)"
      },
      "category": {
        "ar": "الجنائز",
        "en": "Funerals"
      },
      "description": {
        "ar": "دليل مفصل لتجهيز الجنازة من الغسل إلى الدفن وفق السنة النبوية، مع توضيح الأحكام والآداب",
        "en": "Detailed guide for preparing a funeral from washing to burial according to the Prophetic tradition, including rulings and etiquette"
      },
      "icon": "fas fa-hand-holding-heart",
      "steps": [
        {
          "title": {
            "ar": "غسل الميت",
            "en": "Washing the Deceased"
          },
          "description": {
            "ar": "اغسل الميت بالماء والسدر (أو الصابون) ثلاث مرات أو أكثر إذا لزم الأمر. ابدأ بالجانب الأيمن، وتأكد من الستر والاحترام. يغسل الرجال الرجال والنساء النساء، إلا في حالات استثنائية (مثل الزوج أو الزوجة).",
            "en": "Wash the deceased with water and sidr (or soap) three times or more if needed. Start with the right side, ensuring modesty and respect. Men wash men and women wash women, except in exceptional cases (e.g., spouse)."
          },
          "tips": {
            "ar": "استخدم ماء دافئاً وتأكد من نظافة الأدوات المستخدمة.",
            "en": "Use warm water and ensure the tools used are clean."
          }
        },
        {
          "title": {
            "ar": "تكفين الميت",
            "en": "Shrouding the Deceased"
          },
          "description": {
            "ar": "كفن الميت في ثياب بيضاء نظيفة (ثلاث قطع للرجال، وخمس للنساء). ضع الكفن بحيث يغطي الجسم بالكامل، واستخدم العطر إذا أمكن.",
            "en": "Shroud the deceased in clean white cloth (three pieces for men, five for women). Ensure the shroud covers the entire body, and use perfume if possible."
          },
          "tips": {
            "ar": "اختر قماشاً بسيطاً وغير مكلف، فالإسراف في الكفن غير مستحب.",
            "en": "Choose simple, inexpensive cloth, as extravagance in shrouding is not recommended."
          }
        },
        {
          "title": {
            "ar": "صلاة الجنازة",
            "en": "Funeral Prayer"
          },
          "description": {
            "ar": "صل صلاة الجنازة على الميت، وهي أربع تكبيرات كما ورد في دليل صلاة الجنازة. يفضل أداؤها في جماعة.",
            "en": "Perform the funeral prayer for the deceased, consisting of four Takbirs as outlined in the funeral prayer guide. It’s preferably done in congregation."
          },
          "tips": {
            "ar": "حث الناس على حضور صلاة الجنازة لزيادة الدعاء للميت.",
            "en": "Encourage people to attend the funeral prayer to increase supplications for the deceased."
          }
        },
        {
          "title": {
            "ar": "الدفن",
            "en": "Burial"
          },
          "description": {
            "ar": "ادفن الميت في قبر يحفر بعمق كافٍ، واجعل الميت مستلقياً على جنبه الأيمن متوجهاً إلى القبلة. ضع حجراً أو تراباً لتثبيت الكفن، وادع للميت بالمغفرة.",
            "en": "Bury the deceased in a sufficiently deep grave, laying them on their right side facing the Qibla. Place a stone or soil to secure the shroud, and supplicate for their forgiveness."
          },
          "tips": {
            "ar": "تعجيل الدفن مستحب، فلا تؤخر إلا لضرورة.",
            "en": "Hastening the burial is recommended, so don’t delay unless necessary."
          }
        }
      ],
      "additional_info": {
        "ar": "تجهيز الجنازة فرض كفاية، ويجب أن يتم باحترام وسرعة. يستحب الدعاء للميت وزيارة القبر بعد الدفن.",
        "en": "Preparing a funeral is a communal obligation and must be done with respect and haste. It’s recommended to supplicate for the deceased and visit the grave afterward."
      },
      "common_mistakes": {
        "ar": "إهمال الستر أثناء الغسل، استخدام كفن مكلف، أو التأخير في الدفن بدون سبب.",
        "en": "Neglecting modesty during washing, using an expensive shroud, or delaying burial without reason."
      }
    },
    {
      "id": "sadaqah",
      "title": {
        "ar": "كيفية إعطاء الصدقة",
        "en": "How to Give Sadaqah (Charity)"
      },
      "category": {
        "ar": "الأخلاق والسلوك",
        "en": "Ethics & Conduct"
      },
      "description": {
        "ar": "دليل مفصل لإعطاء الصدقة بنية خالصة وفق السنة النبوية، مع توضيح أنواعها وفضلها",
        "en": "Detailed guide for giving charity with sincere intention according to the Prophetic tradition, including its types and virtues"
      },
      "icon": "fas fa-hand-holding-heart",
      "steps": [
        {
          "title": {
            "ar": "النية الخالصة",
            "en": "Sincere Intention"
          },
          "description": {
            "ar": "اعقد النية في قلبك أن الصدقة لله تعالى فقط، دون رياء أو طلب مدح من الناس. الإخلاص شرط أساسي لقبول الصدقة.",
            "en": "Make the intention in your heart that the charity is solely for Allah, without showing off or seeking praise. Sincerity is a key condition for acceptance."
          },
          "tips": {
            "ar": "تذكر أن الصدقة تطفئ غضب الله وتزيد البركة في المال.",
            "en": "Remember that charity extinguishes Allah’s wrath and increases blessings in wealth."
          }
        },
        {
          "title": {
            "ar": "اختيار نوع الصدقة",
            "en": "Choosing the Type of Charity"
          },
          "description": {
            "ar": "اختر نوع الصدقة المناسب، سواء كان مالاً، طعاماً، ملابس، أو حتى مساعدة بالجهد مثل مساعدة محتاج. يمكن أن تكون الصدقة بابتسامة أو كلمة طيبة.",
            "en": "Choose an appropriate form of charity, whether money, food, clothing, or effort like helping someone in need. Even a smile or kind word counts as charity."
          },
          "tips": {
            "ar": "اعطِ مما تحب، فالصدقة من أحب الأشياء إليك تزيد الأجر.",
            "en": "Give from what you love, as charity from your most cherished possessions increases reward."
          }
        },
        {
          "title": {
            "ar": "إعطاء الصدقة سراً",
            "en": "Giving Charity Discreetly"
          },
          "description": {
            "ar": "يستحب إعطاء الصدقة سراً لتجنب الرياء وحفظ كرامة المتلقي. إذا كانت علانية، تأكد أنها لنشر الخير أو تشجيع الآخرين.",
            "en": "It is recommended to give charity discreetly to avoid showing off and preserve the recipient’s dignity. If given publicly, ensure it’s to promote good or encourage others."
          },
          "tips": {
            "ar": "ابحث عن منظمات موثوقة إذا كنت لا تعرف محتاجين بشكل مباشر.",
            "en": "Seek trusted organizations if you don’t know people in need directly."
          }
        },
        {
          "title": {
            "ar": "الاستمرارية في الصدقة",
            "en": "Consistency in Giving"
          },
          "description": {
            "ar": "حافظ على إعطاء الصدقة بانتظام، حتى لو كانت قليلة. الصدقة الدائمة، مثل التبرع الشهري، لها أجر عظيم.",
            "en": "Maintain regular charity, even if small. Ongoing charity, like monthly donations, carries great reward."
          },
          "tips": {
            "ar": "خصص جزءاً من دخلك الشهري للصدقة لتسهيل الاستمرارية.",
            "en": "Allocate a portion of your monthly income for charity to ensure consistency."
          }
        }
      ],
      "additional_info": {
        "ar": "الصدقة تطهر المال وتزيد الرزق، وهي من أفضل الأعمال التي تقرب العبد إلى الله. ورد في الحديث أنها تمنع المصائب وتطيل العمر.",
        "en": "Charity purifies wealth and increases sustenance. It’s one of the best deeds to draw closer to Allah, and Hadith states it prevents calamities and prolongs life."
      },
      "common_mistakes": {
        "ar": "إعطاء الصدقة بنية الرياء، أو إعطاء ما هو رديء، أو التوقف عنها بسبب ضيق الحال.",
        "en": "Giving charity to show off, giving poor-quality items, or stopping due to financial constraints."
      }
    },
    {
      "id": "truthfulness",
      "title": {
        "ar": "كيفية التحلي بالصدق",
        "en": "How to Uphold Truthfulness"
      },
      "category": {
        "ar": "الأخلاق والسلوك",
        "en": "Ethics & Conduct"
      },
      "description": {
        "ar": "دليل مفصل للتحلي بالصدق في القول والفعل وفق السنة النبوية، مع توضيح فضله وآثاره",
        "en": "Detailed guide for practicing truthfulness in speech and action according to the Prophetic tradition, including its virtues and effects"
      },
      "icon": "fas fa-balance-scale",
      "steps": [
        {
          "title": {
            "ar": "التزام الصدق في القول",
            "en": "Committing to Truthful Speech"
          },
          "description": {
            "ar": "قل الحق دائماً، حتى لو كان ضد مصلحتك الشخصية، ما لم يؤدِ إلى ضرر أكبر. تجنب الكذب، حتى في المزاح، فالصدق علامة الإيمان.",
            "en": "Always speak the truth, even if it’s against your personal interest, unless it causes greater harm. Avoid lying, even in jest, as truthfulness is a sign of faith."
          },
          "tips": {
            "ar": "إذا ترددت، تذكر أن الصدق يجلب البركة والثقة من الآخرين.",
            "en": "If hesitant, remember that truthfulness brings blessings and trust from others."
          }
        },
        {
          "title": {
            "ar": "الصدق في الأفعال",
            "en": "Truthfulness in Actions"
          },
          "description": {
            "ar": "التزم بالصدق في أفعالك، مثل الوفاء بالوعود وأداء الأمانات. تجنب النفاق بجعل أفعالك مطابقة لأقوالك.",
            "en": "Be truthful in your actions by keeping promises and fulfilling trusts. Avoid hypocrisy by ensuring your actions match your words."
          },
          "tips": {
            "ar": "دوّن وعودك لتتذكر الوفاء بها، وتجنب الوعود التي لا تستطيع تحقيقها.",
            "en": "Write down promises to remember fulfilling them, and avoid making promises you can’t keep."
          }
        },
        {
          "title": {
            "ar": "الصبر على الصدق",
            "en": "Patience in Upholding Truth"
          },
          "description": {
            "ar": "اصبر على تبعات الصدق، فقد تواجه تحديات أو انتقادات. تذكر أن الله يحب الصادقين ويجزيهم خيراً.",
            "en": "Be patient with the consequences of truthfulness, as you may face challenges or criticism. Remember that Allah loves the truthful and rewards them."
          },
          "tips": {
            "ar": "استعن بالدعاء ليثبتك الله على الصدق في المواقف الصعبة.",
            "en": "Seek Allah’s help through dua to remain steadfast in truthfulness during tough situations."
          }
        },
        {
          "title": {
            "ar": "تجنب الكذب الأبيض",
            "en": "Avoiding White Lies"
          },
          "description": {
            "ar": "تجنب الكذب حتى لو كان بنية حسنة، إلا في الحالات التي أجازها الشرع (مثل الإصلاح بين الناس). ابحث عن طرق صادقة لتحقيق الهدف.",
            "en": "Avoid white lies, even with good intentions, except in cases permitted by Sharia (e.g., reconciling people). Find truthful ways to achieve your goal."
          },
          "tips": {
            "ar": "إذا كنت في موقف صعب، استخدم الصمت أو عبارات محايدة بدلاً من الكذب.",
            "en": "In difficult situations, use silence or neutral phrases instead of lying."
          }
        }
      ],
      "additional_info": {
        "ar": "الصدق من أعظم الأخلاق، وهو طريق إلى الجنة كما ورد في الحديث. الصادقون يكونون مع النبيين والصديقين يوم القيامة.",
        "en": "Truthfulness is among the greatest morals and a path to paradise, as stated in Hadith. The truthful will be with the prophets and righteous on the Day of Judgment."
      },
      "common_mistakes": {
        "ar": "الكذب في المزاح، عدم الوفاء بالوعود، أو التساهل في قول الحق خوفاً من رد فعل الآخرين.",
        "en": "Lying in jest, failing to keep promises, or hesitating to speak the truth due to fear of others’ reactions."
      }
    },
    {
      "id": "good-manners",
      "title": {
        "ar": "كيفية التحلي بحسن الخلق",
        "en": "How to Practice Good Manners"
      },
      "category": {
        "ar": "الأخلاق والسلوك",
        "en": "Ethics & Conduct"
      },
      "description": {
        "ar": "دليل مفصل للتحلي بحسن الخلق في التعامل مع الناس وفق السنة النبوية، مع توضيح أهميته",
        "en": "Detailed guide for practicing good manners in dealings with others according to the Prophetic tradition, including its importance"
      },
      "icon": "fas fa-smile",
      "steps": [
        {
          "title": {
            "ar": "اللين في القول",
            "en": "Gentleness in Speech"
          },
          "description": {
            "ar": "تحدث بكلام طيب ولين، وتجنب الجفاء أو القسوة في الحديث. استخدم كلمات المدح والتشجيع، وابتسم عند التحدث إلى الآخرين.",
            "en": "Speak kindly and gently, avoiding harshness or rudeness. Use words of praise and encouragement, and smile when speaking to others."
          },
          "tips": {
            "ar": "تذكر أن الكلمة الطيبة صدقة، كما ورد في الحديث.",
            "en": "Remember that a kind word is charity, as stated in Hadith."
          }
        },
        {
          "title": {
            "ar": "احترام الآخرين",
            "en": "Respecting Others"
          },
          "description": {
            "ar": "عامل الناس باحترام، سواء كانوا أكبر أو أصغر منك، بغض النظر عن دينهم أو عرقهم. قدم الأولوية لكبار السن والمحتاجين.",
            "en": "Treat people with respect, whether older or younger, regardless of their religion or race. Prioritize the elderly and those in need."
          },
          "tips": {
            "ar": "استمع جيداً عندما يتحدث الآخرون، وتجنب مقاطعتهم.",
            "en": "Listen attentively when others speak, and avoid interrupting them."
          }
        },
        {
          "title": {
            "ar": "الصبر على الأذى",
            "en": "Patience with Harm"
          },
          "description": {
            "ar": "اصبر إذا واجهت إساءة من الآخرين، وتجنب الرد بالمثل. استبدل الإساءة بالإحسان، فهذا من أعلى مراتب حسن الخلق.",
            "en": "Be patient if harmed by others, and avoid responding in kind. Replace harm with kindness, as this is among the highest levels of good manners."
          },
          "tips": {
            "ar": "استعن بالدعاء ليمنحك الله الصبر والحلم في التعامل مع الآخرين.",
            "en": "Seek Allah’s help through dua for patience and forbearance in dealings."
          }
        },
        {
          "title": {
            "ar": "التحلي بالبشاشة",
            "en": "Being Cheerful"
          },
          "description": {
            "ar": "اظهر البشاشة والوجه المبتسم عند لقاء الناس، فهذا ينشر المحبة والألفة بينهم. تجنب العبوس أو الوجه الكئيب.",
            "en": "Show cheerfulness and a smiling face when meeting people, as this spreads love and familiarity. Avoid frowning or appearing gloomy."
          },
          "tips": {
            "ar": "ابدأ لقاءاتك بالسلام لتعزيز الأجواء الإيجابية.",
            "en": "Start interactions with salam to foster a positive atmosphere."
          }
        }
      ],
      "additional_info": {
        "ar": "حسن الخلق من أثقل الأعمال في ميزان الحسنات، وهو من صفات النبي صلى الله عليه وسلم. ورد في الحديث أن أحب الناس إلى الله أحسنهم خلقاً.",
        "en": "Good manners are among the heaviest deeds on the scale of good deeds and a trait of the Prophet (PBUH). Hadith states that the most beloved to Allah are those with the best manners."
      },
      "common_mistakes": {
        "ar": "القسوة في القول، تجاهل احترام الآخرين، أو الرد على الإساءة بالإساءة.",
        "en": "Harsh speech, neglecting respect for others, or responding to harm with harm."
      }
    },
    {
      "id": "neighbor-rights",
      "title": {
        "ar": "كيفية مراعاة حقوق الجيران",
        "en": "How to Uphold Neighbors’ Rights"
      },
      "category": {
        "ar": "الأخلاق والسلوك",
        "en": "Ethics & Conduct"
      },
      "description": {
        "ar": "دليل مفصل للتعامل مع الجيران بأخلاق عالية وفق السنة النبوية، مع توضيح حقوقهم",
        "en": "Detailed guide for treating neighbors with high morals according to the Prophetic tradition, including their rights"
      },
      "icon": "fas fa-home",
      "steps": [
        {
          "title": {
            "ar": "إلقاء السلام",
            "en": "Offering Salam"
          },
          "description": {
            "ar": "ابدأ بالسلام عند لقاء جيرانك، فهو يعزز الألفة والمحبة. إذا كنت لا تعرفهم، قدم نفسك بلطف.",
            "en": "Greet neighbors with salam when meeting them, as it fosters familiarity and love. If you don’t know them, introduce yourself kindly."
          },
          "tips": {
            "ar": "ابتسم عند إلقاء السلام لإظهار حسن النية.",
            "en": "Smile when offering salam to show goodwill."
          }
        },
        {
          "title": {
            "ar": "مساعدة الجيران",
            "en": "Helping Neighbors"
          },
          "description": {
            "ar": "اعرض المساعدة على جيرانك في أوقات الحاجة، مثل تقديم الطعام، المساعدة في الأعمال المنزلية، أو الوقوف معهم في الأزمات.",
            "en": "Offer help to neighbors in times of need, such as sharing food, assisting with household tasks, or supporting them in crises."
          },
          "tips": {
            "ar": "ابدأ بمساعدات بسيطة مثل مشاركة طبق طعام لتعزيز العلاقة.",
            "en": "Start with simple gestures like sharing a dish to strengthen ties."
          }
        },
        {
          "title": {
            "ar": "تجنب الأذى",
            "en": "Avoiding Harm"
          },
          "description": {
            "ar": "تجنب إيذاء الجيران بالضوضاء، القمامة، أو التدخل في خصوصياتهم. احترم خصوصيتهم ومساحتهم الشخصية.",
            "en": "Avoid harming neighbors with noise, litter, or intruding on their privacy. Respect their privacy and personal space."
          },
          "tips": {
            "ar": "إذا كنت تخطط لمناسبة صاخبة، أخبرهم مسبقاً واعتذر إذا تسببت في إزعاج.",
            "en": "If planning a noisy event, inform them in advance and apologize for any disturbance."
          }
        },
        {
          "title": {
            "ar": "الصبر على جيرانك",
            "en": "Patience with Neighbors"
          },
          "description": {
            "ar": "اصبر على أخطاء الجيران أو تصرفاتهم المزعجة، وحاول التحدث معهم بلطف لحل أي مشكلة بدلاً من الشجار.",
            "en": "Be patient with neighbors’ mistakes or annoying behaviors, and try addressing issues kindly instead of arguing."
          },
          "tips": {
            "ar": "استعن بالدعاء ليمنحك الله الصبر والحكمة في التعامل مع الجيران.",
            "en": "Pray for Allah to grant you patience and wisdom in dealing with neighbors."
          }
        }
      ],
      "additional_info": {
        "ar": "حق الجار عظيم في الإسلام، وورد في الحديث أن الجار له حقوق حتى لو لم يكن مسلماً. الإحسان إلى الجيران طريق إلى الجنة.",
        "en": "Neighbors’ rights are significant in Islam, and Hadith emphasizes their rights even if they’re non-Muslims. Kindness to neighbors is a path to paradise."
      },
      "common_mistakes": {
        "ar": "إهمال التواصل مع الجيران، التسبب في إزعاج دون اعتذار، أو الرد على إساءتهم بالمثل.",
        "en": "Neglecting interaction with neighbors, causing disturbances without apology, or responding to their harm with harm."
      }
    },
    {
      "id": "anger-management",
      "title": {
        "ar": "كيفية التحكم في الغضب",
        "en": "How to Control Anger"
      },
      "category": {
        "ar": "الأخلاق والسلوك",
        "en": "Ethics & Conduct"
      },
      "description": {
        "ar": "دليل مفصل للتحكم في الغضب والتعامل معه وفق السنة النبوية، مع توضيح أضراره وفوائد ضبط النفس",
        "en": "Detailed guide for controlling anger and managing it according to the Prophetic tradition, including its harms and benefits of self-control"
      },
      "icon": "fas fa-fire",
      "steps": [
        {
          "title": {
            "ar": "الاستعاذة بالله",
            "en": "Seeking Refuge with Allah"
          },
          "description": {
            "ar": "عند الشعور بالغضب، قل: 'أعوذ بالله من الشيطان الرجيم' فوراً، فالغضب من الشيطان، كما ورد في الحديث.",
            "en": "When feeling angry, say: 'A’udhu billahi min ash-shaytan ar-rajim' immediately, as anger is from Satan, per Hadith."
          },
          "tips": {
            "ar": "ردد الاستعاذة بصوت منخفض لتهدئة نفسك بسرعة.",
            "en": "Recite the refuge prayer softly to calm yourself quickly."
          }
        },
        {
          "title": {
            "ar": "تغيير الوضعية",
            "en": "Changing Position"
          },
          "description": {
            "ar": "إذا كنت واقفاً، اجلس، وإذا كنت جالساً، استلقِ. تغيير الوضعية يساعد على تقليل الغضب، كما ورد في الحديث.",
            "en": "If standing, sit down; if sitting, lie down. Changing position helps reduce anger, as mentioned in Hadith."
          },
          "tips": {
            "ar": "حرك نفسك إلى مكان هادئ لتجنب تصعيد الموقف.",
            "en": "Move to a quiet place to avoid escalating the situation."
          }
        },
        {
          "title": {
            "ar": "الوضوء",
            "en": "Performing Wudu"
          },
          "description": {
            "ar": "توضأ بالماء البارد، فالماء يطفئ نار الغضب كما ورد في الحديث. الوضوء يجدد الطاقة الروحية ويهدئ النفس.",
            "en": "Perform wudu with cold water, as water extinguishes the fire of anger, per Hadith. Wudu renews spiritual energy and calms the soul."
          },
          "tips": {
            "ar": "ركز على غسل الوجه واليدين ببطء لتعزيز الهدوء.",
            "en": "Focus on washing the face and hands slowly to enhance calmness."
          }
        },
        {
          "title": {
            "ar": "الصمت والتفكير",
            "en": "Silence and Reflection"
          },
          "description": {
            "ar": "التزم الصمت عند الغضب، وتجنب الكلام حتى تهدأ. فكر في عواقب رد فعلك واستعن بالله بالدعاء للسيطرة على النفس.",
            "en": "Remain silent when angry and avoid speaking until you calm down. Reflect on the consequences of your reaction and seek Allah’s help through dua."
          },
          "tips": {
            "ar": "خذ نفساً عميقاً وعد إلى عشرة قبل الرد على الموقف.",
            "en": "Take a deep breath and count to ten before responding to the situation."
          }
        }
      ],
      "additional_info": {
        "ar": "ضبط الغضب من صفات الأقوياء، كما ورد في الحديث. التحكم في النفس يقرب العبد إلى الله ويحفظ العلاقات مع الآخرين.",
        "en": "Controlling anger is a trait of the strong, as per Hadith. Self-control draws one closer to Allah and preserves relationships with others."
      },
      "common_mistakes": {
        "ar": "الكلام أثناء الغضب، الرد بعنف، أو تجاهل نصائح النبي صلى الله عليه وسلم للسيطرة على الغضب.",
        "en": "Speaking while angry, responding aggressively, or ignoring the Prophet’s (PBUH) advice for controlling anger."
      }
    },
    {
      "id": "humility",
      "title": {
        "ar": "كيفية التحلي بالتواضع",
        "en": "How to Practice Humility"
      },
      "category": {
        "ar": "الأخلاق والسلوك",
        "en": "Ethics & Conduct"
      },
      "description": {
        "ar": "دليل مفصل للتحلي بالتواضع وتجنب الكبر وفق السنة النبوية، مع توضيح فضله",
        "en": "Detailed guide for practicing humility and avoiding arrogance according to the Prophetic tradition, including its virtues"
      },
      "icon": "fas fa-handshake",
      "steps": [
        {
          "title": {
            "ar": "إدراك عظمة الله",
            "en": "Recognizing Allah’s Greatness"
          },
          "description": {
            "ar": "تذكر أن كل نعمة من الله، وأنك عبد فقير إليه. هذا الوعي يمنع الكبر ويعزز التواضع في القلب.",
            "en": "Remember that every blessing is from Allah and that you are His humble servant. This awareness prevents arrogance and fosters humility."
          },
          "tips": {
            "ar": "أكثر من ذكر الله والاستغفار لتتذكر ضعفك أمام قدرته.",
            "en": "Increase remembrance of Allah and seeking forgiveness to recall your weakness before His power."
          }
        },
        {
          "title": {
            "ar": "التعامل بلطف مع الجميع",
            "en": "Treating Everyone Kindly"
          },
          "description": {
            "ar": "عامل الناس بلطف ومساواة، سواء كانوا أغنياء أو فقراء، كباراً أو صغاراً. التواضع يظهر في احترام الجميع دون تمييز.",
            "en": "Treat people kindly and equally, whether rich or poor, old or young. Humility is shown by respecting everyone without discrimination."
          },
          "tips": {
            "ar": "ابدأ بالسلام والابتسامة حتى مع من هم أقل منك منزلة.",
            "en": "Start with salam and a smile, even to those of lower status."
          }
        },
        {
          "title": {
            "ar": "تجنب التفاخر",
            "en": "Avoiding Boasting"
          },
          "description": {
            "ar": "تجنب التفاخر بالمال، العلم، أو المكانة. إذا أردت الحديث عن نعمة، اذكرها بشكر الله، لا بفخر.",
            "en": "Avoid boasting about wealth, knowledge, or status. If mentioning a blessing, do so with gratitude to Allah, not pride."
          },
          "tips": {
            "ar": "إذا شعرت برغبة في التفاخر، ردد 'ما شاء الله لا قوة إلا بالله'.",
            "en": "If tempted to boast, say ‘Masha’Allah, la quwwata illa billah.’"
          }
        },
        {
          "title": {
            "ar": "قبول النصيحة",
            "en": "Accepting Advice"
          },
          "description": {
            "ar": "تقبل النصيحة من الآخرين بصدر رحب، حتى لو كانوا أقل منك علماً أو خبرة. التواضع يظهر في الانفتاح على التعلم.",
            "en": "Accept advice from others with an open heart, even if they’re less knowledgeable or experienced. Humility is shown by being open to learning."
          },
          "tips": {
            "ar": "اشكر من ينصحك، فهو يريد لك الخير.",
            "en": "Thank those who advise you, as they want good for you."
          }
        }
      ],
      "additional_info": {
        "ar": "التواضع من أعظم صفات المؤمنين، وهو طريق إلى محبة الله والناس. ورد في الحديث أن المتواضع يرفعه الله درجات.",
        "en": "Humility is among the greatest traits of believers and a path to Allah’s and people’s love. Hadith states that the humble are raised in ranks by Allah."
      },
      "common_mistakes": {
        "ar": "الكبر على الآخرين، التفاخر بالنعم، أو رفض النصيحة بدعوى العلم أو المكانة.",
        "en": "Being arrogant toward others, boasting about blessings, or rejecting advice due to perceived knowledge or status."
      }
    },
    {
      "id": "forgiveness",
      "title": {
        "ar": "كيفية العفو عن الآخرين",
        "en": "How to Forgive Others"
      },
      "category": {
        "ar": "الأخلاق والسلوك",
        "en": "Ethics & Conduct"
      },
      "description": {
        "ar": "دليل مفصل للتعلم كيفية العفو عن الآخرين والتسامح وفق السنة النبوية، مع توضيح فضله",
        "en": "Detailed guide for learning to forgive others and practice tolerance according to the Prophetic tradition, including its virtues"
      },
      "icon": "fas fa-dove",
      "steps": [
        {
          "title": {
            "ar": "التفكر في فضل العفو",
            "en": "Reflecting on the Virtue of Forgiveness"
          },
          "description": {
            "ar": "تذكر أن العفو يقربك إلى الله، وأن الله يعد بالمغفرة لمن يعفو عن الناس. فكر في الراحة النفسية التي تأتي من التسامح.",
            "en": "Reflect that forgiveness draws you closer to Allah, and He promises forgiveness to those who forgive others. Consider the peace of mind that comes from tolerance."
          },
          "tips": {
            "ar": "اقرأ الآيات والأحاديث عن العفو لتعزيز رغبتك في التسامح.",
            "en": "Read Quranic verses and Hadith about forgiveness to strengthen your desire to forgive."
          }
        },
        {
          "title": {
            "ar": "التغلب على الغضب",
            "en": "Overcoming Anger"
          },
          "description": {
            "ar": "إذا شعرت بالغضب من الإساءة، استعذ بالله من الشيطان، واتبع خطوات ضبط الغضب مثل الصمت أو الوضوء قبل اتخاذ قرار العفو.",
            "en": "If angry about a wrong, seek refuge with Allah from Satan and follow anger management steps like silence or wudu before deciding to forgive."
          },
          "tips": {
            "ar": "خذ وقتاً لتهدأ قبل مواجهة الشخص الذي أساء إليك.",
            "en": "Take time to calm down before confronting the person who wronged you."
          }
        },
        {
          "title": {
            "ar": "الدعاء للمسيء",
            "en": "Praying for the Wrongdoer"
          },
          "description": {
            "ar": "ادع لمن أساء إليك بالهداية والمغفرة بدلاً من اللعن أو الدعاء عليه. هذا يطهر قلبك ويعزز التسامح.",
            "en": "Pray for guidance and forgiveness for the wrongdoer instead of cursing or praying against them. This purifies your heart and fosters tolerance."
          },
          "tips": {
            "ar": "قل: 'اللهم اهده واغفر له' لتخفيف الحقد في قلبك.",
            "en": "Say: ‘Allahumma ihdi wa ighfir lah’ to ease resentment in your heart."
          }
        },
        {
          "title": {
            "ar": "التعبير عن العفو",
            "en": "Expressing Forgiveness"
          },
          "description": {
            "ar": "إذا أمكن، عبر عن عفوك للشخص الذي أساء إليك، سواء بالكلام أو الفعل، لإصلاح العلاقة ونشر المحبة.",
            "en": "If possible, express your forgiveness to the wrongdoer through words or actions to mend the relationship and spread love."
          },
          "tips": {
            "ar": "ابدأ بكلمات بسيطة مثل 'سامحتك' لتسهيل المصالحة.",
            "en": "Start with simple words like ‘I forgive you’ to facilitate reconciliation."
          }
        }
      ],
      "additional_info": {
        "ar": "العفو من صفات المؤمنين الكرام، وهو سبب لدخول الجنة ومغفرة الذنوب. ورد في الحديث أن من عفا عفا الله عنه.",
        "en": "Forgiveness is a trait of noble believers and a means to enter paradise and have sins forgiven. Hadith states that whoever forgives, Allah forgives them."
      },
      "common_mistakes": {
        "ar": "الاحتفاظ بالحقد، رفض التسامح خوفاً من الضعف، أو انتظار اعتذار الآخرين أولاً.",
        "en": "Holding grudges, refusing to forgive out of fear of appearing weak, or waiting for an apology first."
      }
    },
    {
      "id": "sadaqah-jariyah",
      "title": {
        "ar": "كيفية إعطاء الصدقة الجارية",
        "en": "How to Give Sadaqah Jariyah (Ongoing Charity)"
      },
      "category": {
        "ar": "العبادات المالية",
        "en": "Financial Worship"
      },
      "description": {
        "ar": "دليل مفصل لإعطاء الصدقة الجارية التي تستمر أجرها بعد الموت وفق السنة النبوية، مع توضيح أنواعها وفضلها",
        "en": "Detailed guide for giving ongoing charity that continues to earn rewards after death according to the Prophetic tradition, including its types and virtues"
      },
      "icon": "fas fa-seedling",
      "steps": [
        {
          "title": {
            "ar": "اختيار نوع الصدقة الجارية",
            "en": "Choosing the Type of Ongoing Charity"
          },
          "description": {
            "ar": "اختر صدقة تستمر نفعها، مثل بناء مسجد، حفر بئر، نشر العلم، أو إنشاء وقف خيري. تأكد أن المشروع يفيد الناس على المدى الطويل.",
            "en": "Choose a charity with lasting benefit, such as building a mosque, digging a well, spreading knowledge, or establishing a charitable endowment. Ensure the project benefits people long-term."
          },
          "tips": {
            "ar": "ابحث عن مشاريع موثوقة عبر منظمات خيرية ذات سمعة جيدة.",
            "en": "Research reliable projects through reputable charitable organizations."
          }
        },
        {
          "title": {
            "ar": "النية الخالصة",
            "en": "Sincere Intention"
          },
          "description": {
            "ar": "اعقد النية في قلبك أن الصدقة لله تعالى فقط، طلباً للأجر الدائم. تجنب الرياء أو السعي وراء الشهرة.",
            "en": "Intend in your heart that the charity is solely for Allah, seeking continuous reward. Avoid showing off or seeking fame."
          },
          "tips": {
            "ar": "ذكّر نفسك بأن الأجر يستمر حتى بعد الموت إذا كانت النية خالصة.",
            "en": "Remind yourself that the reward continues after death if the intention is sincere."
          }
        },
        {
          "title": {
            "ar": "اختيار المستفيدين",
            "en": "Selecting Beneficiaries"
          },
          "description": {
            "ar": "وجه الصدقة الجارية لمن هم في حاجة، مثل الفقراء، أو لمشاريع تخدم المجتمع الإسلامي، كدعم المدارس الدينية أو المستشفيات.",
            "en": "Direct ongoing charity to those in need, such as the poor, or to projects serving the Muslim community, like supporting religious schools or hospitals."
          },
          "tips": {
            "ar": "تحقق من أن المشروع سيستمر في تقديم الفائدة لأطول فترة ممكنة.",
            "en": "Ensure the project will provide benefits for as long as possible."
          }
        },
        {
          "title": {
            "ar": "المتابعة والصيانة",
            "en": "Follow-Up and Maintenance"
          },
          "description": {
            "ar": "تابع مشروع الصدقة الجارية للتأكد من استمراريته، مثل صيانة البئر أو تحديث الكتب في مكتبة. هذا يضمن استمرار الأجر.",
            "en": "Follow up on the charity project to ensure its continuity, such as maintaining a well or updating books in a library. This ensures ongoing reward."
          },
          "tips": {
            "ar": "خصص جزءاً من وقتك أو مالك لدعم استمرار المشروع إذا أمكن.",
            "en": "Allocate time or funds to support the project’s continuity if possible."
          }
        }
      ],
      "additional_info": {
        "ar": "الصدقة الجارية من أفضل الأعمال، وورد في الحديث أنها من الأعمال التي يستمر أجرها بعد الموت. هي استثمار للآخرة.",
        "en": "Sadaqah Jariyah is one of the best deeds, and Hadith states its reward continues after death. It is an investment for the hereafter."
      },
      "common_mistakes": {
        "ar": "إهمال متابعة المشروع، إعطاء الصدقة بنية الرياء، أو اختيار مشاريع غير مستدامة.",
        "en": "Neglecting project follow-up, giving charity to show off, or choosing unsustainable projects."
      }
    },
    {
      "id": "zakat-al-fitr",
      "title": {
        "ar": "كيفية إخراج زكاة الفطر",
        "en": "How to Pay Zakat al-Fitr"
      },
      "category": {
        "ar": "العبادات المالية",
        "en": "Financial Worship"
      },
      "description": {
        "ar": "دليل مفصل لإخراج زكاة الفطر في نهاية رمضان وفق السنة النبوية، مع توضيح مقدارها ووقتها",
        "en": "Detailed guide for paying Zakat al-Fitr at the end of Ramadan according to the Prophetic tradition, including its amount and timing"
      },
      "icon": "fas fa-wheat-awn",
      "steps": [
        {
          "title": {
            "ar": "معرفة المقدار",
            "en": "Determining the Amount"
          },
          "description": {
            "ar": "زكاة الفطر هي صاع (حوالي 2.5-3 كجم) من الطعام الشائع مثل القمح، الشعير، التمر، أو الأرز، أو ما يعادله نقداً حسب القيمة المحلية.",
            "en": "Zakat al-Fitr is one Sa’ (about 2.5-3 kg) of common food like wheat, barley, dates, or rice, or its equivalent in cash based on local value."
          },
          "tips": {
            "ar": "استشر عالم دين أو منظمة موثوقة لتحديد القيمة النقدية إذا اخترت دفعها نقداً.",
            "en": "Consult a scholar or trusted organization to determine the cash equivalent if paying in money."
          }
        },
        {
          "title": {
            "ar": "تحديد الوقت",
            "en": "Determining the Timing"
          },
          "description": {
            "ar": "أخرج زكاة الفطر قبل صلاة عيد الفطر، ويستحب إخراجها في آخر يومين من رمضان. لا تؤخرها بعد الصلاة إلا لعذر.",
            "en": "Pay Zakat al-Fitr before the Eid al-Fitr prayer, preferably in the last two days of Ramadan. Do not delay it after the prayer unless excused."
          },
          "tips": {
            "ar": "اضبط تذكيراً في آخر أيام رمضان لضمان إخراجها في الوقت المناسب.",
            "en": "Set a reminder in the last days of Ramadan to ensure timely payment."
          }
        },
        {
          "title": {
            "ar": "اختيار المستحقين",
            "en": "Selecting Recipients"
          },
          "description": {
            "ar": "وجه زكاة الفطر للفقراء والمساكين، ويفضل إعطاؤها مباشرة لهم أو عبر منظمات خيرية موثوقة لتصل إلى المحتاجين.",
            "en": "Direct Zakat al-Fitr to the poor and needy, preferably giving it directly or through trusted charitable organizations to reach those in need."
          },
          "tips": {
            "ar": "ابحث عن الأسر المحتاجة في منطقتك لضمان وصول الزكاة لهم قبل العيد.",
            "en": "Look for needy families in your area to ensure Zakat reaches them before Eid."
          }
        },
        {
          "title": {
            "ar": "النية عند الإخراج",
            "en": "Making the Intention"
          },
          "description": {
            "ar": "اعقد النية في قلبك أن هذه زكاة الفطر واجبة عنك وعن من تعولهم. النية شرط لقبول العبادة.",
            "en": "Intend in your heart that this is obligatory Zakat al-Fitr for yourself and those you support. Intention is a condition for acceptance."
          },
          "tips": {
            "ar": "إذا كنت تدفع عن أفراد عائلتك، اذكر أسماءهم في نيتك لضمان الوضوح.",
            "en": "If paying for family members, mention their names in your intention for clarity."
          }
        }
      ],
      "additional_info": {
        "ar": "زكاة الفطر واجبة على كل مسلم قادر، وهي تطهر الصائم من اللغو والرفث، وتفرح الفقراء يوم العيد.",
        "en": "Zakat al-Fitr is obligatory for every capable Muslim, purifying the fasting person from idle talk and ensuring joy for the poor on Eid."
      },
      "common_mistakes": {
        "ar": "تأخير إخراج زكاة الفطر بعد صلاة العيد، دفع كمية أقل من المطلوب، أو عدم التأكد من وصولها للمستحقين.",
        "en": "Delaying Zakat al-Fitr after the Eid prayer, paying less than required, or not ensuring it reaches eligible recipients."
      }
    },
    {
      "id": "udhiyah",
      "title": {
        "ar": "كيفية أداء الأضحية",
        "en": "How to Perform Udhiyah (Qurbani)"
      },
      "category": {
        "ar": "العبادات المالية",
        "en": "Financial Worship"
      },
      "description": {
        "ar": "دليل مفصل لأداء الأضحية في عيد الأضحى وفق السنة النبوية، مع توضيح شروطها وتوزيعها",
        "en": "Detailed guide for performing the sacrificial offering during Eid al-Adha according to the Prophetic tradition, including its conditions and distribution"
      },
      "icon": "fas fa-sheep",
      "steps": [
        {
          "title": {
            "ar": "التأكد من القدرة المالية",
            "en": "Confirming Financial Ability"
          },
          "description": {
            "ar": "تأكد أنك قادر مالياً على أداء الأضحية دون أن تؤثر على احتياجاتك الأساسية. الأضحية سنة مؤكدة للقادرين.",
            "en": "Ensure you can afford the Udhiyah without compromising your basic needs. It is a highly recommended Sunnah for those able."
          },
          "tips": {
            "ar": "خطط ميزانيتك مبكراً لتخصيص مبلغ للأضحية قبل عيد الأضحى.",
            "en": "Plan your budget early to allocate funds for Udhiyah before Eid al-Adha."
          }
        },
        {
          "title": {
            "ar": "اختيار الحيوان",
            "en": "Selecting the Animal"
          },
          "description": {
            "ar": "اختر حيواناً مناسباً (خروف، بقرة، أو جمل) يستوفي شروط العمر والسلامة من العيوب. يجب أن يكون الحيوان خالياً من العور أو المرض.",
            "en": "Choose a suitable animal (sheep, cow, or camel) that meets age and health requirements. It must be free from defects like blindness or illness."
          },
          "tips": {
            "ar": "اشترِ الحيوان من مصدر موثوق لضمان مطابقته للشروط الشرعية.",
            "en": "Buy the animal from a trusted source to ensure it meets Sharia requirements."
          }
        },
        {
          "title": {
            "ar": "الذبح وفق السنة",
            "en": "Slaughtering According to Sunnah"
          },
          "description": {
            "ar": "اذبح الحيوان بعد صلاة عيد الأضحى وقبل غروب شمس اليوم الثالث من أيام التشريق، مع النية أنها أضحية لله. يستحب ذكر اسم الله أثناء الذبح.",
            "en": "Slaughter the animal after the Eid al-Adha prayer and before sunset on the third day of Tashriq, with the intention of it being a sacrifice for Allah. It’s recommended to mention Allah’s name during slaughter."
          },
          "tips": {
            "ar": "إذا لم تستطع الذبح بنفسك، فوكل شخصاً متمرساً أو منظمة موثوقة.",
            "en": "If you can’t slaughter yourself, delegate to a skilled person or trusted organization."
          }
        },
        {
          "title": {
            "ar": "توزيع اللحم",
            "en": "Distributing the Meat"
          },
          "description": {
            "ar": "قسم اللحم إلى ثلاثة أجزاء: ثلث للأهل، ثلث للفقراء، وثلث للهدية أو الصدقة. يجب أن يصل اللحم إلى الفقراء والمساكين.",
            "en": "Divide the meat into three parts: one-third for your family, one-third for the poor, and one-third as a gift or charity. Ensure the meat reaches the poor and needy."
          },
          "tips": {
            "ar": "حدد الأسر المحتاجة مسبقاً لتسهيل التوزيع بعد الذبح.",
            "en": "Identify needy families in advance to facilitate distribution after slaughter."
          }
        }
      ],
      "additional_info": {
        "ar": "الأضحية سنة مؤكدة، وهي تذكير بقصة إبراهيم وإسماعيل عليهما السلام. تعزز التضحية التكافل الاجتماعي وتفرح الفقراء.",
        "en": "Udhiyah is a confirmed Sunnah, reminding us of the story of Ibrahim and Ismail (peace be upon them). It promotes social solidarity and brings joy to the poor."
      },
      "common_mistakes": {
        "ar": "اختيار حيوان معيب، تأخير الذبح بعد أيام التشريق، أو عدم توزيع اللحم على الفقراء.",
        "en": "Choosing a defective animal, delaying slaughter beyond Tashriq days, or not distributing meat to the poor."
      }
    },
    {
      "id": "paying-debts",
      "title": {
        "ar": "كيفية سداد الديون",
        "en": "How to Pay Off Debts"
      },
      "category": {
        "ar": "العبادات المالية",
        "en": "Financial Worship"
      },
      "description": {
        "ar": "دليل مفصل لسداد الديون بنية الوفاء بالتزاماتك وفق السنة النبوية، مع توضيح أهميتها",
        "en": "Detailed guide for paying off debts with the intention of fulfilling obligations according to the Prophetic tradition, including its importance"
      },
      "icon": "fas fa-hand-holding-usd",
      "steps": [
        {
          "title": {
            "ar": "حصر الديون",
            "en": "Listing Debts"
          },
          "description": {
            "ar": "دوّن جميع ديونك مع أسماء الدائنين والمبالغ المستحقة. حدد أولويات السداد بناءً على الحاجة أو المدة.",
            "en": "List all your debts with the names of creditors and amounts owed. Prioritize repayment based on urgency or duration."
          },
          "tips": {
            "ar": "استخدم جدولاً أو تطبيقاً لتتبع الديون وتجنب النسيان.",
            "en": "Use a spreadsheet or app to track debts and avoid forgetting."
          }
        },
        {
          "title": {
            "ar": "وضع خطة السداد",
            "en": "Creating a Repayment Plan"
          },
          "description": {
            "ar": "خصص جزءاً من دخلك الشهري لسداد الديون، بدءاً بالديون ذات الفوائد (إن وجدت) أو الأقدم. تواصل مع الدائنين للتفاوض إذا لزم الأمر.",
            "en": "Allocate a portion of your monthly income to debt repayment, starting with interest-bearing debts (if any) or the oldest. Communicate with creditors to negotiate if needed."
          },
          "tips": {
            "ar": "ابدأ بالديون الصغيرة لتخفيف الضغط النفسي، ثم انتقل للأكبر.",
            "en": "Start with smaller debts to reduce psychological stress, then move to larger ones."
          }
        },
        {
          "title": {
            "ar": "الدعاء لتيسير السداد",
            "en": "Praying for Ease in Repayment"
          },
          "description": {
            "ar": "ادع الله لييسر لك سداد الديون، مثل: 'اللهم اكفني بحلالك عن حرامك، وأغنني بفضلك عمن سواك'. الدعاء يعين على الرزق والتيسير.",
            "en": "Pray to Allah to ease debt repayment, such as: ‘Allahumma ikfini bi halalika ‘an haramik, wa aghnini bi fadlika ‘amman siwak.’ Prayer aids in provision and ease."
          },
          "tips": {
            "ar": "أكثر من الاستغفار، فهو يجلب الرزق ويخفف الهم، كما ورد في الحديث.",
            "en": "Increase seeking forgiveness, as it brings provision and relieves worry, per Hadith."
          }
        },
        {
          "title": {
            "ar": "الوفاء بالتزاماتك",
            "en": "Fulfilling Your Obligations"
          },
          "description": {
            "ar": "سدد الديون في مواعيدها بنية الوفاء بالأمانة. إذا تأخرت، اعتذر للدائن وأخبره بخطتك للسداد للحفاظ على الثقة.",
            "en": "Pay debts on time with the intention of fulfilling your trust. If delayed, apologize to the creditor and inform them of your repayment plan to maintain trust."
          },
          "tips": {
            "ar": "تواصل بصراحة مع الدائن لتجنب سوء الفهم أو الخلافات.",
            "en": "Communicate honestly with the creditor to avoid misunderstandings or disputes."
          }
        }
      ],
      "additional_info": {
        "ar": "سداد الديون واجب شرعي وأخلاقي، وورد في الحديث أن الدين هم بالليل وذل بالنهار. الوفاء بالدين يحفظ الأمانة ويزيد البركة.",
        "en": "Paying debts is a religious and ethical obligation. Hadith states that debt is a worry at night and humiliation by day. Fulfilling debts preserves trust and increases blessings."
      },
      "common_mistakes": {
        "ar": "إهمال تسجيل الديون، تأخير السداد دون عذر، أو اقتراض ما لا يمكن سداده.",
        "en": "Neglecting to record debts, delaying repayment without excuse, or borrowing beyond repayment capacity."
      }
    },
    {
      "id": "avoiding-riba",
      "title": {
        "ar": "كيفية تجنب الربا",
        "en": "How to Avoid Riba (Usury)"
      },
      "category": {
        "ar": "العبادات المالية",
        "en": "Financial Worship"
      },
      "description": {
        "ar": "دليل مفصل لتجنب الربا في المعاملات المالية وفق السنة النبوية، مع توضيح أنواعه وأضراره",
        "en": "Detailed guide for avoiding usury in financial transactions according to the Prophetic tradition, including its types and harms"
      },
      "icon": "fas fa-ban",
      "steps": [
        {
          "title": {
            "ar": "فهم أنواع الربا",
            "en": "Understanding Types of Riba"
          },
          "description": {
            "ar": "تعرف على الربا النسيئة (الفائدة على القروض) والربا الفضل (الزيادة في المبادلة بين السلع المحددة). الربا محرم في القرآن والسنة.",
            "en": "Learn about Riba an-Nasi’ah (interest on loans) and Riba al-Fadl (excess in exchanging specific commodities). Riba is prohibited in the Quran and Sunnah."
          },
          "tips": {
            "ar": "استشر عالم دين لفهم المعاملات التي قد تحتوي على ربا خفي.",
            "en": "Consult a scholar to understand transactions that may involve hidden riba."
          }
        },
        {
          "title": {
            "ar": "اختيار معاملات حلال",
            "en": "Choosing Halal Transactions"
          },
          "description": {
            "ar": "استخدم معاملات مالية إسلامية مثل المرابحة، المشاركة، أو الإجارة. تجنب القروض الربوية والبطاقات الائتمانية ذات الفوائد.",
            "en": "Use Islamic financial transactions like Murabaha, Musharaka, or Ijara. Avoid interest-based loans and credit cards with interest."
          },
          "tips": {
            "ar": "ابحث عن بنوك إسلامية أو مؤسسات مالية تقدم خيارات خالية من الربا.",
            "en": "Seek Islamic banks or financial institutions offering riba-free options."
          }
        },
        {
          "title": {
            "ar": "تجنب التعامل مع البنوك الربوية",
            "en": "Avoiding Interest-Based Banks"
          },
          "description": {
            "ar": "افتح حسابات في بنوك إسلامية، وتجنب الاستثمارات أو الحسابات التي تدر فوائد ربوية. تأكد من أن أموالك في حسابات خالية من الربا.",
            "en": "Open accounts with Islamic banks and avoid investments or accounts yielding interest. Ensure your funds are in riba-free accounts."
          },
          "tips": {
            "ar": "راجع شروط الحسابات البنكية للتأكد من خلوها من الفوائد.",
            "en": "Review bank account terms to ensure they are free of interest."
          }
        },
        {
          "title": {
            "ar": "التوبة إذا وقعت في الربا",
            "en": "Repenting if Involved in Riba"
          },
          "description": {
            "ar": "إذا وقعت في الربا، توب إلى الله بالندم، الإقلاع، والعزم على عدم العودة. تصدق بالمال الربوي إذا كان بحوزتك ولا تستفد منه.",
            "en": "If you engage in riba, repent to Allah with regret, cessation, and resolve not to return. Give away any usurious gains as charity without benefiting from them."
          },
          "tips": {
            "ar": "ادع الله بالمغفرة واستبدل المعاملات الربوية ببدائل حلال فوراً.",
            "en": "Pray for Allah’s forgiveness and replace riba-based transactions with halal alternatives immediately."
          }
        }
      ],
      "additional_info": {
        "ar": "الربا محرم بإجماع، وهو من الكبائر. ورد في الحديث لعن آكل الربا وموكله. تجنبه يحفظ المال ويجلب البركة.",
        "en": "Riba is unanimously prohibited and a major sin. Hadith curses the one who consumes or facilitates riba. Avoiding it protects wealth and brings blessings."
      },
      "common_mistakes": {
        "ar": "التساهل في التعامل مع الفوائد البنكية، عدم البحث عن بدائل إسلامية، أو الاحتفاظ بمال الربا.",
        "en": "Being lax with bank interest, not seeking Islamic alternatives, or retaining usurious gains."
      }
    },
    {
      "id": "spending-for-allah",
      "title": {
        "ar": "كيفية الإنفاق في سبيل الله",
        "en": "How to Spend in the Way of Allah"
      },
      "category": {
        "ar": "العبادات المالية",
        "en": "Financial Worship"
      },
      "description": {
        "ar": "دليل مفصل للإنفاق في سبيل الله بنية التقرب إليه وفق السنة النبوية، مع توضيح أهميته",
        "en": "Detailed guide for spending in the way of Allah with the intention of drawing closer to Him according to the Prophetic tradition, including its importance"
      },
      "icon": "fas fa-donate",
      "steps": [
        {
          "title": {
            "ar": "النية للتقرب إلى الله",
            "en": "Intention to Draw Closer to Allah"
          },
          "description": {
            "ar": "اعقد النية أن إنفاقك في سبيل الله، سواء لدعم الجهاد، المساجد، أو المحتاجين، هو لنيل رضاه وثوابه.",
            "en": "Intend that your spending in the way of Allah, whether for jihad, mosques, or the needy, is to seek His pleasure and reward."
          },
          "tips": {
            "ar": "ذكّر نفسك أن الله يضاعف أجر من ينفق في سبيله، كما ورد في القرآن.",
            "en": "Remind yourself that Allah multiplies the reward of those who spend in His way, as stated in the Quran."
          }
        },
        {
          "title": {
            "ar": "اختيار المجالات المناسبة",
            "en": "Choosing Appropriate Causes"
          },
          "description": {
            "ar": "وجه إنفاقك لمشاريع تخدم الإسلام والمسلمين، مثل دعم الدعوة، بناء المدارس الدينية، أو مساعدة المحتاجين في بلاد الإسلام.",
            "en": "Direct your spending to projects serving Islam and Muslims, such as supporting dawah, building religious schools, or aiding the needy in Muslim lands."
          },
          "tips": {
            "ar": "ابحث عن منظمات خيرية موثوقة لضمان وصول تبرعاتك للمستحقين.",
            "en": "Research trusted charities to ensure your donations reach the intended recipients."
          }
        },
        {
          "title": {
            "ar": "الإنفاق من الحلال",
            "en": "Spending from Lawful Earnings"
          },
          "description": {
            "ar": "تأكد أن المال الذي تنفقه من مصدر حلال. الإنفاق من مال حرام لا يُقبل، كما ورد في الحديث.",
            "en": "Ensure the money you spend is from a lawful source. Spending from unlawful money is not accepted, as per Hadith."
          },
          "tips": {
            "ar": "راجع مصادر دخلك للتأكد من خلوها من الربا أو الحرام.",
            "en": "Review your income sources to ensure they are free from riba or haram."
          }
        },
        {
          "title": {
            "ar": "التوازن في الإنفاق",
            "en": "Balancing Spending"
          },
          "description": {
            "ar": "أنفق باعتدال دون إسراف أو تقتير، مع مراعاة احتياجات أسرتك. يستحب الإنفاق مما تحب لنيل أجر أعلى.",
            "en": "Spend moderately without extravagance or stinginess, while considering your family’s needs. It’s recommended to spend from what you love for greater reward."
          },
          "tips": {
            "ar": "خصص ميزانية شهرية للإنفاق في سبيل الله لتجنب الإجهاد المالي.",
            "en": "Allocate a monthly budget for spending in Allah’s way to avoid financial strain."
          }
        }
      ],
      "additional_info": {
        "ar": "الإنفاق في سبيل الله من أعظم القربات، وورد في القرآن أن الله يضاعف أجر المنفقين. يعزز التكافل ويدعم الأمة.",
        "en": "Spending in the way of Allah is one of the greatest acts of worship, and the Quran states that Allah multiplies the reward of those who spend. It promotes solidarity and supports the Ummah."
      },
      "common_mistakes": {
        "ar": "الإنفاق بنية الرياء، استخدام مال حرام، أو الإسراف على حساب احتياجات الأسرة.",
        "en": "Spending to show off, using unlawful money, or overspending at the expense of family needs."
      }
    },
    {
      "id": "waqf",
      "title": {
        "ar": "كيفية إنشاء الوقف الخيري",
        "en": "How to Establish a Charitable Waqf (Endowment)"
      },
      "category": {
        "ar": "العبادات المالية",
        "en": "Financial Worship"
      },
      "description": {
        "ar": "دليل مفصل لإنشاء وقف خيري يستمر نفعه وفق السنة النبوية، مع توضيح شروطه وفوائده",
        "en": "Detailed guide for establishing a charitable endowment with lasting benefits according to the Prophetic tradition, including its conditions and benefits"
      },
      "icon": "fas fa-building",
      "steps": [
        {
          "title": {
            "ar": "تحديد نوع الوقف",
            "en": "Determining the Type of Waqf"
          },
          "description": {
            "ar": "اختر نوع الوقف، مثل وقف مالي (تبرع مالي دائم)، عقاري (أرض أو مبنى)، أو علمي (دعم التعليم). تأكد أن الوقف يخدم هدفاً خيرياً.",
            "en": "Choose the type of Waqf, such as financial (ongoing monetary donation), real estate (land or building), or educational (supporting education). Ensure it serves a charitable purpose."
          },
          "tips": {
            "ar": "استشر عالم دين لتحديد نوع الوقف المناسب لقدراتك.",
            "en": "Consult a scholar to determine the Waqf type suitable for your capacity."
          }
        },
        {
          "title": {
            "ar": "النية الخالصة",
            "en": "Sincere Intention"
          },
          "description": {
            "ar": "اعقد النية أن الوقف لله تعالى فقط، طلباً للأجر الدائم. تجنب النية لغرض الشهرة أو المصلحة الشخصية.",
            "en": "Intend that the Waqf is solely for Allah, seeking continuous reward. Avoid intentions for fame or personal gain."
          },
          "tips": {
            "ar": "ذكّر نفسك بأن الوقف يستمر أجره حتى بعد الموت، كما ورد في الحديث.",
            "en": "Remind yourself that Waqf’s reward continues after death, as per Hadith."
          }
        },
        {
          "title": {
            "ar": "توثيق الوقف",
            "en": "Documenting the Waqf"
          },
          "description": {
            "ar": "وثّق الوقف رسمياً عبر جهة قانونية أو دينية لضمان استمراريته ومنع التلاعب. حدد شروط الوقف، مثل المستفيدين وطريقة الإدارة.",
            "en": "Document the Waqf officially through a legal or religious authority to ensure its continuity and prevent misuse. Specify conditions, such as beneficiaries and management."
          },
          "tips": {
            "ar": "استعن بمحامٍ مختص في الأوقاف الإسلامية لضمان التوثيق الصحيح.",
            "en": "Seek a lawyer specialized in Islamic endowments for proper documentation."
          }
        },
        {
          "title": {
            "ar": "إدارة الوقف",
            "en": "Managing the Waqf"
          },
          "description": {
            "ar": "عيّن شخصاً أو مؤسسة موثوقة لإدارة الوقف والإشراف على توزيع أرباحه أو منافعه للمستحقين. تابع أداء الوقف دورياً.",
            "en": "Appoint a trusted person or organization to manage the Waqf and oversee the distribution of its profits or benefits to recipients. Monitor its performance periodically."
          },
          "tips": {
            "ar": "اختر مديراً أميناً ذا خبرة لضمان استدامة الوقف.",
            "en": "Choose a trustworthy, experienced manager to ensure the Waqf’s sustainability."
          }
        }
      ],
      "additional_info": {
        "ar": "الوقف الخيري من أعظم أنواع الصدقة الجارية، وورد في الحديث أن أجره يستمر بعد الموت. يدعم المجتمع ويعزز التكافل.",
        "en": "Charitable Waqf is one of the greatest forms of ongoing charity, and Hadith states its reward continues after death. It supports society and promotes solidarity."
      },
      "common_mistakes": {
        "ar": "عدم توثيق الوقف رسمياً، اختيار مدير غير مؤهل، أو إهمال متابعة أداء الوقف.",
        "en": "Not documenting the Waqf officially, choosing an unqualified manager, or neglecting to monitor the Waqf’s performance."
      }
    },

  {
      "id": "salat-al-janazah",
      "title": {
        "ar": "كيفية أداء صلاة الجنازة",
        "en": "How to Perform Salat al-Janazah (Funeral Prayer)"
      },
      "category": {
        "ar": "الجنائز",
        "en": "Funerals"
      },
      "description": {
        "ar": "دليل مفصل لأداء صلاة الجنازة وفق السنة النبوية، مع توضيح خطواتها وأهميتها",
        "en": "Detailed guide for performing the funeral prayer according to the Prophetic tradition, including its steps and importance"
      },
      "icon": "fas fa-pray",
      "steps": [
        {
          "title": {
            "ar": "النية للصلاة",
            "en": "Making the Intention"
          },
          "description": {
            "ar": "اعقد النية في قلبك لأداء صلاة الجنازة على الميت، مثل: 'نويت أن أصلي صلاة الجنازة لفلان'. النية شرط أساسي.",
            "en": "Intend in your heart to perform the funeral prayer for the deceased, e.g., 'I intend to pray Salat al-Janazah for [name].' Intention is essential."
          },
          "tips": {
            "ar": "اذكر اسم المتوفى في نيتك إن أمكن لتوضيح النية.",
            "en": "Mention the deceased’s name in your intention if possible for clarity."
          }
        },
        {
          "title": {
            "ar": "الوقوف للصلاة",
            "en": "Standing for the Prayer"
          },
          "description": {
            "ar": "قف في اتجاه القبلة، مع وجود جثمان الميت أمام المصلين. الصلاة تؤدى واقفاً بدون ركوع أو سجود، وتتكون من أربع تكبيرات.",
            "en": "Stand facing the Qiblah with the deceased’s body in front of the worshippers. The prayer is performed standing without bowing or prostrating, consisting of four Takbirs."
          },
          "tips": {
            "ar": "تأكد من الوقوف في صفوف منظمة خلف الإمام.",
            "en": "Ensure you stand in organized rows behind the Imam."
          }
        },
        {
          "title": {
            "ar": "أداء التكبيرات الأربع",
            "en": "Performing the Four Takbirs"
          },
          "description": {
            "ar": "قل 'الله أكبر' أربع مرات، مع أدعية محددة بعد كل تكبيرة: الأولى الفاتحة، الثانية الصلاة على النبي، الثالثة دعاء للميت، والرابعة دعاء عام. ثم سلم.",
            "en": "Say 'Allahu Akbar' four times, with specific supplications after each: the first for Al-Fatihah, the second for Salat upon the Prophet, the third for the deceased, and the fourth for a general dua. Then conclude."
          },
          "tips": {
            "ar": "احفظ الأدعية القصيرة لتسهيل الأداء، مثل دعاء 'اللهم اغفر لحينا وميتنا'.",
            "en": "Memorize short supplications, like 'Allahumma ighfir li hayyina wa mayyitina,' for ease."
          }
        },
        {
          "title": {
            "ar": "الدعاء للميت",
            "en": "Supplicating for the Deceased"
          },
          "description": {
            "ar": "ادع للميت بالمغفرة والرحمة والثبات عند السؤال. يستحب الدعاء بإخلاص وبصوت منخفض بعد التكبيرة الثالثة.",
            "en": "Pray for the deceased’s forgiveness, mercy, and steadfastness during questioning. It’s recommended to supplicate sincerely and quietly after the third Takbir."
          },
          "tips": {
            "ar": "استخدم الأدعية المأثورة من السنة لضمان القبول.",
            "en": "Use authentic supplications from the Sunnah to ensure acceptance."
          }
        }
      ],
      "additional_info": {
        "ar": "صلاة الجنازة فرض كفاية، وهي عبادة عظيمة تشفع للميت. ورد في الحديث أن صلاة أربعين رجلاً على الميت تشفع له.",
        "en": "Salat al-Janazah is a communal obligation and a great act of worship that intercedes for the deceased. Hadith states that the prayer of forty people intercedes for them."
      },
      "common_mistakes": {
        "ar": "أداء الصلاة جالساً، إهمال الأدعية المأثورة، أو التحدث أثناء الصلاة.",
        "en": "Performing the prayer seated, neglecting authentic supplications, or talking during the prayer."
      }
    },
    {
      "id": "ghusl-deceased",
      "title": {
        "ar": "كيفية غسل الميت",
        "en": "How to Wash the Deceased (Ghusl)"
      },
      "category": {
        "ar": "الجنائز",
        "en": "Funerals"
      },
      "description": {
        "ar": "دليل مفصل لغسل الميت وفق السنة النبوية، مع توضيح الخطوات والشروط",
        "en": "Detailed guide for washing the deceased according to the Prophetic tradition, including steps and conditions"
      },
      "icon": "fas fa-tint",
      "steps": [
        {
          "title": {
            "ar": "الاستعداد لغسل الميت",
            "en": "Preparing to Wash the Deceased"
          },
          "description": {
            "ar": "جهز مكاناً نظيفاً وخاصاً، واجمع الأدوات (ماء، صابون، سدر، كافور). يجب أن يكون الغاسل من نفس جنس الميت إلا في حالات استثنائية.",
            "en": "Prepare a clean, private place and gather supplies (water, soap, sidr, camphor). The washer should be of the same gender as the deceased unless an exception applies."
          },
          "tips": {
            "ar": "ارتدِ قفازات للحفاظ على النظافة والاحترام.",
            "en": "Wear gloves to maintain hygiene and respect."
          }
        },
        {
          "title": {
            "ar": "تغطية العورة",
            "en": "Covering the Private Parts"
          },
          "description": {
            "ar": "غطّ عورة الميت (من السرة إلى الركبة) بقماش نظيف طوال الغسل للحفاظ على كرامته. تجنب النظر إلى العورة.",
            "en": "Cover the deceased’s private parts (from navel to knees) with a clean cloth throughout the washing to preserve dignity. Avoid looking at the private parts."
          },
          "tips": {
            "ar": "استخدم قماشاً كبيراً لتسهيل تغطية الجسم بالكامل.",
            "en": "Use a large cloth to easily cover the entire body."
          }
        },
        {
          "title": {
            "ar": "أداء الغسل",
            "en": "Performing the Washing"
          },
          "description": {
            "ar": "اغسل الميت ثلاث مرات أو خمس بماء وسدر، وأضف الكافور في الغسلة الأخيرة. ابدأ بالأعضاء اليمنى، ثم اغسل الرأس، ثم باقي الجسم.",
            "en": "Wash the deceased three or five times with water and sidr, adding camphor in the final wash. Start with the right side, then the head, then the rest of the body."
          },
          "tips": {
            "ar": "اضغط برفق على البطن لإخراج أي فضلات قبل الغسل.",
            "en": "Gently press the abdomen to release any waste before washing."
          }
        },
        {
          "title": {
            "ar": "النية والدعاء",
            "en": "Intention and Supplication"
          },
          "description": {
            "ar": "اعقد النية لغسل الميت طلباً لرضا الله، وادع له بالمغفرة والرحمة أثناء الغسل. يستحب الإخلاص والتركيز أثناء العملية.",
            "en": "Intend to wash the deceased for Allah’s pleasure, and pray for their forgiveness and mercy during washing. Sincerity and focus are recommended."
          },
          "tips": {
            "ar": "ردد أدعية بسيطة مثل 'اللهم اغفر له وارحمه' أثناء الغسل.",
            "en": "Recite simple supplications like 'Allahumma ighfir lahu warhamhu' during washing."
          }
        }
      ],
      "additional_info": {
        "ar": "غسل الميت فرض كفاية، وهو من أعمال الرحمة التي تجلب الأجر العظيم. يجب أداؤه بحرمة وإخلاص.",
        "en": "Washing the deceased is a communal obligation and a merciful act with great reward. It must be performed with sanctity and sincerity."
      },
      "common_mistakes": {
        "ar": "عدم تغطية العورة، استخدام ماء قليل، أو الغسل بدون نية.",
        "en": "Not covering the private parts, using insufficient water, or washing without intention."
      }
    },
    {
      "id": "kafan",
      "title": {
        "ar": "كيفية تكفين الميت",
        "en": "How to Shroud the Deceased (Kafan)"
      },
      "category": {
        "ar": "الجنائز",
        "en": "Funerals"
      },
      "description": {
        "ar": "دليل مفصل لتكفين الميت وفق السنة النبوية، مع توضيح الخطوات والشروط",
        "en": "Detailed guide for shrouding the deceased according to the Prophetic tradition, including steps and conditions"
      },
      "icon": "fas fa-cloth",
      "steps": [
        {
          "title": {
            "ar": "اختيار الكفن",
            "en": "Choosing the Shroud"
          },
          "description": {
            "ar": "اختر قماشاً أبيض نظيفاً وبسيطاً للكفن. للرجل ثلاث لفائف، وللمرأة خمس (إزار، خمار، مقنعة، ولفافتين). يجب أن يكون الكفن من مال حلال.",
            "en": "Choose clean, simple white cloth for the shroud. For a man, use three layers; for a woman, five (waist wrap, headscarf, veil, and two outer wraps). The shroud must be from lawful money."
          },
          "tips": {
            "ar": "تجنب الكفن الفاخر أو المكلف، فالبساطة مستحبة.",
            "en": "Avoid luxurious or expensive shrouds, as simplicity is recommended."
          }
        },
        {
          "title": {
            "ar": "تحضير الجسم",
            "en": "Preparing the Body"
          },
          "description": {
            "ar": "ضع الجسم على الكفن بعد الغسل، مع تغطية العورة. رتب اللفائف بحيث تغطي الجسم بالكامل من الرأس إلى القدمين.",
            "en": "Place the body on the shroud after washing, ensuring the private parts are covered. Arrange the layers to fully cover the body from head to toe."
          },
          "tips": {
            "ar": "استخدم شخصين أو أكثر لتسهيل عملية التكفين بدقة.",
            "en": "Use two or more people to facilitate precise shrouding."
          }
        },
        {
          "title": {
            "ar": "لف الكفن",
            "en": "Wrapping the Shroud"
          },
          "description": {
            "ar": "لف الكفن من الجهة اليمنى أولاً، ثم اليسرى، واربط الأطراف برفق عند الرأس والقدمين. تأكد أن الكفن محكم دون إفراط.",
            "en": "Wrap the shroud starting from the right side, then the left, and tie the ends gently at the head and feet. Ensure the shroud is secure but not overly tight."
          },
          "tips": {
            "ar": "استخدم أشرطة قماشية لربط الكفن بدلاً من الحبال السميكة.",
            "en": "Use cloth strips to tie the shroud instead of thick ropes."
          }
        },
        {
          "title": {
            "ar": "النية والدعاء",
            "en": "Intention and Supplication"
          },
          "description": {
            "ar": "اعقد النية أن التكفين لله تعالى، وادع للميت بالمغفرة والرحمة أثناء التكفين. يستحب أداء العمل بإخلاص وهدوء.",
            "en": "Intend that the shrouding is for Allah, and pray for the deceased’s forgiveness and mercy during the process. Perform it with sincerity and calmness."
          },
          "tips": {
            "ar": "ردد أدعية قصيرة مثل 'اللهم اجعل قبره روضة من رياض الجنة' أثناء التكفين.",
            "en": "Recite short supplications like 'Allahumma ij’al qabrahu rawdatan min riyad al-jannah' during shrouding."
          }
        }
      ],
      "additional_info": {
        "ar": "تكفين الميت فرض كفاية، وهو من أعمال الرحمة التي تحفظ كرامة الميت. البساطة في الكفن من السنة.",
        "en": "Shrouding the deceased is a communal obligation and a merciful act that preserves their dignity. Simplicity in the shroud is from the Sunnah."
      },
      "common_mistakes": {
        "ar": "استخدام كفن غير أبيض، التكفين بطريقة غير محكمة، أو استخدام مال حرام لشراء الكفن.",
        "en": "Using a non-white shroud, shrouding improperly, or using unlawful money to buy the shroud."
      }
    },
    {
      "id": "burial",
      "title": {
        "ar": "كيفية دفن الميت",
        "en": "How to Bury the Deceased"
      },
      "category": {
        "ar": "الجنائز",
        "en": "Funerals"
      },
      "description": {
        "ar": "دليل مفصل لدفن الميت وفق السنة النبوية، مع توضيح الخطوات والآداب",
        "en": "Detailed guide for burying the deceased according to the Prophetic tradition, including steps and etiquettes"
      },
      "icon": "fas fa-spade",
      "steps": [
        {
          "title": {
            "ar": "اختيار مكان الدفن",
            "en": "Choosing the Burial Site"
          },
          "description": {
            "ar": "اختر مقبرة إسلامية، وتأكد أن القبر في أرض طاهرة. يجب أن يكون القبر عميقاً بما يكفي لحماية الجثمان.",
            "en": "Choose an Islamic cemetery, ensuring the grave is in pure land. The grave must be deep enough to protect the body."
          },
          "tips": {
            "ar": "اتبع قوانين المقبرة المحلية لضمان الامتثال للشرع والقانون.",
            "en": "Follow local cemetery regulations to ensure compliance with Sharia and law."
          }
        },
        {
          "title": {
            "ar": "حفر القبر",
            "en": "Digging the Grave"
          },
          "description": {
            "ar": "احفر القبر بعمق حوالي متر ونصف، مع إنشاء لحد (حفرة جانبية) لوضع الجثمان. تأكد أن القبر باتجاه القبلة.",
            "en": "Dig the grave about one and a half meters deep, with a niche (lahd) for the body. Ensure the grave faces the Qiblah."
          },
          "tips": {
            "ar": "استعن بأشخاص ذوي خبرة إذا لم تكن معتاداً على حفر القبر.",
            "en": "Seek help from experienced individuals if unfamiliar with grave digging."
          }
        },
        {
          "title": {
            "ar": "وضع الجثمان في القبر",
            "en": "Placing the Body in the Grave"
          },
          "description": {
            "ar": "ضع الجثمان في اللحد على جنبه الأيمن، متجهاً إلى القبلة. قل: 'بسم الله وعلى ملة رسول الله' أثناء وضعه.",
            "en": "Place the body in the niche on its right side, facing the Qiblah. Say: 'Bismillah wa ‘ala millati rasulillah' while placing it."
          },
          "tips": {
            "ar": "استخدم أشخاصاً قليلين للوضع للحفاظ على خصوصية الميت.",
            "en": "Use a small number of people for placement to maintain the deceased’s privacy."
          }
        },
        {
          "title": {
            "ar": "ردم القبر والدعاء",
            "en": "Filling the Grave and Supplicating"
          },
          "description": {
            "ar": "ردم القبر بالتراب، واجعله مرتفعاً قليلاً. ادع للميت بالمغفرة والثبات بعد الدفن، ويستحب البقاء قليلاً عند القبر.",
            "en": "Fill the grave with soil, making it slightly raised. Pray for the deceased’s forgiveness and steadfastness after burial, and it’s recommended to stay briefly at the grave."
          },
          "tips": {
            "ar": "ردد أدعية مثل 'اللهم اغفر له وثبته عند السؤال' بعد الدفن.",
            "en": "Recite supplications like 'Allahumma ighfir lahu wa thabbit-hu ‘inda as-su’al' after burial."
          }
        }
      ],
      "additional_info": {
        "ar": "دفن الميت فرض كفاية، ويجب الإسراع به ما لم يكن هناك عذر. الدفن يحفظ كرامة الميت ويحميه من التعدي.",
        "en": "Burying the deceased is a communal obligation and should be hastened unless excused. Burial preserves the deceased’s dignity and protects them from harm."
      },
      "common_mistakes": {
        "ar": "تأخير الدفن بدون عذر، وضع الجثمان بطريقة غير صحيحة، أو إهمال الدعاء بعد الدفن.",
        "en": "Delaying burial without excuse, placing the body incorrectly, or neglecting supplication after burial."
      }
    },
    {
      "id": "condolences",
      "title": {
        "ar": "كيفية تقديم التعزية",
        "en": "How to Offer Condolences"
      },
      "category": {
        "ar": "الجنائز",
        "en": "Funerals"
      },
      "description": {
        "ar": "دليل مفصل لتقديم التعزية لأهل الميت وفق السنة النبوية، مع توضيح آدابها",
        "en": "Detailed guide for offering condolences to the deceased’s family according to the Prophetic tradition, including its etiquettes"
      },
      "icon": "fas fa-handshake",
      "steps": [
        {
          "title": {
            "ar": "اختيار الوقت المناسب",
            "en": "Choosing the Right Time"
          },
          "description": {
            "ar": "قدم التعزية خلال ثلاثة أيام من الوفاة ما لم يكن هناك عذر. زر أهل الميت أو اتصل بهم في وقت مناسب.",
            "en": "Offer condolences within three days of the death unless excused. Visit or contact the deceased’s family at an appropriate time."
          },
          "tips": {
            "ar": "تجنب الزيارة في ساعات متأخرة أو أثناء انشغال الأهل.",
            "en": "Avoid visiting late or when the family is busy."
          }
        },
        {
          "title": {
            "ar": "استخدام الأدعية المأثورة",
            "en": "Using Authentic Supplications"
          },
          "description": {
            "ar": "قل دعاء التعزية، مثل: 'إنا لله وإنا إليه راجعون، اللهم اغفر له وارحمه، وعافه واعف عنه'. استخدم كلاماً موجزاً وصادقاً.",
            "en": "Say the condolence supplication, e.g., 'Inna Lillahi wa Inna Ilayhi Raji’un, Allahumma ighfir lahu warhamhu, wa ‘afihi wa’fu ‘anhu.' Use concise, sincere words."
          },
          "tips": {
            "ar": "احفظ دعاء التعزية القصير لتتمكن من قوله بسهولة.",
            "en": "Memorize a short condolence supplication for ease."
          }
        },
        {
          "title": {
            "ar": "تقديم المساعدة",
            "en": "Offering Assistance"
          },
          "description": {
            "ar": "اعرض مساعدتك على أهل الميت، مثل إحضار طعام، مساعدة في ترتيبات الجنازة، أو الجلوس معهم للتخفيف عنهم.",
            "en": "Offer help to the deceased’s family, such as bringing food, assisting with funeral arrangements, or staying with them to provide comfort."
          },
          "tips": {
            "ar": "اسأل الأهل عن احتياجاتهم بدلاً من افتراض ما يريدون.",
            "en": "Ask the family about their needs instead of assuming what they want."
          }
        },
        {
          "title": {
            "ar": "احترام مشاعر الأهل",
            "en": "Respecting the Family’s Feelings"
          },
          "description": {
            "ar": "تجنب الأسئلة المزعجة عن سبب الوفاة أو التفاصيل. ركز على مواساتهم والدعاء لهم وللميت.",
            "en": "Avoid intrusive questions about the cause of death or details. Focus on comforting them and praying for them and the deceased."
          },
          "tips": {
            "ar": "استمع أكثر مما تتحدث، وكن موجوداً بحضورك الهادئ.",
            "en": "Listen more than you speak, and be present with a calm demeanor."
          }
        }
      ],
      "additional_info": {
        "ar": "التعزية سنة نبوية تعزز التكافل وتخفف عن أهل الميت. يستحب أن تكون موجزة وصادقة.",
        "en": "Offering condolences is a Prophetic Sunnah that promotes solidarity and eases the family’s burden. It should be concise and sincere."
      },
      "common_mistakes": {
        "ar": "الحديث عن أمور غير مناسبة، إطالة الزيارة، أو عدم الدعاء للميت.",
        "en": "Talking about inappropriate matters, prolonging the visit, or not praying for the deceased."
      }
    },
    {
      "id": "visiting-graves",
      "title": {
        "ar": "كيفية زيارة القبور",
        "en": "How to Visit Graves"
      },
      "category": {
        "ar": "الجنائز",
        "en": "Funerals"
      },
      "description": {
        "ar": "دليل مفصل لزيارة القبور وفق السنة النبوية، مع توضيح آدابها وفوائدها",
        "en": "Detailed guide for visiting graves according to the Prophetic tradition, including its etiquettes and benefits"
      },
      "icon": "fas fa-tombstone",
      "steps": [
        {
          "title": {
            "ar": "النية للزيارة",
            "en": "Intention for Visiting"
          },
          "description": {
            "ar": "اعقد النية لزيارة القبور للتذكر بالآخرة والدعاء للأموات، كما ورد في الحديث: 'زوروا القبور فإنها تذكركم بالآخرة'.",
            "en": "Intend to visit graves to remember the hereafter and pray for the deceased, as per the Hadith: 'Visit the graves, for they remind you of the hereafter.'"
          },
          "tips": {
            "ar": "ذكّر نفسك بالموت والآخرة قبل الزيارة لتعزيز الخشوع.",
            "en": "Reflect on death and the hereafter before visiting to enhance humility."
          }
        },
        {
          "title": {
            "ar": "إلقاء السلام",
            "en": "Offering Salam"
          },
          "description": {
            "ar": "قل عند دخول المقبرة: 'السلام عليكم أهل الديار من المؤمنين والمسلمين'. هذا من السنة لتحية أهل القبور.",
            "en": "Say upon entering the cemetery: 'As-salamu alaikum ahl ad-diyar min al-mu’mineen wal-muslimeen.' This is from the Sunnah to greet the inhabitants of the graves."
          },
          "tips": {
            "ar": "ردد السلام بصوت منخفض وبإخلاص لتعزيز الاتصال الروحي.",
            "en": "Recite the salam quietly and sincerely to enhance spiritual connection."
          }
        },
        {
          "title": {
            "ar": "الدعاء للأموات",
            "en": "Supplicating for the Deceased"
          },
          "description": {
            "ar": "ادع للأموات بالمغفرة والرحمة، مثل: 'اللهم اغفر لهم وارحمهم وعافه واعف عنهم'. تجنب البكاء بصوت عالٍ أو النياحة.",
            "en": "Pray for the deceased’s forgiveness and mercy, e.g., 'Allahumma ighfir lahum warhamhum wa ‘afihim wa’fu ‘anhum.' Avoid loud crying or wailing."
          },
          "tips": {
            "ar": "احفظ دعاءً قصيراً لتتمكن من الدعاء بسهولة عند كل قبر.",
            "en": "Memorize a short supplication to pray easily at each grave."
          }
        },
        {
          "title": {
            "ar": "الالتزام بالآداب",
            "en": "Adhering to Etiquettes"
          },
          "description": {
            "ar": "تجنب الجلوس على القبور، المشي فوقها، أو التحدث بأمور دنيوية. احترم المكان بالهدوء والخشوع.",
            "en": "Avoid sitting on graves, walking over them, or discussing worldly matters. Respect the place with calmness and humility."
          },
          "tips": {
            "ar": "ارتدِ ملابس محتشمة وتجنب الضحك أو المزاح في المقبرة.",
            "en": "Wear modest clothing and avoid laughing or joking in the cemetery."
          }
        }
      ],
      "additional_info": {
        "ar": "زيارة القبور سنة مستحبة للرجال، وتذكر بالموت وتعزز الدعاء للأموات. يجب الالتزام بالآداب لضمان القبول.",
        "en": "Visiting graves is a recommended Sunnah for men, reminding of death and encouraging prayer for the deceased. Adhering to etiquettes ensures acceptance."
      },
      "common_mistakes": {
        "ar": "النياحة أو البكاء بصوت عالٍ، الجلوس على القبور، أو زيارة القبور بنية غير شرعية.",
        "en": "Wailing or crying loudly, sitting on graves, or visiting graves with un-Islamic intentions."
      }
    },
    {
      "id": "ihram",
      "title": {
        "ar": "كيفية الإحرام للحج أو العمرة",
        "en": "How to Enter Ihram for Hajj or Umrah"
      },
      "category": {
        "ar": "الحج والعمرة",
        "en": "Hajj & Umrah"
      },
      "description": {
        "ar": "دليل مفصل لدخول حالة الإحرام، الخطوة الأولى للحج أو العمرة، وفق السنة النبوية، مع توضيح شروطها وآدابها",
        "en": "Detailed guide for entering the state of Ihram, the first step for Hajj or Umrah, according to the Prophetic tradition, including its conditions and etiquettes"
      },
      "icon": "fas fa-kaaba",
      "steps": [
        {
          "title": {
            "ar": "التطهر والاستعداد",
            "en": "Purification and Preparation"
          },
          "description": {
            "ar": "اغتسل (الغسل مستحب) وتوضأ، ثم ارتدِ ملابس الإحرام (للرجال: إزار ورداء أبيضان، وللنساء: ملابس ساترة). تأكد من النظافة قبل الإحرام.",
            "en": "Perform Ghusl (recommended) and Wudu, then wear Ihram garments (for men: white izaar and ridaa; for women: modest clothing). Ensure cleanliness before Ihram."
          },
          "tips": {
            "ar": "استخدم ملابس إحرام نظيفة ومريحة، وتجنب الملابس المعطرة.",
            "en": "Use clean, comfortable Ihram garments and avoid perfumed clothing."
          }
        },
        {
          "title": {
            "ar": "النية للإحرام",
            "en": "Making the Intention for Ihram"
          },
          "description": {
            "ar": "اعقد النية في قلبك للإحرام للحج أو العمرة عند الميقات، مثل: 'لبيك اللهم عمرة' أو 'لبيك اللهم حجاً'. النية شرط أساسي.",
            "en": "Intend in your heart to enter Ihram for Hajj or Umrah at the Miqat, e.g., 'Labbayk Allahumma Umrah' or 'Labbayk Allahumma Hajjan.' Intention is essential."
          },
          "tips": {
            "ar": "قل النية بصوت منخفض وتركيز لتعزيز الإخلاص.",
            "en": "Say the intention quietly with focus to enhance sincerity."
          }
        },
        {
          "title": {
            "ar": "التلبية",
            "en": "Reciting the Talbiyah"
          },
          "description": {
            "ar": "ردد التلبية: 'لبيك اللهم لبيك، لبيك لا شريك لك لبيك، إن الحمد والنعمة لك والملك، لا شريك لك'. استمر في التلبية حتى تبدأ الطواف (للعمرة) أو رمي الجمرات (للحج).",
            "en": "Recite the Talbiyah: 'Labbayk Allahumma labbayk, labbayk la sharika laka labbayk, inna al-hamda wan-ni’mata laka wal-mulk, la sharika lak.' Continue until starting Tawaf (for Umrah) or throwing pebbles (for Hajj)."
          },
          "tips": {
            "ar": "ردد التلبية بصوت مرتفع (للرجال) في أماكن مفتوحة لتعزيز الخشوع.",
            "en": "Recite the Talbiyah loudly (for men) in open areas to enhance devotion."
          }
        },
        {
          "title": {
            "ar": "الالتزام بمحظورات الإحرام",
            "en": "Adhering to Ihram Prohibitions"
          },
          "description": {
            "ar": "تجنب محظورات الإحرام، مثل قص الشعر أو الأظافر، استخدام العطور، أو ارتداء ملابس مخيطة (للرجال). التزم بالآداب حتى تنهي النسك.",
            "en": "Avoid Ihram prohibitions, such as cutting hair or nails, using perfume, or wearing stitched clothing (for men). Adhere to etiquettes until completing the rites."
          },
          "tips": {
            "ar": "احتفظ بقائمة محظورات الإحرام لتذكير نفسك أثناء النسك.",
            "en": "Keep a list of Ihram prohibitions to remind yourself during the rites."
          }
        }
      ],
      "additional_info": {
        "ar": "الإحرام هو الدخول في حالة العبادة للحج أو العمرة، ويستحب الإكثار من الذكر والدعاء أثناءه. التلبية تعبر عن التسليم لله.",
        "en": "Ihram is the state of worship for Hajj or Umrah, and it’s recommended to increase remembrance and supplication during it. The Talbiyah expresses submission to Allah."
      },
      "common_mistakes": {
        "ar": "عدم النية عند الميقات، استخدام العطور أثناء الإحرام، أو التوقف عن التلبية مبكراً.",
        "en": "Not making the intention at the Miqat, using perfume during Ihram, or stopping the Talbiyah too early."
      }
    },
    {
      "id": "tawaf",
      "title": {
        "ar": "كيفية أداء الطواف",
        "en": "How to Perform Tawaf"
      },
      "category": {
        "ar": "الحج والعمرة",
        "en": "Hajj & Umrah"
      },
      "description": {
        "ar": "دليل مفصل لأداء الطواف حول الكعبة وفق السنة النبوية، مع توضيح خطواته وآدابه",
        "en": "Detailed guide for performing Tawaf around the Kaaba according to the Prophetic tradition, including its steps and etiquettes"
      },
      "icon": "fas fa-mosque",
      "steps": [
        {
          "title": {
            "ar": "الاستعداد للطواف",
            "en": "Preparing for Tawaf"
          },
          "description": {
            "ar": "تأكد من الطهارة بالوضوء أو الغسل، وارتدِ ملابس الإحرام (إذا كنت محرماً). ابدأ الطواف من زاوية الحجر الأسود.",
            "en": "Ensure purity with Wudu or Ghusl, and wear Ihram garments (if in Ihram). Start Tawaf from the corner of the Black Stone."
          },
          "tips": {
            "ar": "حاول أداء الطواف في أوقات أقل ازدحاماً لتسهيل الحركة.",
            "en": "Perform Tawaf during less crowded times to ease movement."
          }
        },
        {
          "title": {
            "ar": "النية للطواف",
            "en": "Making the Intention for Tawaf"
          },
          "description": {
            "ar": "اعقد النية في قلبك للطواف، مثل: 'نويت أن أطوف طواف العمرة/الحج'. لا داعي لقول النية بصوت عالٍ.",
            "en": "Intend in your heart to perform Tawaf, e.g., 'I intend to perform Tawaf for Umrah/Hajj.' No need to say the intention aloud."
          },
          "tips": {
            "ar": "ركز على النية عند بداية الطواف لتعزيز الإخلاص.",
            "en": "Focus on the intention at the start of Tawaf to enhance sincerity."
          }
        },
        {
          "title": {
            "ar": "أداء الطواف",
            "en": "Performing Tawaf"
          },
          "description": {
            "ar": "طف حول الكعبة سبعة أشواط، مبتدئاً من الحجر الأسود. استلم الحجر أو أشر إليه بيدك وقُل: 'بسم الله والله أكبر'. أكثر من الذكر والدعاء أثناء الطواف.",
            "en": "Circumambulate the Kaaba seven times, starting from the Black Stone. Touch or point to it and say: 'Bismillah wa Allahu Akbar.' Increase remembrance and supplication during Tawaf."
          },
          "tips": {
            "ar": "احفظ أدعية قصيرة للطواف، أو ادع بما في قلبك بلغتك.",
            "en": "Memorize short supplications for Tawaf or supplicate from your heart in your language."
          }
        },
        {
          "title": {
            "ar": "الرمل والاضطباع (للرجال)",
            "en": "Raml and Idtiba (for Men)"
          },
          "description": {
            "ar": "في الأشواط الثلاثة الأولى للطواف الواجب للعمرة أو الحج (قدوم)، قم بالرمل (المشي السريع بتقارب الخطوات) واضطباع (كشف الكتف الأيمن).",
            "en": "In the first three rounds of obligatory Tawaf for Umrah or Hajj (Qudum), perform Raml (brisk walking with short steps) and Idtiba (uncovering the right shoulder)."
          },
          "tips": {
            "ar": "تأكد من إحكام الرداء لتجنب السقوط أثناء الرمل.",
            "en": "Secure the ridaa to avoid slipping during Raml."
          }
        }
      ],
      "additional_info": {
        "ar": "الطواف ركن أساسي في الحج والعمرة، وهو عبادة عظيمة تعبر عن التوحيد والتسليم. يستحب الإكثار من الدعاء والذكر أثناءه.",
        "en": "Tawaf is a fundamental pillar of Hajj and Umrah, a great act of worship expressing monotheism and submission. It’s recommended to increase supplication and remembrance during it."
      },
      "common_mistakes": {
        "ar": "بدء الطواف من غير الحجر الأسود، قطع الطواف بدون عذر، أو التحدث في أمور دنيوية أثناء الطواف.",
        "en": "Starting Tawaf from other than the Black Stone, interrupting Tawaf without excuse, or discussing worldly matters during Tawaf."
      }
    },
    {
      "id": "sai",
      "title": {
        "ar": "كيفية أداء السعي",
        "en": "How to Perform Sa’i"
      },
      "category": {
        "ar": "الحج والعمرة",
        "en": "Hajj & Umrah"
      },
      "description": {
        "ar": "دليل مفصل لأداء السعي بين الصفا والمروة وفق السنة النبوية، مع توضيح خطواته وآدابه",
        "en": "Detailed guide for performing Sa’i between Safa and Marwah according to the Prophetic tradition, including its steps and etiquettes"
      },
      "icon": "fas fa-walking",
      "steps": [
        {
          "title": {
            "ar": "الاستعداد للسعي",
            "en": "Preparing for Sa’i"
          },
          "description": {
            "ar": "تأكد من الطهارة بالوضوء (مستحب وليس شرطاً). ابدأ السعي من الصفا بعد الانتهاء من الطواف. النية تكون في القلب.",
            "en": "Ensure purity with Wudu (recommended, not mandatory). Start Sa’i from Safa after completing Tawaf. Intention is made in the heart."
          },
          "tips": {
            "ar": "ارتدِ أحذية مريحة لتسهيل السعي، خاصة إذا كنت تعاني من آلام القدم.",
            "en": "Wear comfortable shoes to ease Sa’i, especially if you have foot pain."
          }
        },
        {
          "title": {
            "ar": "بدء السعي من الصفا",
            "en": "Starting Sa’i from Safa"
          },
          "description": {
            "ar": "اصعد إلى الصفا، وواجه الكعبة، وقل: 'إن الصفا والمروة من شعائر الله، أبدأ بما بدأ الله به'. ثم ابدأ المشي إلى المروة.",
            "en": "Ascend Safa, face the Kaaba, and say: 'Inna as-Safa wal-Marwata min sha’a’ir Allah, abda’u bima bada’a Allahu bih.' Then walk to Marwah."
          },
          "tips": {
            "ar": "ردد هذا الذكر بتركيز لتعزيز الخشوع عند بداية السعي.",
            "en": "Recite this remembrance with focus to enhance devotion at the start of Sa’i."
          }
        },
        {
          "title": {
            "ar": "السعي بين الصفا والمروة",
            "en": "Performing Sa’i Between Safa and Marwah"
          },
          "description": {
            "ar": "امشِ بين الصفا والمروة سبع مرات، من الصفا إلى المروة شوط، ومن المروة إلى الصفا شوط آخر. أكثر من الدعاء والذكر أثناء السعي.",
            "en": "Walk between Safa and Marwah seven times, counting Safa to Marwah as one round and Marwah to Safa as another. Increase supplication and remembrance during Sa’i."
          },
          "tips": {
            "ar": "ادع بما في قلبك، واستذكر قصة هاجر لتعزيز الاتصال الروحي.",
            "en": "Supplicate from your heart and recall Hajar’s story to enhance spiritual connection."
          }
        },
        {
          "title": {
            "ar": "الهرولة بين العلمين (للرجال)",
            "en": "Jogging Between the Green Markers (for Men)"
          },
          "description": {
            "ar": "في المنطقة بين العلمين الأخضرين، قم بالهرولة (المشي السريع) إذا كنت رجلاً. هذا تقليد لهاجر عليها السلام.",
            "en": "In the area between the green markers, jog (brisk walking) if you are a man. This follows the tradition of Hajar (peace be upon her)."
          },
          "tips": {
            "ar": "حافظ على وتيرة معتدلة لتجنب الإرهاق أثناء الهرولة.",
            "en": "Maintain a moderate pace to avoid exhaustion during jogging."
          }
        }
      ],
      "additional_info": {
        "ar": "السعي ركن من أركان الحج والعمرة، وهو تذكير بصبر هاجر وابنها إسماعيل. يستحب الإكثار من الدعاء أثناءه.",
        "en": "Sa’i is a pillar of Hajj and Umrah, commemorating the patience of Hajar and her son Ismail. It’s recommended to increase supplication during it."
      },
      "common_mistakes": {
        "ar": "بدء السعي بدون طهارة (غير واجبة)، عد الأشواط بشكل خاطئ، أو إهمال الدعاء أثناء السعي.",
        "en": "Starting Sa’i without purity (not mandatory), miscounting rounds, or neglecting supplication during Sa’i."
      }
    },
    {
      "id": "umrah",
      "title": {
        "ar": "كيفية أداء العمرة",
        "en": "How to Perform Umrah"
      },
      "category": {
        "ar": "الحج والعمرة",
        "en": "Hajj & Umrah"
      },
      "description": {
        "ar": "دليل مفصل لأداء العمرة كاملة وفق السنة النبوية، مع توضيح أركانها وآدابها",
        "en": "Detailed guide for performing Umrah completely according to the Prophetic tradition, including its pillars and etiquettes"
      },
      "icon": "fas fa-pilgrim",
      "steps": [
        {
          "title": {
            "ar": "الإحرام من الميقات",
            "en": "Entering Ihram from the Miqat"
          },
          "description": {
            "ar": "اغتسل، ارتدِ ملابس الإحرام، واعقد النية للعمرة عند الميقات، ثم ردد التلبية: 'لبيك اللهم عمرة' حتى تصل إلى مكة.",
            "en": "Perform Ghusl, wear Ihram garments, make the intention for Umrah at the Miqat, and recite the Talbiyah: 'Labbayk Allahumma Umrah' until reaching Makkah."
          },
          "tips": {
            "ar": "تأكد من معرفة موقع الميقات الخاص بمسارك (مثل ذو الحليفة أو الجحفة).",
            "en": "Ensure you know the Miqat for your route (e.g., Dhul-Hulaifah or Al-Juhfah)."
          }
        },
        {
          "title": {
            "ar": "الطواف حول الكعبة",
            "en": "Performing Tawaf Around the Kaaba"
          },
          "description": {
            "ar": "طف حول الكعبة سبعة أشواط، مبتدئاً من الحجر الأسود. قم بالرمل والاضطباع (للرجال) في الأشواط الثلاثة الأولى، وأكثر من الدعاء.",
            "en": "Circumambulate the Kaaba seven times, starting from the Black Stone. Perform Raml and Idtiba (for men) in the first three rounds, and increase supplication."
          },
          "tips": {
            "ar": "حاول الطواف في أوقات أقل ازدحاماً لتجنب الزحام.",
            "en": "Perform Tawaf during less crowded times to avoid congestion."
          }
        },
        {
          "title": {
            "ar": "السعي بين الصفا والمروة",
            "en": "Performing Sa’i Between Safa and Marwah"
          },
          "description": {
            "ar": "امشِ بين الصفا والمروة سبع مرات، مبتدئاً من الصفا. أكثر من الدعاء، وهرول بين العلمين الأخضرين (للرجال).",
            "en": "Walk between Safa and Marwah seven times, starting from Safa. Increase supplication and jog between the green markers (for men)."
          },
          "tips": {
            "ar": "احتفظ بزجاجة ماء لترطيب نفسك أثناء السعي.",
            "en": "Keep a water bottle to stay hydrated during Sa’i."
          }
        },
        {
          "title": {
            "ar": "الحلق أو التقصير",
            "en": "Shaving or Trimming the Hair"
          },
          "description": {
            "ar": "احلق شعر رأسك (مستحب للرجال) أو قصر منه قليلاً (للنساء والرجال). هذا ينهي العمرة ويخرجك من الإحرام.",
            "en": "Shave your head (recommended for men) or trim a small portion (for women and men). This completes Umrah and releases you from Ihram."
          },
          "tips": {
            "ar": "استخدم أدوات حلاقة نظيفة، أو اذهب إلى حلاق معتمد في مكة.",
            "en": "Use clean shaving tools or visit a certified barber in Makkah."
          }
        }
      ],
      "additional_info": {
        "ar": "العمرة سنة مؤكدة، وهي عبادة عظيمة تطهر الذنوب. ورد في الحديث أن العمرة إلى العمرة كفارة لما بينهما.",
        "en": "Umrah is a highly recommended Sunnah and a great act of worship that expiates sins. Hadith states that an Umrah to another Umrah expiates sins between them."
      },
      "common_mistakes": {
        "ar": "إهمال النية، عدم الالتزام بمحظورات الإحرام، أو إهمال الحلق/التقصير.",
        "en": "Neglecting the intention, violating Ihram prohibitions, or omitting shaving/trimming."
      }
    },
    {
      "id": "hajj-tamattu",
      "title": {
        "ar": "كيفية أداء الحج (تمتع)",
        "en": "How to Perform Hajj (Tamattu’)"
      },
      "category": {
        "ar": "الحج والعمرة",
        "en": "Hajj & Umrah"
      },
      "description": {
        "ar": "دليل مفصل لأداء الحج بنسك التمتع وفق السنة النبوية، مع توضيح أركانه وواجباته",
        "en": "Detailed guide for performing Hajj with Tamattu’ according to the Prophetic tradition, including its pillars and obligations"
      },
      "icon": "fas fa-hajj",
      "steps": [
        {
          "title": {
            "ar": "الإحرام للعمرة",
            "en": "Entering Ihram for Umrah"
          },
          "description": {
            "ar": "ابدأ بنسك التمتع بالإحرام للعمرة من الميقات، وأكمل الطواف، السعي، والحلق/التقصير. ثم تحلل من الإحرام.",
            "en": "Begin Tamattu’ by entering Ihram for Umrah from the Miqat, complete Tawaf, Sa’i, and shaving/trimming, then exit Ihram."
          },
          "tips": {
            "ar": "أكمل العمرة في وقت مبكر لتجنب الإرهاق قبل الحج.",
            "en": "Complete Umrah early to avoid exhaustion before Hajj."
          }
        },
        {
          "title": {
            "ar": "الإحرام للحج",
            "en": "Entering Ihram for Hajj"
          },
          "description": {
            "ar": "في الثامن من ذي الحجة (يوم التروية)، اغتسل وأحرم للحج من مكة، وردد التلبية: 'لبيك اللهم حجاً'. توجه إلى منى.",
            "en": "On the 8th of Dhul-Hijjah (Day of Tarwiyah), perform Ghusl, enter Ihram for Hajj from Makkah, recite the Talbiyah: 'Labbayk Allahumma Hajjan,' and proceed to Mina."
          },
          "tips": {
            "ar": "جهز حقيبة صغيرة باحتياجاتك الأساسية لمنى.",
            "en": "Prepare a small bag with essentials for Mina."
          }
        },
        {
          "title": {
            "ar": "الوقوف بعرفة",
            "en": "Standing at Arafah"
          },
          "description": {
            "ar": "في التاسع من ذي الحجة، توجه إلى عرفة وقف من الظهر إلى غروب الشمس، مكثراً من الدعاء والذكر. هذا ركن الحج الأعظم.",
            "en": "On the 9th of Dhul-Hijjah, go to Arafah and stand from noon until sunset, increasing supplication and remembrance. This is the greatest pillar of Hajj."
          },
          "tips": {
            "ar": "احفظ أدعية يوم عرفة، مثل 'لا إله إلا الله وحده لا شريك له'.",
            "en": "Memorize Arafah supplications, like 'La ilaha illa Allah wahdahu la sharika lah.'"
          }
        },
        {
          "title": {
            "ar": "رمي الجمرات والأضحية",
            "en": "Throwing Pebbles and Offering Sacrifice"
          },
          "description": {
            "ar": "في أيام التشريق (10-13 ذي الحجة)، ارم الجمرات الثلاث، واذبح الأضحية (للتمتع). أكمل الطواف الإفاضة والسعي، ثم تحلل.",
            "en": "During Tashriq days (10th-13th Dhul-Hijjah), throw pebbles at the three Jamarat, offer the sacrifice (for Tamattu’), complete Tawaf al-Ifadah and Sa’i, then exit Ihram."
          },
          "tips": {
            "ar": "احمل حصوات الجمرات في كيس صغير لتجنب الضياع.",
            "en": "Carry pebbles for Jamarat in a small bag to avoid losing them."
          }
        }
      ],
      "additional_info": {
        "ar": "نسك التمتع هو الأكثر شيوعاً، ويجمع بين العمرة والحج مع التحلل بينهما. الحج فريضة مرة في العمر للقادر.",
        "en": "Tamattu’ is the most common form, combining Umrah and Hajj with release from Ihram between them. Hajj is obligatory once in a lifetime for those able."
      },
      "common_mistakes": {
        "ar": "إهمال الوقوف بعرفة، عدم الالتزام بترتيب الأركان، أو مخالفة محظورات الإحرام.",
        "en": "Neglecting standing at Arafah, not following the order of pillars, or violating Ihram prohibitions."
      }
    },
    {
      "id": "farewell-tawaf",
      "title": {
        "ar": "كيفية أداء طواف الوداع",
        "en": "How to Perform the Farewell Tawaf"
      },
      "category": {
        "ar": "الحج والعمرة",
        "en": "Hajj & Umrah"
      },
      "description": {
        "ar": "دليل مفصل لأداء طواف الوداع، الخطوة الأخيرة في الحج، وفق السنة النبوية",
        "en": "Detailed guide for performing the Farewell Tawaf, the final step in Hajj, according to the Prophetic tradition"
      },
      "icon": "fas fa-kaaba",
      "steps": [
        {
          "title": {
            "ar": "الاستعداد للطواف",
            "en": "Preparing for Tawaf"
          },
          "description": {
            "ar": "تأكد من الطهارة بالوضوء، وارتدِ ملابس نظيفة (لا حاجة للإحرام). توجه إلى المسجد الحرام لأداء طواف الوداع قبل مغادرة مكة.",
            "en": "Ensure purity with Wudu and wear clean clothes (no Ihram required). Proceed to the Grand Mosque to perform the Farewell Tawaf before leaving Makkah."
          },
          "tips": {
            "ar": "حاول أداء الطواف في وقت قليل الزحام لتجنب التأخير.",
            "en": "Perform Tawaf during less crowded times to avoid delays."
          }
        },
        {
          "title": {
            "ar": "النية للطواف",
            "en": "Making the Intention for Tawaf"
          },
          "description": {
            "ar": "اعقد النية في قلبك لأداء طواف الوداع، مثل: 'نويت أن أطوف طواف الوداع'. ابدأ من زاوية الحجر الأسود.",
            "en": "Intend in your heart to perform the Farewell Tawaf, e.g., 'I intend to perform the Farewell Tawaf.' Start from the Black Stone corner."
          },
          "tips": {
            "ar": "ركز على النية لتعزيز الإخلاص قبل بدء الطواف.",
            "en": "Focus on the intention to enhance sincerity before starting Tawaf."
          }
        },
        {
          "title": {
            "ar": "أداء الطواف",
            "en": "Performing Tawaf"
          },
          "description": {
            "ar": "طف حول الكعبة سبعة أشواط، مبتدئاً من الحجر الأسود. أكثر من الدعاء والذكر، واستلم الحجر أو أشر إليه إن أمكن.",
            "en": "Circumambulate the Kaaba seven times, starting from the Black Stone. Increase supplication and remembrance, and touch or point to the Black Stone if possible."
          },
          "tips": {
            "ar": "ادع بالمغفرة والثبات، فهذا آخر عمل في الحج.",
            "en": "Supplicate for forgiveness and steadfastness, as this is the final act of Hajj."
          }
        },
        {
          "title": {
            "ar": "الصلاة والخروج",
            "en": "Praying and Exiting"
          },
          "description": {
            "ar": "بعد الطواف، صلّ ركعتين خلف مقام إبراهيم، وادع عند الملتزم إن أمكن. ثم اخرج من المسجد بالقدم اليمنى وادع بدعاء الخروج.",
            "en": "After Tawaf, pray two Rak’ahs behind Maqam Ibrahim, supplicate at the Multazam if possible, then exit the mosque with the right foot, reciting the exit dua."
          },
          "tips": {
            "ar": "ردد دعاء الخروج: 'اللهم إني أسألك من فضلك' عند مغادرة المسجد.",
            "en": "Recite the exit dua: 'Allahumma inni as’aluk min fadlika' when leaving the mosque."
          }
        }
      ],
      "additional_info": {
        "ar": "طواف الوداع واجب على الحاج قبل مغادرة مكة، وهو تعبير عن الوداع للبيت الحرام. يستثنى منه الحائض والنفساء.",
        "en": "The Farewell Tawaf is obligatory for the pilgrim before leaving Makkah, expressing farewell to the Sacred House. Menstruating or postpartum women are exempt."
      },
      "common_mistakes": {
        "ar": "إهمال طواف الوداع، أداؤه بدون طهارة، أو الخروج من مكة قبل الطواف.",
        "en": "Neglecting the Farewell Tawaf, performing it without purity, or leaving Makkah before Tawaf."
      }
    },
    {
      "id": "tayammum",
      "title": {
        "ar": "كيفية أداء التيمم",
        "en": "How to Perform Tayammum (Dry Ablution)"
      },
      "category": {
        "ar": "الطهارة",
        "en": "Purification"
      },
      "description": {
        "ar": "دليل مفصل لأداء التيمم عند عدم توفر الماء أو العجز عن استخدامه، وفق السنة النبوية",
        "en": "Detailed guide for performing Tayammum when water is unavailable or cannot be used, according to the Prophetic tradition"
      },
      "icon": "fas fa-dust",
      "steps": [
        {
          "title": {
            "ar": "النية للتيمم",
            "en": "Making the Intention for Tayammum"
          },
          "description": {
            "ar": "اعقد النية في قلبك للتيمم لرفع الحدث أو للصلاة، مثل: 'نويت التيمم للصلاة'. النية شرط أساسي.",
            "en": "Intend in your heart to perform Tayammum to lift impurity or for prayer, e.g., 'I intend Tayammum for prayer.' Intention is essential."
          },
          "tips": {
            "ar": "ركز على النية قبل لمس التراب لضمان صحة التيمم.",
            "en": "Focus on the intention before touching the soil to ensure valid Tayammum."
          }
        },
        {
          "title": {
            "ar": "اختيار التراب الطاهر",
            "en": "Choosing Pure Soil"
          },
          "description": {
            "ar": "اختر تراباً طاهراً (مثل الرمل أو الغبار النظيف) من الأرض. يجب أن يكون التراب خالياً من النجاسة.",
            "en": "Choose pure soil (e.g., clean sand or dust) from the ground. The soil must be free of impurities."
          },
          "tips": {
            "ar": "تأكد من أن السطح الذي تستخدمه نظيف وغير ملوث.",
            "en": "Ensure the surface used is clean and uncontaminated."
          }
        },
        {
          "title": {
            "ar": "ضرب التراب ومسح الأعضاء",
            "en": "Striking the Soil and Wiping the Parts"
          },
          "description": {
            "ar": "اضرب التراب بيديك مرة، ثم انفضهما قليلاً، وامسح وجهك بالكامل، ثم اضرب التراب مرة أخرى وامسح يديك إلى المرفقين.",
            "en": "Strike the soil with both hands once, shake off excess, wipe your entire face, then strike again and wipe your arms up to the elbows."
          },
          "tips": {
            "ar": "امسح برفق لتجنب إيذاء الوجه أو اليدين بالغبار.",
            "en": "Wipe gently to avoid harming the face or hands with dust."
          }
        },
        {
          "title": {
            "ar": "التأكد من الظروف",
            "en": "Ensuring Valid Conditions"
          },
          "description": {
            "ar": "تيمم فقط إذا لم يتوفر الماء أو كنت عاجزاً عن استخدامه (مثل المرض). التيمم ينتهي عند توفر الماء أو زوال العذر.",
            "en": "Perform Tayammum only if water is unavailable or you cannot use it (e.g., due to illness). Tayammum is invalidated when water becomes available or the excuse ceases."
          },
          "tips": {
            "ar": "ابحث عن الماء أولاً قبل التيمم إذا كنت في مكان جديد.",
            "en": "Search for water first before resorting to Tayammum in a new place."
          }
        }
      ],
      "additional_info": {
        "ar": "التيمم رخصة شرعية عند العجز عن الماء، وهو يعبر عن مرونة الإسلام. يستحب الإسراع بالوضوء أو الغسل عند توفر الماء.",
        "en": "Tayammum is a religious concession when water is unavailable, reflecting Islam’s flexibility. It’s recommended to perform Wudu or Ghusl as soon as water is available."
      },
      "common_mistakes": {
        "ar": "التيمم مع وجود الماء، عدم مسح الوجه واليدين بالكامل، أو استخدام تراب نجس.",
        "en": "Performing Tayammum when water is available, not wiping the face and arms fully, or using impure soil."
      }
    },
    {
      "id": "removing-najasa",
      "title": {
        "ar": "كيفية إزالة النجاسة",
        "en": "How to Remove Impurities (Najasa)"
      },
      "category": {
        "ar": "الطهارة",
        "en": "Purification"
      },
      "description": {
        "ar": "دليل مفصل لإزالة النجاسات من الجسم أو الملابس أو المكان وفق السنة النبوية",
        "en": "Detailed guide for removing impurities from the body, clothes, or place according to the Prophetic tradition"
      },
      "icon": "fas fa-soap",
      "steps": [
        {
          "title": {
            "ar": "تحديد النجاسة",
            "en": "Identifying the Impurity"
          },
          "description": {
            "ar": "حدد نوع النجاسة (مثل البول، الدم، أو الغائط). النجاسات تحتاج إلى إزالة كاملة قبل الصلاة أو العبادة.",
            "en": "Identify the type of impurity (e.g., urine, blood, or excrement). Impurities must be fully removed before prayer or worship."
          },
          "tips": {
            "ar": "تعرف على أنواع النجاسات من خلال استشارة عالم دين إذا شككت.",
            "en": "Consult a scholar to identify impurities if in doubt."
          }
        },
        {
          "title": {
            "ar": "غسل النجاسة",
            "en": "Washing the Impurity"
          },
          "description": {
            "ar": "اغسل مكان النجاسة بالماء حتى تزول آثارها (اللون، الرائحة، والطعم). كرر الغسل إذا لزم الأمر، واستخدم الصابون إذا كانت النجاسة دهنية.",
            "en": "Wash the impure area with water until traces (color, smell, and taste) are gone. Repeat if necessary, and use soap for greasy impurities."
          },
          "tips": {
            "ar": "استخدم الماء الجاري أو اغمر الملابس لضمان إزالة النجاسة.",
            "en": "Use running water or soak clothes to ensure impurity removal."
          }
        },
        {
          "title": {
            "ar": "التأكد من الطهارة",
            "en": "Ensuring Purity"
          },
          "description": {
            "ar": "تأكد من زوال النجاسة بالكامل بفحص المكان أو الملابس. إذا كانت النجاسة على الأرض، اسكب الماء حتى تطهر.",
            "en": "Ensure the impurity is completely removed by inspecting the area or clothes. If on the ground, pour water until purified."
          },
          "tips": {
            "ar": "افحص المنطقة في ضوء جيد للتأكد من عدم بقاء أي أثر.",
            "en": "Inspect the area in good light to confirm no traces remain."
          }
        },
        {
          "title": {
            "ar": "غسل النجاسة من الجسم",
            "en": "Removing Impurity from the Body"
          },
          "description": {
            "ar": "إذا أصابت النجاسة الجسم، اغسلها بالماء مباشرة. إذا كانت نجاسة كبيرة (مثل الدم الكثير)، قد تحتاج إلى غسل كامل.",
            "en": "If impurity touches the body, wash it with water immediately. For major impurities (e.g., excessive blood), a full Ghusl may be required."
          },
          "tips": {
            "ar": "احتفظ بماء نظيف قريب عند التعامل مع النجاسات.",
            "en": "Keep clean water nearby when dealing with impurities."
          }
        }
      ],
      "additional_info": {
        "ar": "إزالة النجاسة شرط لصحة الصلاة والطواف. الطهارة من النجاسة تعزز النظافة الجسدية والروحية.",
        "en": "Removing impurities is a condition for valid prayer and Tawaf. Purity from impurities enhances physical and spiritual cleanliness."
      },
      "common_mistakes": {
        "ar": "إهمال غسل النجاسة بالكامل، استخدام مواد غير طاهرة للتنظيف، أو الصلاة مع وجود نجاسة.",
        "en": "Neglecting to fully remove impurities, using impure cleaning materials, or praying with impurities present."
      }
    },
    {
      "id": "purification-before-prayer",
      "title": {
        "ar": "كيفية الطهارة قبل الصلاة",
        "en": "How to Purify Before Prayer"
      },
      "category": {
        "ar": "الطهارة",
        "en": "Purification"
      },
      "description": {
        "ar": "دليل مفصل للطهارة قبل الصلاة وفق السنة النبوية، مع توضيح الوضوء والغسل حسب الحاجة",
        "en": "Detailed guide for purification before prayer according to the Prophetic tradition, including Wudu and Ghusl as needed"
      },
      "icon": "fas fa-prayer",
      "steps": [
        {
          "title": {
            "ar": "التحقق من الحدث",
            "en": "Checking for Impurity"
          },
          "description": {
            "ar": "حدد إذا كنت في حالة حدث أصغر (مثل البول أو النوم) أو أكبر (مثل الجنابة أو الحيض). الحدث الأصغر يتطلب وضوء، والأكبر يتطلب غسلاً.",
            "en": "Determine if you have a minor impurity (e.g., urine or sleep) or major impurity (e.g., Janabah or menstruation). Minor impurity requires Wudu; major requires Ghusl."
          },
          "tips": {
            "ar": "إذا شككت في حالتك، قم بالوضوء كإجراء احتياطي.",
            "en": "If in doubt about your state, perform Wudu as a precaution."
          }
        },
        {
          "title": {
            "ar": "إزالة النجاسة",
            "en": "Removing Impurities"
          },
          "description": {
            "ar": "تأكد من أن ملابسك وجسمك ومكان الصلاة خالٍ من النجاسة. اغسل أي نجاسة بالماء قبل بدء الوضوء أو الغسل.",
            "en": "Ensure your clothes, body, and prayer place are free of impurities. Wash any impurities with water before starting Wudu or Ghusl."
          },
          "tips": {
            "ar": "افحص ملابسك قبل الصلاة للتأكد من خلوها من النجاسة.",
            "en": "Check your clothes before prayer to ensure they are free of impurities."
          }
        },
        {
          "title": {
            "ar": "أداء الوضوء أو الغسل",
            "en": "Performing Wudu or Ghusl"
          },
          "description": {
            "ar": "إذا كنت بحاجة إلى وضوء، اغسل الأعضاء بالترتيب. إذا كنت بحاجة إلى غسل، أكمل الغسل الكامل. إذا لم يتوفر الماء، قم بالتيمم.",
            "en": "If you need Wudu, wash the parts in order. If you need Ghusl, complete the full ritual bath. If water is unavailable, perform Tayammum."
          },
          "tips": {
            "ar": "خصص مكاناً نظيفاً للوضوء أو الغسل لتجنب التشتت.",
            "en": "Designate a clean area for Wudu or Ghusl to avoid distraction."
          }
        },
        {
          "title": {
            "ar": "الاستعداد للصلاة",
            "en": "Preparing for Prayer"
          },
          "description": {
            "ar": "بعد الطهارة، ارتدِ ملابس طاهرة، واختر مكاناً نظيفاً للصلاة. استعد بالذكر والدعاء لتعزيز الخشوع.",
            "en": "After purification, wear clean clothes and choose a clean place for prayer. Prepare with remembrance and supplication to enhance devotion."
          },
          "tips": {
            "ar": "ردد دعاء ما قبل الصلاة مثل 'اللهم أنت السلام ومنك السلام'.",
            "en": "Recite a pre-prayer supplication like 'Allahumma anta as-salam wa minka as-salam.'"
          }
        }
      ],
      "additional_info": {
        "ar": "الطهارة قبل الصلاة شرط لصحتها، وهي تعزز الاتصال الروحي بالله. ورد في الحديث أن الطهارة نصف الإيمان.",
        "en": "Purification before prayer is a condition for its validity and enhances spiritual connection with Allah. Hadith states that purity is half of faith."
      },
      "common_mistakes": {
        "ar": "الصلاة دون طهارة، إهمال إزالة النجاسة، أو عدم التأكد من نظافة مكان الصلاة.",
        "en": "Praying without purification, neglecting to remove impurities, or not ensuring the prayer place is clean."
      }
    },
    {
      "id": "personal-hygiene",
      "title": {
        "ar": "كيفية الحفاظ على النظافة الشخصية",
        "en": "How to Maintain Personal Hygiene"
      },
      "category": {
        "ar": "الطهارة",
        "en": "Purification"
      },
      "description": {
        "ar": "دليل مفصل للحفاظ على النظافة الشخصية وفق السنة النبوية، مع توضيح الآداب المتعلقة بالنظافة",
        "en": "Detailed guide for maintaining personal hygiene according to the Prophetic tradition, including related etiquettes"
      },
      "icon": "fas fa-bath",
      "steps": [
        {
          "title": {
            "ar": "الاستحمام المنتظم",
            "en": "Regular Bathing"
          },
          "description": {
            "ar": "استحم بانتظام، خاصة يوم الجمعة (مستحب) وبعد الأنشطة التي تسبب العرق أو الأوساخ. استخدم الماء والصابون لتنظيف الجسم.",
            "en": "Bathe regularly, especially on Fridays (recommended) and after activities causing sweat or dirt. Use water and soap to clean the body."
          },
          "tips": {
            "ar": "خصص وقتاً للاستحمام يوم الجمعة قبل الصلاة لنيل الأجر.",
            "en": "Allocate time to bathe on Fridays before prayer for reward."
          }
        },
        {
          "title": {
            "ar": "العناية بالشعر والأظافر",
            "en": "Caring for Hair and Nails"
          },
          "description": {
            "ar": "قص الأظافر بانتظام، وأزل شعر العانة والإبط كل أربعين يوماً على الأكثر. مشط الشعر ونظفه للحفاظ على المظهر الطيب.",
            "en": "Trim nails regularly, remove pubic and armpit hair every forty days at most. Comb and clean hair to maintain a good appearance."
          },
          "tips": {
            "ar": "ابدأ بقص الأظافر من اليد اليمنى، كما ورد في السنة.",
            "en": "Start trimming nails from the right hand, as per the Sunnah."
          }
        },
        {
          "title": {
            "ar": "نظافة الفم والأسنان",
            "en": "Oral and Dental Hygiene"
          },
          "description": {
            "ar": "استخدم السواك أو فرشاة الأسنان لتنظيف الأسنان يومياً، خاصة قبل الصلاة. اغسل الفم بعد الأكل لإزالة بقايا الطعام.",
            "en": "Use a Miswak or toothbrush to clean teeth daily, especially before prayer. Rinse the mouth after eating to remove food residues."
          },
          "tips": {
            "ar": "احتفظ بسواك صغير في جيبك للاستخدام أثناء اليوم.",
            "en": "Keep a small Miswak in your pocket for use during the day."
          }
        },
        {
          "title": {
            "ar": "ارتداء ملابس نظيفة",
            "en": "Wearing Clean Clothes"
          },
          "description": {
            "ar": "ارتدِ ملابس نظيفة ومحتشمة، خاصة عند الذهاب للصلاة أو المناسبات الدينية. اغسل الملابس بانتظام لإزالة الأوساخ.",
            "en": "Wear clean, modest clothes, especially for prayer or religious occasions. Wash clothes regularly to remove dirt."
          },
          "tips": {
            "ar": "خصص ملابس خاصة بالصلاة للحفاظ على طهارتها.",
            "en": "Designate specific clothes for prayer to maintain their purity."
          }
        }
      ],
      "additional_info": {
        "ar": "النظافة الشخصية جزء من الإيمان، كما ورد في الحديث: 'الطهور شطر الإيمان'. تعكس النظافة احترام الذات والآخرين.",
        "en": "Personal hygiene is part of faith, as per the Hadith: 'Purity is half of faith.' Hygiene reflects self-respect and respect for others."
      },
      "common_mistakes": {
        "ar": "إهمال تنظيف الأسنان، ترك شعر العانة أو الأظافر طويلاً، أو ارتداء ملابس متسخة للصلاة.",
        "en": "Neglecting dental hygiene, leaving pubic hair or nails untrimmed, or wearing dirty clothes for prayer."
      }
    },
    {
      "id": "dhikr-mosque",
      "title": {
        "ar": "أذكار دخول المسجد والخروج منه",
        "en": "Supplications for Entering and Leaving the Mosque"
      },
      "category": {
        "ar": "الأذكار",
        "en": "Remembrance"
      },
      "description": {
        "ar": "دليل مفصل لأذكار دخول المسجد والخروج منه وفق السنة النبوية، مع توضيح فوائدها وآدابها",
        "en": "Detailed guide for supplications when entering and leaving the mosque according to the Prophetic tradition, including their benefits and etiquettes"
      },
      "icon": "fas fa-mosque",
      "steps": [
        {
          "title": {
            "ar": "دعاء دخول المسجد",
            "en": "Supplication for Entering the Mosque"
          },
          "description": {
            "ar": "عند دخول المسجد، قل: 'اللهم افتح لي أبواب رحمتك'، وادخل بالقدم اليمنى.",
            "en": "When entering the mosque, say: 'Allahumma iftah li abwaba rahmatik,' and enter with the right foot."
          },
          "tips": {
            "ar": "ردد الدعاء بتركيز وخشوع لاستشعار قدسية المكان.",
            "en": "Recite the supplication with focus and humility to feel the sanctity of the place."
          }
        },
        {
          "title": {
            "ar": "دعاء الخروج من المسجد",
            "en": "Supplication for Leaving the Mosque"
          },
          "description": {
            "ar": "عند الخروج، قل: 'اللهم إني أسألك من فضلك'، واخرج بالقدم اليمنى.",
            "en": "When leaving, say: 'Allahumma inni as’aluk min fadlika,' and exit with the right foot."
          },
          "tips": {
            "ar": "تأكد من إكمال الدعاء قبل مغادرة المسجد بالكامل.",
            "en": "Ensure you complete the supplication before fully leaving the mosque."
          }
        },
        {
          "title": {
            "ar": "صلاة تحية المسجد",
            "en": "Praying Tahiyyat al-Masjid"
          },
          "description": {
            "ar": "بعد الدخول، صل ركعتين تحية المسجد قبل الجلوس إن لم تكن الصلاة مكتوبة وقتها، وأكثر من الذكر أثناء انتظار الصلاة.",
            "en": "After entering, pray two Rak’ahs of Tahiyyat al-Masjid before sitting if it’s not time for an obligatory prayer, and increase Dhikr while awaiting prayer."
          },
          "tips": {
            "ar": "اختر مكاناً هادئاً في المسجد لأداء الركعتين بتركيز.",
            "en": "Choose a quiet spot in the mosque to perform the two Rak’ahs with focus."
          }
        },
        {
          "title": {
            "ar": "الالتزام بالآداب",
            "en": "Adhering to Etiquettes"
          },
          "description": {
            "ar": "التزم بالهدوء، تجنب الكلام الدنيوي، وحافظ على نظافة المسجد. كرر الأذكار بقلب حاضر لتعظيم الأجر.",
            "en": "Maintain silence, avoid worldly talk, and keep the mosque clean. Repeat the supplications with a present heart to maximize reward."
          },
          "tips": {
            "ar": "ضع هاتفك على الوضع الصامت لتجنب الإزعاج أثناء الذكر.",
            "en": "Put your phone on silent mode to avoid disturbance during Dhikr."
          }
        }
      ],
      "additional_info": {
        "ar": "أذكار دخول المسجد والخروج منه تجلب الرحمة والفضل. ورد في الحديث أن المساجد بيوت الله، ومن داوم على أذكارها نال بركة عظيمة.",
        "en": "Supplications for entering and leaving the mosque bring mercy and favor. Hadith states that mosques are Allah’s houses, and those who persist in their supplications gain great blessings."
      },
      "common_mistakes": {
        "ar": "إهمال الأذكار، الدخول أو الخروج بدون دعاء، أو التحدث بصوت عالٍ في المسجد.",
        "en": "Neglecting the supplications, entering or leaving without dua, or speaking loudly in the mosque."
      }
    },
    {
      "id": "dhikr-knowledge",
      "title": {
        "ar": "أذكار طلب العلم",
        "en": "Supplications for Seeking Knowledge"
      },
      "category": {
        "ar": "الأذكار",
        "en": "Remembrance"
      },
      "description": {
        "ar": "دليل مفصل لأذكار طلب العلم وفق السنة النبوية، مع توضيح فوائدها وآدابها",
        "en": "Detailed guide for supplications when seeking knowledge according to the Prophetic tradition, including their benefits and etiquettes"
      },
      "icon": "fas fa-book",
      "steps": [
        {
          "title": {
            "ar": "دعاء قبل طلب العلم",
            "en": "Supplication Before Seeking Knowledge"
          },
          "description": {
            "ar": "قبل الدراسة أو طلب العلم، قل: 'اللهم انفعني بما علمتني، وعلمني ما ينفعني، وزدني علماً'.",
            "en": "Before studying or seeking knowledge, say: 'Allahumma infa’ni bima allamtani, wa allimni ma yanfa’uni, wa zidni ilma.'"
          },
          "tips": {
            "ar": "ابدأ جلسة الدراسة بهذا الدعاء لتفتح ذهنك وتكسب البركة.",
            "en": "Start your study session with this dua to open your mind and gain blessings."
          }
        },
        {
          "title": {
            "ar": "دعاء فهم العلم",
            "en": "Supplication for Understanding Knowledge"
          },
          "description": {
            "ar": "لطلب الفهم، قل: 'رب اشرح لي صدري، ويسر لي أمري، واحلل عقدة من لساني يفقهوا قولي' (سورة طه: 25-28).",
            "en": "For understanding knowledge, say: 'Rabbi ishrah li sadri, wa yassir li amri, wa ahlul uqdatan min lisani yafqahu qawli' (Surah Taha: 25-28)."
          },
          "tips": {
            "ar": "ردد هذا الدعاء عند مواجهة موضوع صعب لتسهيل الفهم.",
            "en": "Recite this dua when facing a difficult topic to ease understanding."
          }
        },
        {
          "title": {
            "ar": "الذكر أثناء التعلم",
            "en": "Dhikr During Learning"
          },
          "description": {
            "ar": "أكثر من قول: 'سبحان الله، الحمد لله، الله أكبر' أثناء التعلم لتجديد النية وطلب التوفيق.",
            "en": "Frequently say: 'SubhanAllah, Alhamdulillah, Allahu Akbar' during learning to renew your intention and seek success."
          },
          "tips": {
            "ar": "خذ استراحة قصيرة للذكر إذا شعرت بالتشتت أثناء الدراسة.",
            "en": "Take a short break for Dhikr if you feel distracted during study."
          }
        },
        {
          "title": {
            "ar": "شكر الله بعد التعلم",
            "en": "Thanking Allah After Learning"
          },
          "description": {
            "ar": "بعد انتهاء الدراسة، قل: 'الحمد لله الذي هداني لهذا وما كنت لأهتدي لولا أن هداني الله'.",
            "en": "After finishing study, say: 'Alhamdulillah alladhi hadani lihadh wa ma kuntu li-ahtadi lawla an hadani Allah.'"
          },
          "tips": {
            "ar": "خصص لحظة لشكر الله على نعمة العلم بعد كل جلسة.",
            "en": "Dedicate a moment to thank Allah for the blessing of knowledge after each session."
          }
        }
      ],
      "additional_info": {
        "ar": "أذكار طلب العلم تجلب التوفيق وتفتح الذهن. ورد في الحديث أن طلب العلم فريضة على كل مسلم، وأذكاره تزيد البركة.",
        "en": "Supplications for seeking knowledge bring success and clarity. Hadith states that seeking knowledge is obligatory for every Muslim, and its supplications add blessings."
      },
      "common_mistakes": {
        "ar": "إهمال أذكار العلم، الدراسة بدون نية صالحة، أو عدم شكر الله بعد التعلم.",
        "en": "Neglecting knowledge supplications, studying without a righteous intention, or not thanking Allah after learning."
      }
    },
    {
      "id": "dhikr-distress",
      "title": {
        "ar": "أذكار الهم والحزن",
        "en": "Dhikr During Distress or Anxiety"
      },
      "category": {
        "ar": "الأذكار",
        "en": "Remembrance"
      },
      "description": {
        "ar": "دليل مفصل لأذكار تخفيف الهم والحزن وفق السنة النبوية، مع توضيح فوائدها",
        "en": "Detailed guide for Dhikr to alleviate distress or anxiety according to the Prophetic tradition, including their benefits"
      },
      "icon": "fas fa-heart",
      "steps": [
        {
          "title": {
            "ar": "دعاء كشف الهم",
            "en": "Supplication to Relieve Distress"
          },
          "description": {
            "ar": "قل: 'اللهم إني أعوذ بك من الهم والحزن، والعجز والكسل، والجبن والبخل، وضلع الدين وغلبة الرجال' ثلاث مرات.",
            "en": "Say: 'Allahumma inni a’udhu bika min al-hammi wal-hazan, wal-ajzi wal-kasal, wal-jubni wal-bukhl, wa dala’id-dayn wa ghalabatir-rijal' three times."
          },
          "tips": {
            "ar": "ردد الدعاء في مكان هادئ لتستشعر الراحة النفسية.",
            "en": "Recite the dua in a quiet place to feel psychological relief."
          }
        },
        {
          "title": {
            "ar": "دعاء الفرج",
            "en": "Supplication for Relief"
          },
          "description": {
            "ar": "قل: 'لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السماوات ورب الأرض ورب العرش الكريم' عند الضيق.",
            "en": "Say: 'La ilaha illa Allah al-azim al-halim, la ilaha illa Allah rabbul-arsh al-azim, la ilaha illa Allah rabbus-samawati wa rabbul-ardi wa rabbul-arsh al-karim' during distress."
          },
          "tips": {
            "ar": "ردد هذا الدعاء ببطء وتدبر لتخفيف الضغط النفسي.",
            "en": "Recite this dua slowly with reflection to alleviate mental stress."
          }
        },
        {
          "title": {
            "ar": "الإكثار من الاستغفار",
            "en": "Increasing Istighfar"
          },
          "description": {
            "ar": "أكثر من قول: 'أستغفر الله وأتوب إليه' عند الشعور بالهم، فالاستغفار يفرج الكرب ويجلب الراحة.",
            "en": "Frequently say: 'Astaghfirullah wa atubu ilayh' when feeling distressed, as Istighfar relieves hardship and brings comfort."
          },
          "tips": {
            "ar": "استخدم مسبحة أو أصابعك لترديد الاستغفار 100 مرة.",
            "en": "Use prayer beads or fingers to recite Istighfar 100 times."
          }
        },
        {
          "title": {
            "ar": "الصبر والصلاة",
            "en": "Patience and Prayer"
          },
          "description": {
            "ar": "استعن بالصبر والصلاة كما أمر الله في القرآن (البقرة: 153)، وادع بقلب صادق لرفع الهم والحزن.",
            "en": "Seek help through patience and prayer as Allah commanded in the Quran (Al-Baqarah: 153), and supplicate sincerely to remove distress and sadness."
          },
          "tips": {
            "ar": "صل ركعتين نافلة وادع بعدها لتجد الطمأنينة.",
            "en": "Pray two voluntary Rak’ahs and supplicate afterward for tranquility."
          }
        }
      ],
      "additional_info": {
        "ar": "أذكار الهم والحزن تفرج الكرب وتجلب السكينة. ورد في الحديث أن من قال دعاء الهم كشف الله همه وأبدله فرحاً.",
        "en": "Dhikr for distress and anxiety relieves hardship and brings peace. Hadith states that whoever recites the distress dua, Allah removes their worry and replaces it with joy."
      },
      "common_mistakes": {
        "ar": "إهمال الأذكار عند الضيق، التسرع في الدعاء بدون إخلاص، أو اليأس من الفرج.",
        "en": "Neglecting Dhikr during distress, rushing through dua without sincerity, or despairing of relief."
      }
    },
    {
      "id": "dhikr-gratitude",
      "title": {
        "ar": "أذكار الشكر",
        "en": "Supplications for Gratitude (Shukr)"
      },
      "category": {
        "ar": "الأذكار",
        "en": "Remembrance"
      },
      "description": {
        "ar": "دليل مفصل لأذكار الشكر لله على النعم وفق السنة النبوية، مع توضيح فوائدها",
        "en": "Detailed guide for supplications of gratitude to Allah for blessings according to the Prophetic tradition, including their benefits"
      },
      "icon": "fas fa-thumbs-up",
      "steps": [
        {
          "title": {
            "ar": "قول الحمد لله",
            "en": "Saying Alhamdulillah"
          },
          "description": {
            "ar": "قل: 'الحمد لله' كثيراً عند تلقي نعمة أو فرح، فهي تعبير عن الشكر والامتنان لله.",
            "en": "Say: 'Alhamdulillah' frequently upon receiving a blessing or joy, as it expresses gratitude and appreciation to Allah."
          },
          "tips": {
            "ar": "ردد 'الحمد لله' في كل موقف سعيد لتزيد النعم.",
            "en": "Recite 'Alhamdulillah' in every happy moment to increase blessings."
          }
        },
        {
          "title": {
            "ar": "دعاء الشكر",
            "en": "Supplication of Gratitude"
          },
          "description": {
            "ar": "قل: 'اللهم لك الحمد كما ينبغي لجلال وجهك وعظيم سلطانك' لتعظيم شكر الله على نعمه.",
            "en": "Say: 'Allahumma laka al-hamd kama yanbaghi li jalali wajhika wa azimi sultanik' to magnify gratitude to Allah for His blessings."
          },
          "tips": {
            "ar": "ردد هذا الدعاء بعد كل نعمة كبيرة كالصحة أو الرزق.",
            "en": "Recite this dua after major blessings like health or sustenance."
          }
        },
        {
          "title": {
            "ar": "سجود الشكر",
            "en": "Prostration of Gratitude"
          },
          "description": {
            "ar": "عند تلقي نعمة عظيمة، اسجد لله شكراً وقُل: 'سبحان ربي الأعلى، الحمد لله' ثلاث مرات.",
            "en": "Upon receiving a great blessing, prostrate to Allah in gratitude and say: 'Subhana rabbi al-a’la, alhamdulillah' three times."
          },
          "tips": {
            "ar": "تأكد من الطهارة واستقبال القبلة أثناء سجود الشكر.",
            "en": "Ensure purity and face the Qiblah during the prostration of gratitude."
          }
        },
        {
          "title": {
            "ar": "تذكر النعم",
            "en": "Reflecting on Blessings"
          },
          "description": {
            "ar": "تأمل في نعم الله عليك يومياً (الصحة، الأمن، الرزق)، واشكره بقلبك ولسانك لتزيد النعم.",
            "en": "Reflect daily on Allah’s blessings upon you (health, safety, sustenance), and thank Him with your heart and tongue to increase blessings."
          },
          "tips": {
            "ar": "اكتب قائمة بالنعم يومياً لتعزيز شعور الامتنان.",
            "en": "Write a daily list of blessings to enhance feelings of gratitude."
          }
        }
      ],
      "additional_info": {
        "ar": "الشكر يزيد النعم ويجلب رضا الله. ورد في القرآن: 'لئن شكرتم لأزيدنكم' (إبراهيم: 7)، والشكر عبادة عظيمة.",
        "en": "Gratitude increases blessings and earns Allah’s pleasure. The Quran states: 'If you are grateful, I will surely increase you' (Ibrahim: 7), and gratitude is a great act of worship."
      },
      "common_mistakes": {
        "ar": "إهمال شكر النعم، الشكر باللسان دون القلب، أو نسيان سجود الشكر عند النعم الكبيرة.",
        "en": "Neglecting to thank for blessings, thanking with the tongue but not the heart, or forgetting the prostration of gratitude for major blessings."
      }
    },
    {
      "id": "dhikr-marketplace",
      "title": {
        "ar": "أذكار دخول السوق",
        "en": "Supplications for Entering the Marketplace"
      },
      "category": {
        "ar": "الأذكار",
        "en": "Remembrance"
      },
      "description": {
        "ar": "دليل مفصل لأذكار دخول السوق وفق السنة النبوية، مع توضيح فوائدها وآدابها",
        "en": "Detailed guide for supplications when entering the marketplace according to the Prophetic tradition, including their benefits and etiquettes"
      },
      "icon": "fas fa-store",
      "steps": [
        {
          "title": {
            "ar": "دعاء دخول السوق",
            "en": "Supplication for Entering the Marketplace"
          },
          "description": {
            "ar": "عند دخول السوق، قل: 'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، يحيي ويميت، وهو حي لا يموت، بيده الخير، وهو على كل شيء قدير'.",
            "en": "When entering the marketplace, say: 'La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd, yuhyi wa yumit, wa huwa hayyun la yamut, bi yadihi al-khayr, wa huwa ala kulli shay’in qadir.'"
          },
          "tips": {
            "ar": "ردد الدعاء بصوت منخفض عند دخول السوق لتجنب التشتت.",
            "en": "Recite the dua quietly upon entering the marketplace to avoid distraction."
          }
        },
        {
          "title": {
            "ar": "النية الصالحة",
            "en": "Righteous Intention"
          },
          "description": {
            "ar": "اعقد النية أن تكون معاملاتك في السوق حلالاً ونزيهة، وأن تشتري ما ينفعك وأهلك بعيداً عن الإسراف.",
            "en": "Intend that your transactions in the marketplace be lawful and honest, and that you buy what benefits you and your family without extravagance."
          },
          "tips": {
            "ar": "ذكّر نفسك بالصدق والأمانة قبل البيع أو الشراء.",
            "en": "Remind yourself of honesty and integrity before buying or selling."
          }
        },
        {
          "title": {
            "ar": "الذكر أثناء التسوق",
            "en": "Dhikr While Shopping"
          },
          "description": {
            "ar": "أكثر من قول: 'سبحان الله والحمد لله' أثناء التسوق لتحفظ نفسك من الفتن وتجلب البركة في رزقك.",
            "en": "Frequently say: 'SubhanAllah walhamdulillah' while shopping to protect yourself from temptations and bring blessings to your sustenance."
          },
          "tips": {
            "ar": "احتفظ بمسبحة صغيرة لتسهيل الذكر أثناء التجول في السوق.",
            "en": "Keep a small prayer bead to facilitate Dhikr while navigating the marketplace."
          }
        },
        {
          "title": {
            "ar": "شكر الله بعد الشراء",
            "en": "Thanking Allah After Purchasing"
          },
          "description": {
            "ar": "بعد الشراء، قل: 'الحمد لله الذي رزقني من فضله' لشكر الله على توفيقه في الرزق.",
            "en": "After purchasing, say: 'Alhamdulillah alladhi razaqani min fadlhi' to thank Allah for His provision."
          },
          "tips": {
            "ar": "خصص لحظة للذكر بعد الدفع لتعزيز شعور الامتنان.",
            "en": "Take a moment for Dhikr after paying to enhance feelings of gratitude."
          }
        }
      ],
      "additional_info": {
        "ar": "أذكار السوق تجلب البركة في الرزق وتحمي من الغش والفتن. ورد في الحديث أن من قال هذا الدعاء كتب له ألف حسنة ومحي عنه ألف سيئة.",
        "en": "Marketplace supplications bring blessings to sustenance and protect from deceit and temptations. Hadith states that whoever recites this dua gets a thousand good deeds recorded and a thousand sins erased."
      },
      "common_mistakes": {
        "ar": "إهمال دعاء السوق، الدخول بدون ذكر، أو الانشغال بالتسوق عن الذكر.",
        "en": "Neglecting the marketplace dua, entering without remembrance, or being too occupied with shopping to remember Dhikr."
      }
    },
    {
      "id": "dhikr-gatherings",
      "title": {
        "ar": "أذكار كفارة المجلس",
        "en": "Dhikr for Expiating Sins of Gatherings"
      },
      "category": {
        "ar": "الأذكار",
        "en": "Remembrance"
      },
      "description": {
        "ar": "دليل مفصل لأذكار كفارة المجلس وفق السنة النبوية، مع توضيح فوائدها وآدابها",
        "en": "Detailed guide for Dhikr to expiate sins of gatherings according to the Prophetic tradition, including their benefits and etiquettes"
      },
      "icon": "fas fa-users",
      "steps": [
        {
          "title": {
            "ar": "دعاء كفارة المجلس",
            "en": "Supplication for Expiating Gatherings"
          },
          "description": {
            "ar": "قبل مغادرة المجلس، قل: 'سبحانك اللهم وبحمدك، أشهد أن لا إله إلا أنت، أستغفرك وأتوب إليك' لتكفير ما حدث من لغو أو ذنب.",
            "en": "Before leaving a gathering, say: 'Subhanaka Allahumma wa bihamdika, ashhadu an la ilaha illa anta, astaghfiruka wa atubu ilayk' to expiate any idle talk or sin."
          },
          "tips": {
            "ar": "ردد الدعاء بصوت منخفض إذا كنت في مجلس مزدحم.",
            "en": "Recite the dua quietly if in a crowded gathering."
          }
        },
        {
          "title": {
            "ar": "النية للتكفير",
            "en": "Intention for Expiation"
          },
          "description": {
            "ar": "اعقد النية أن تكفر عن أي خطأ أو لغو حدث في المجلس، سواء كان متعمداً أو غير متعمد.",
            "en": "Intend to expiate any mistake or idle talk that occurred in the gathering, whether intentional or unintentional."
          },
          "tips": {
            "ar": "تأمل في كلامك أثناء المجلس لتجنب اللغو قدر الإمكان.",
            "en": "Reflect on your speech during the gathering to avoid idle talk as much as possible."
          }
        },
        {
          "title": {
            "ar": "تذكير الآخرين",
            "en": "Reminding Others"
          },
          "description": {
            "ar": "إذا كنت في مجلس، ذكّر الحاضرين بهذا الدعاء بلطف إذا نسوه، لتعم البركة على الجميع.",
            "en": "If in a gathering, gently remind others of this dua if they forget, so the blessing benefits everyone."
          },
          "tips": {
            "ar": "استخدم عبارات لطيفة مثل 'هل نردد كفارة المجلس؟' للتذكير.",
            "en": "Use polite phrases like 'Shall we recite the expiation dua?' to remind others."
          }
        },
        {
          "title": {
            "ar": "الذكر في المجلس",
            "en": "Dhikr During the Gathering"
          },
          "description": {
            "ar": "أكثر من الذكر في المجلس، مثل: 'سبحان الله، الحمد لله'، لتحفظ المجلس من اللغو وتجلب البركة.",
            "en": "Increase Dhikr during the gathering, such as: 'SubhanAllah, Alhamdulillah,' to protect the gathering from idle talk and bring blessings."
          },
          "tips": {
            "ar": "وجه الحديث في المجلس إلى مواضيع نافعة مع الذكر.",
            "en": "Steer the conversation in the gathering toward beneficial topics alongside Dhikr."
          }
        }
      ],
      "additional_info": {
        "ar": "كفارة المجلس تكفر الذنوب التي قد تحدث في الجلسات. ورد في الحديث أن من قال هذا الدعاء غفر له ما كان في مجلسه.",
        "en": "Expiation of gatherings atones for sins that may occur in sessions. Hadith states that whoever recites this dua has their gathering’s sins forgiven."
      },
      "common_mistakes": {
        "ar": "مغادرة المجلس بدون دعاء الكفارة، الانشغال بالحديث الدنيوي، أو نسيان تذكير الآخرين.",
        "en": "Leaving the gathering without the expiation dua, being preoccupied with worldly talk, or forgetting to remind others."
      }
    },
    {
          "id": "voluntary-fasting",
          "title": {
            "ar": "كيفية أداء الصيام التطوعي",
            "en": "How to Perform Voluntary Fasting"
          },
          "category": {
            "ar": "العبادات",
            "en": "Worship"
          },
          "description": {
            "ar": "دليل لأداء الصيام التطوعي مثل أيام الإثنين والخميس، وعرفة، وعاشوراء، مع بيان فضائلها وأحكامها.",
            "en": "A guide to performing voluntary fasts such as Mondays and Thursdays, Arafah, and Ashura, outlining their virtues and rulings."
          },
          "icon": "fas fa-sun",
          "steps": [
            {
              "title": {
                "ar": "النية",
                "en": "Intention (Niyyah)"
              },
              "description": {
                "ar": "اعقد النية في قلبك لصيام اليوم التطوعي قبل الفجر. يمكن عقد النية لأي صيام تطوعي حتى بعد الفجر بوقت يسير ما لم تأكل أو تشرب.",
                "en": "Make the intention in your heart to fast the voluntary day before dawn. For voluntary fasts, the intention can be made even after dawn for a short period, provided you have not eaten or drunk."
              },
              "tips": {
                "ar": "تذكر فضل الصيام التطوعي لتعزيز نيتك.",
                "en": "Remember the virtues of voluntary fasting to strengthen your intention."
              }
            },
            {
              "title": {
                "ar": "السحور والإمساك",
                "en": "Pre-Dawn Meal (Suhur) and Abstention"
              },
              "description": {
                "ar": "تناول وجبة السحور قبل الفجر للاستعانة بها على الصيام، ثم امتنع عن الأكل والشرب والجماع من طلوع الفجر حتى غروب الشمس.",
                "en": "Consume the pre-dawn meal (Suhur) before Fajr to assist with the fast, then abstain from eating, drinking, and marital relations from dawn until sunset."
              },
              "tips": {
                "ar": "تأخير السحور فيه بركة، وتجنب الأطعمة التي تسبب العطش.",
                "en": "Delaying Suhur has blessings, and avoid foods that cause thirst."
              }
            },
            {
              "title": {
                "ar": "الإفطار",
                "en": "Breaking the Fast (Iftar)"
              },
              "description": {
                "ar": "أفطر عند غروب الشمس مباشرة، بادر بالتمر والماء. يستحب الإفطار على رطب أو تمر أو ماء.",
                "en": "Break your fast immediately at sunset, starting with dates and water. It is recommended to break fast with fresh dates, dried dates, or water."
              },
              "tips": {
                "ar": "ادع الله عند الإفطار، فدعاء الصائم مستجاب.",
                "en": "Supplicate to Allah at Iftar, as the fasting person's dua is answered."
              }
            }
          ],
          "additional_info": {
            "ar": "الصيام التطوعي يكفر الذنوب ويزيد الحسنات، ومن أشهر أيامه الإثنين والخميس، يوم عرفة (لغير الحاج)، ويوم عاشوراء (مع يوم قبله أو بعده).",
            "en": "Voluntary fasting expiates sins and increases good deeds. Among the most virtuous days are Mondays and Thursdays, the Day of Arafah (for non-pilgrims), and the Day of Ashura (with a day before or after)."
          },
          "common_mistakes": {
            "ar": "عدم عقد النية، أو الإفطار قبل الوقت، أو صيام يوم الجمعة منفرداً.",
            "en": "Not making the intention, breaking fast before time, or fasting only on Friday."
          }
        },
        {
          "id": "general-dhikr",
          "title": {
            "ar": "الذكر العام (تذكير الله في كل وقت)",
            "en": "General Dhikr (Remembrance of Allah at All Times)"
          },
          "category": {
            "ar": "الأذكار",
            "en": "Remembrance"
          },
          "description": {
            "ar": "دليل لأهمية وفضائل ذكر الله في كل وقت وحين، وكيفية جعله جزءاً من الحياة اليومية.",
            "en": "A guide to the importance and virtues of remembering Allah at all times, and how to integrate it into daily life."
          },
          "icon": "fas fa-hands-praying",
          "steps": [
            {
              "title": {
                "ar": "فضائل الذكر",
                "en": "Virtues of Dhikr"
              },
              "description": {
                "ar": "الذكر يطرد الشيطان، ويجلب الطمأنينة للقلب، ويرفع الدرجات، ويكفر السيئات. هو عبادة سهلة وميسرة.",
                "en": "Dhikr expels Satan, brings tranquility to the heart, elevates ranks, and expiates sins. It is an easy and accessible form of worship."
              },
              "tips": {
                "ar": "تأمل في فضائل الذكر لزيادة رغبتك فيه.",
                "en": "Reflect on the virtues of Dhikr to increase your desire for it."
              }
            },
            {
              "title": {
                "ar": "أذكار متنوعة",
                "en": "Various Forms of Dhikr"
              },
              "description": {
                "ar": "ردد 'سبحان الله وبحمده، سبحان الله العظيم' (الكلمتان الخفيفتان على اللسان، الثقيلتان في الميزان). أكثر من 'لا إله إلا الله'. قل 'الحمد لله' و 'الله أكبر'.",
                "en": "Recite 'SubhanAllah wa bihamdihi, SubhanAllah al-Azeem' (two phrases light on the tongue, heavy on the scale). Increase 'La ilaha illa Allah'. Say 'Alhamdulillah' and 'Allahu Akbar'."
              },
              "tips": {
                "ar": "استخدم المسبحة أو أصابعك لتتبع العدد إذا أردت.",
                "en": "Use prayer beads or your fingers to keep count if you wish."
              }
            },
            {
              "title": {
                "ar": "الذكر في كل الأوقات",
                "en": "Dhikr at All Times"
              },
              "description": {
                "ar": "اذكر الله عند الاستيقاظ، قبل النوم، عند دخول المنزل والخروج منه، عند الطعام، وأثناء العمل أو الدراسة. اجعل لسانك رطباً بذكر الله.",
                "en": "Remember Allah upon waking, before sleeping, when entering and leaving home, during meals, and while working or studying. Keep your tongue moist with the remembrance of Allah."
              },
              "tips": {
                "ar": "ربط الذكر بالأنشطة اليومية لتصبح عادة.",
                "en": "Associate Dhikr with daily activities to make it a habit."
              }
            }
          ],
          "additional_info": {
            "ar": "الذكر هو غذاء الروح، ويقوي صلة العبد بربه. وقد أمر الله تعالى بكثرة الذكر في القرآن الكريم.",
            "en": "Dhikr is the nourishment of the soul and strengthens the servant's connection with their Lord. Allah has commanded abundant remembrance in the Holy Quran."
          },
          "common_mistakes": {
            "ar": "الغفلة عن الذكر، أو اعتقاد أنه خاص بأوقات معينة فقط، أو النطق بالذكر بدون تدبر.",
            "en": "Neglecting Dhikr, believing it's only for specific times, or reciting it without reflection."
          }
        },
        {
          "id": "reciting-salawat",
          "title": {
            "ar": "كيفية الصلاة على النبي (صلوات)",
            "en": "How to Send Blessings Upon the Prophet (Salawat)"
          },
          "category": {
            "ar": "العبادات",
            "en": "Worship"
          },
          "description": {
            "ar": "دليل لأهمية وفضائل الصلاة على النبي محمد صلى الله عليه وسلم، وصيغها المختلفة.",
            "en": "A guide to the importance and virtues of sending blessings upon Prophet Muhammad (peace be upon him), and its various forms."
          },
          "icon": "fas fa-mosque",
          "steps": [
            {
              "title": {
                "ar": "فضائل الصلاة على النبي",
                "en": "Virtues of Sending Salawat"
              },
              "description": {
                "ar": "الصلاة على النبي سبب لرفع الدرجات، ومغفرة الذنوب، وكفاية الهموم، وإجابة الدعاء. كل صلاة منك عليه يرد الله عليك عشراً.",
                "en": "Sending Salawat upon the Prophet is a means of elevating ranks, forgiving sins, easing worries, and answering prayers. For every blessing you send upon him, Allah sends ten upon you."
              },
              "tips": {
                "ar": "تذكر هذه الفضائل لتزيد من حرصك على الصلاة عليه.",
                "en": "Remember these virtues to increase your eagerness to send blessings upon him."
              }
            },
            {
              "title": {
                "ar": "صيغ الصلاة على النبي",
                "en": "Forms of Salawat"
              },
              "description": {
                "ar": "من أشهر الصيغ: 'اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد، وبارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد' (الصلاة الإبراهيمية). يمكن أيضاً قول 'اللهم صل وسلم على نبينا محمد'.",
                "en": "Among the most common forms: 'Allahumma Salli ‘ala Muhammad wa ‘ala ali Muhammad, kama sallayta ‘ala Ibrahim wa ‘ala ali Ibrahim, innaka Hamidun Majid. Allahumma Barik ‘ala Muhammad wa ‘ala ali Muhammad, kama barakta ‘ala Ibrahim wa ‘ala ali Ibrahim, innaka Hamidun Majid' (the Ibrahimi Salawat). One can also say 'Allahumma Salli wa Sallim ‘ala Nabiyyina Muhammad'."
              },
              "tips": {
                "ar": "احفظ الصلاة الإبراهيمية ورددها لتنال الأجر العظيم.",
                "en": "Memorize the Ibrahimi Salawat and recite it to gain great reward."
              }
            },
            {
              "title": {
                "ar": "أوقات استحباب الصلاة عليه",
                "en": "Recommended Times for Salawat"
              },
              "description": {
                "ar": "أكثر من الصلاة عليه يوم الجمعة وليلتها، وعند ذكر اسمه، وفي التشهد الأخير من الصلاة، وبعد الأذان.",
                "en": "Increase Salawat on Fridays and their nights, when his name is mentioned, in the final Tashahhud of prayer, and after the Adhan."
              },
              "tips": {
                "ar": "اجعلها ورداً يومياً لك، وخاصة في الصباح والمساء.",
                "en": "Make it a daily practice, especially in the morning and evening."
              }
            }
          ],
          "additional_info": {
            "ar": "الصلاة على النبي تعبير عن المحبة والتقدير له، وهي علامة من علامات الإيمان الصادق.",
            "en": "Sending blessings upon the Prophet is an expression of love and appreciation for him, and a sign of sincere faith."
          },
          "common_mistakes": {
            "ar": "التقليل من الصلاة عليه، أو نطقها بشكل خاطئ، أو تخصيص صيغ لم ترد في السنة.",
            "en": "Minimizing Salawat, mispronouncing it, or inventing forms not found in the Sunnah."
          }
        },
        {
          "id": "seeking-knowledge",
          "title": {
            "ar": "كيفية طلب العلم الشرعي (عبادة)",
            "en": "How to Seek Islamic Knowledge (Worship)"
          },
          "category": {
            "ar": "العبادات",
            "en": "Worship"
          },
          "description": {
            "ar": "دليل لأهمية طلب العلم الشرعي كعبادة عظيمة، وكيفية البدء فيه.",
            "en": "A guide to the importance of seeking Islamic knowledge as a great act of worship, and how to begin."
          },
          "icon": "fas fa-book-reader",
          "steps": [
            {
              "title": {
                "ar": "النية والإخلاص",
                "en": "Intention and Sincerity"
              },
              "description": {
                "ar": "اجعل نيتك في طلب العلم خالصة لوجه الله، لرفع الجهل عن نفسك وعن الآخرين، والعمل بما تعلمت. تجنب طلب العلم للمباهاة أو الجدال.",
                "en": "Make your intention in seeking knowledge purely for the sake of Allah, to remove ignorance from yourself and others, and to act upon what you learn. Avoid seeking knowledge for boasting or argumentation."
              },
              "tips": {
                "ar": "راجع نيتك باستمرار لتصحيح المسار.",
                "en": "Regularly review your intention to correct your path."
              }
            },
            {
              "title": {
                "ar": "البدء بالأساسيات",
                "en": "Starting with Basics"
              },
              "description": {
                "ar": "ابدأ بأساسيات العقيدة والفقه والعبادات التي تهم حياتك اليومية (مثل الطهارة والصلاة). يمكنك قراءة كتب مبسطة أو حضور دروس للمبتدئين.",
                "en": "Begin with the fundamentals of Aqidah (creed), Fiqh (jurisprudence), and Ibadah (worship) relevant to your daily life (e.g., purity and prayer). You can read simplified books or attend beginner classes."
              },
              "tips": {
                "ar": "ابحث عن مشايخ أو معلمين موثوقين لتلقي العلم منهم.",
                "en": "Seek trustworthy scholars or teachers to receive knowledge from."
              }
            },
            {
              "title": {
                "ar": "التدرج والمثابرة",
                "en": "Gradual Progress and Perseverance"
              },
              "description": {
                "ar": "لا تحاول تعلم كل شيء دفعة واحدة. تدرج في طلب العلم، وكن مثابراً في المراجعة والحفظ. العلم يؤخذ بالصبر والتكرار.",
                "en": "Do not try to learn everything at once. Progress gradually in seeking knowledge, and be persistent in reviewing and memorizing. Knowledge is acquired through patience and repetition."
              },
              "tips": {
                "ar": "خصص وقتاً ثابتاً يومياً لطلب العلم، ولو كان قصيراً.",
                "en": "Allocate a fixed daily time for seeking knowledge, even if short."
              }
            }
          ],
          "additional_info": {
            "ar": "طلب العلم فريضة على كل مسلم، وهو طريق إلى الجنة. قال النبي صلى الله عليه وسلم: 'من سلك طريقاً يلتمس فيه علماً سهل الله له به طريقاً إلى الجنة'.",
            "en": "Seeking knowledge is an obligation upon every Muslim and a path to Paradise. The Prophet (peace be upon him) said: 'Whoever takes a path upon which to seek knowledge, Allah will make easy for him a path to Paradise.'"
          },
          "common_mistakes": {
            "ar": "طلب العلم للجدال، أو عدم العمل بما تعلم، أو التوقف عن الطلب بعد فترة.",
            "en": "Seeking knowledge for argumentation, not acting upon what is learned, or stopping after a period."
          }
        },
        {
          "id": "tawakkul",
          "title": {
            "ar": "كيفية التوكل على الله (Trust in Allah)",
            "en": "How to Practice Tawakkul (Trust in Allah)"
          },
          "category": {
            "ar": "الأخلاق والسلوك",
            "en": "Ethics & Conduct"
          },
          "description": {
            "ar": "دليل لمفهوم التوكل على الله، وأهميته في حياة المسلم، وكيفية تحقيقه عملياً.",
            "en": "A guide to the concept of Tawakkul (trust in Allah), its importance in a Muslim's life, and how to achieve it practically."
          },
          "icon": "fas fa-handshake-angle",
          "steps": [
            {
              "title": {
                "ar": "فهم التوكل",
                "en": "Understanding Tawakkul"
              },
              "description": {
                "ar": "التوكل هو صدق الاعتماد على الله مع الأخذ بالأسباب. ليس تواكلاً أن تجلس في بيتك وتدعو بالرزق دون سعي.",
                "en": "Tawakkul is sincere reliance on Allah while taking the necessary means. It is not Tawakkul to sit at home and pray for sustenance without striving."
              },
              "tips": {
                "ar": "فرق بين التوكل والتواكل، فالتوكل عمل قلب والآخر كسل.",
                "en": "Distinguish between Tawakkul (reliance) and Tawaakul (laziness), as Tawakkul is an act of the heart and the latter is idleness."
              }
            },
            {
              "title": {
                "ar": "الأخذ بالأسباب",
                "en": "Taking the Means"
              },
              "description": {
                "ar": "ابذل قصارى جهدك في كل عمل تقوم به، ثم سلم أمرك لله. مثلاً: ادرس بجد ثم توكل على الله في النتيجة.",
                "en": "Exert your utmost effort in every task you undertake, then entrust your affair to Allah. For example: study diligently then rely on Allah for the outcome."
              },
              "tips": {
                "ar": "تجنب التفكير في النتائج بشكل مبالغ فيه بعد الأخذ بالأسباب.",
                "en": "Avoid overthinking the results after taking the means."
              }
            },
            {
              "title": {
                "ar": "صدق الاعتماد على الله",
                "en": "Sincere Reliance on Allah"
              },
              "description": {
                "ar": "بعد بذل الجهد، سلم أمرك لله بقلب مطمئن، واعلم أن ما شاء الله كان وما لم يشأ لم يكن. قل: 'حسبنا الله ونعم الوكيل'.",
                "en": "After exerting effort, entrust your matter to Allah with a tranquil heart, knowing that what Allah wills occurs, and what He does not will, does not occur. Say: 'Hasbunallah wa Ni'mal Wakeel' (Allah is sufficient for us, and He is the best Disposer of affairs)."
              },
              "tips": {
                "ar": "ردد الأذكار التي تزيد من توكلك على الله.",
                "en": "Recite supplications that increase your reliance on Allah."
              }
            }
          ],
          "additional_info": {
            "ar": "التوكل على الله من أعظم العبادات القلبية، وبه يرزق العبد ويُكفى همومه. قال تعالى: 'ومن يتوكل على الله فهو حسبه'.",
            "en": "Tawakkul is one of the greatest acts of worship of the heart, through which a servant is provided for and relieved of worries. Allah says: 'And whoever relies upon Allah - He is sufficient for him.'"
          },
          "common_mistakes": {
            "ar": "عدم الأخذ بالأسباب، أو الأخذ بالأسباب مع عدم الاعتماد على الله، أو اليأس عند عدم تحقق المراد.",
            "en": "Not taking the means, taking the means without relying on Allah, or despairing when desires are not fulfilled."
          }
        },
        {
          "id": "istikhara-prayer",
          "title": {
            "ar": "كيفية أداء صلاة الاستخارة",
            "en": "How to Perform Istikhara Prayer"
          },
          "category": {
            "ar": "الصلاة",
            "en": "Prayer"
          },
          "description": {
            "ar": "دليل مفصل لأداء صلاة الاستخارة، وهي صلاة لطلب التوجيه من الله في اتخاذ القرارات.",
            "en": "A detailed guide to performing Istikhara prayer, a prayer seeking guidance from Allah in making decisions."
          },
          "icon": "fas fa-compass",
          "steps": [
            {
              "title": {
                "ar": "النية للقرار",
                "en": "Intention for the Decision"
              },
              "description": {
                "ar": "قبل الصلاة، حدد الأمر الذي تحتار فيه (مثلاً: وظيفة، زواج، سفر). اجعل نيتك طلب الخيرة من الله في هذا الأمر.",
                "en": "Before the prayer, identify the matter you are hesitant about (e.g., a job, marriage, travel). Make your intention to seek Allah's best choice in this matter."
              },
              "tips": {
                "ar": "لا تصلِ الاستخارة في أمر قد حسمته أو لا تحتار فيه.",
                "en": "Do not perform Istikhara for a matter you have already decided or are not hesitant about."
              }
            },
            {
              "title": {
                "ar": "صلاة ركعتين",
                "en": "Performing Two Rak'ahs"
              },
              "description": {
                "ar": "صلِ ركعتين نافلة، مثل أي صلاة تطوعية. يفضل أن تكون في غير أوقات الكراهة (بعد الفجر حتى الشروق، وعند الزوال، وبعد العصر حتى الغروب).",
                "en": "Perform two rak'ahs of voluntary prayer, like any supererogatory prayer. It is preferable to do so outside disliked times (after Fajr until sunrise, at zenith, and after Asr until sunset)."
              },
              "tips": {
                "ar": "اقرأ في الركعة الأولى بعد الفاتحة سورة الكافرون، وفي الثانية سورة الإخلاص.",
                "en": "In the first rak'ah after Al-Fatiha, recite Surah Al-Kafirun, and in the second, Surah Al-Ikhlas."
              }
            },
            {
              "title": {
                "ar": "دعاء الاستخارة",
                "en": "Reciting Istikhara Dua"
              },
              "description": {
                "ar": "بعد السلام من الصلاة، ارفع يديك وادع بدعاء الاستخارة المأثور: 'اللهم إني أستخيرك بعلمك وأستقدرك بقدرتك...'. وعند ذكر حاجتك، قلها بوضوح.",
                "en": "After finishing the prayer with Salam, raise your hands and recite the narrated Istikhara dua: 'Allahumma inni astakhiruka bi ‘ilmik, wa astaqdiruka bi qudratik...' When mentioning your need, state it clearly."
              },
              "tips": {
                "ar": "ادع بتدبر ويقين، وافهم معاني الدعاء.",
                "en": "Supplicate with reflection and certainty, and understand the meanings of the dua."
              }
            },
            {
              "title": {
                "ar": "الاستشارة والمضي قدماً",
                "en": "Consultation and Proceeding"
              },
              "description": {
                "ar": "بعد الاستخارة، استشر أهل الخبرة والصلاح في الأمر. ثم امضِ في ما يميل إليه قلبك، فما قدره الله هو الخير لك.",
                "en": "After Istikhara, consult with people of experience and righteousness regarding the matter. Then proceed with what your heart inclines towards, for what Allah has decreed is best for you."
              },
              "tips": {
                "ar": "لا تنتظر رؤيا أو حلماً، بل تابع حياتك، والخير سيأتيك حيث شاء الله.",
                "en": "Do not wait for a vision or dream; rather, continue with your life, and good will come to you as Allah wills."
              }
            }
          ],
          "additional_info": {
            "ar": "صلاة الاستخارة هي طلب الخيرة من الله، وهي دليل على توكل العبد على ربه. لا تكررها مرات كثيرة إلا إذا لم يتبين لك شيء بعد فترة.",
            "en": "Istikhara prayer is seeking the best from Allah, and it is a sign of a servant's reliance on their Lord. Do not repeat it many times unless no clarity is gained after a period."
          },
          "common_mistakes": {
            "ar": "انتظار رؤيا أو إشارة صريحة، أو تكرار الصلاة دون الحاجة، أو عدم الأخذ بالأسباب والاستشارة.",
            "en": "Waiting for a clear vision or sign, repeating the prayer unnecessarily, or not taking means and consulting."
          }
        },
        {
          "id": "visiting-the-sick",
          "title": {
            "ar": "كيفية زيارة المريض في الإسلام",
            "en": "How to Visit the Sick in Islam"
          },
          "category": {
            "ar": "الأخلاق والسلوك",
            "en": "Ethics & Conduct"
          },
          "description": {
            "ar": "دليل لآداب زيارة المريض في الإسلام، وما يستحب قوله وفعله لعيادة المريض.",
            "en": "A guide to the etiquettes of visiting the sick in Islam, and what is recommended to say and do when visiting a patient."
          },
          "icon": "fas fa-bed",
          "steps": [
            {
              "title": {
                "ar": "النية والأجر",
                "en": "Intention and Reward"
              },
              "description": {
                "ar": "انوِ بزيارتك للمريض التقرب إلى الله، وإدخال السرور على قلب المريض، والدعاء له بالشفاء. زيارة المريض من أعظم الطاعات.",
                "en": "Intend by your visit to the sick to draw closer to Allah, to bring joy to the patient's heart, and to supplicate for their recovery. Visiting the sick is one of the greatest acts of obedience."
              },
              "tips": {
                "ar": "تذكر حديث: 'من عاد مريضاً... نادى مناد من السماء: طبت وطاب ممشاك، وتبوأت من الجنة منزلاً'.",
                "en": "Remember the Hadith: 'Whoever visits a sick person... a caller from the sky proclaims: You are good and your walking is good, and you have taken a dwelling in Paradise.'"
              }
            },
            {
              "title": {
                "ar": "آداب الزيارة",
                "en": "Etiquettes of Visiting"
              },
              "description": {
                "ar": "اختر وقتاً مناسباً للمريض (لا تزره في أوقات راحته أو نومه). لا تطل الجلوس عنده إلا إذا طلب هو ذلك. كن خفيفاً في زيارتك.",
                "en": "Choose a suitable time for the patient (do not visit during their rest or sleep). Do not stay long unless they ask you to. Be light in your visit."
              },
              "tips": {
                "ar": "تأكد من رضا أهل المريض عن زيارتك قبل الذهاب.",
                "en": "Ensure the patient's family is comfortable with your visit before going."
              }
            },
            {
              "title": {
                "ar": "ما يقال عند المريض",
                "en": "What to Say to the Patient"
              },
              "description": {
                "ar": "ادع للمريض بالشفاء، مثل: 'لا بأس طهور إن شاء الله'، أو 'اللهم رب الناس، أذهب البأس، اشف أنت الشافي لا شفاء إلا شفاؤك، شفاء لا يغادر سقماً'. طمئن المريض وبشره بالخير.",
                "en": "Supplicate for the patient's recovery, such as: 'La ba'sa, tahurun in sha Allah' (No harm, a purification, if Allah wills), or 'Allahumma Rabban-nas, adhhibil ba's, ishfi antash-Shafi, la shifa'a illa shifa'uk, shifa'an la yughadiru saqama' (O Allah, Lord of mankind, remove the hardship, heal You are the Healer, there is no healing except Your healing, a healing that leaves no sickness). Reassure the patient and give them good tidings."
              },
              "tips": {
                "ar": "اسأل المريض عن حاله بلطف، ولا تحمله على الحديث الطويل.",
                "en": "Ask the patient about their condition gently, and do not burden them with long conversations."
              }
            }
          ],
          "additional_info": {
            "ar": "زيارة المريض من حقوق المسلم على أخيه المسلم، وتجلب الأجر العظيم للمسلم وتزيد من التكافل الاجتماعي.",
            "en": "Visiting the sick is one of a Muslim's rights over another Muslim, bringing great reward and increasing social solidarity."
          },
          "common_mistakes": {
            "ar": "إطالة الزيارة، أو إزعاج المريض بالأسئلة الكثيرة، أو نقل أخبار سيئة له، أو عدم الدعاء له.",
            "en": "Prolonging the visit, bothering the patient with many questions, conveying bad news to them, or not supplicating for them."
          }
        }
      ]
    }



    